zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_X2.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_X2
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_X2_H_)  /* Check if memory map has not been already included */
#define S32K566_X2_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- X2 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup X2_Peripheral_Access_Layer X2 Peripheral Access Layer
 * @{
 */

/** X2 - Size of Registers Arrays */
#define X2_RAWMEM_D_ROM_CMNX_COUNT                16u
#define X2_RAWMEM_D_ROM_CMNX_RAWMEM_D_ROM_CMNX_BY_COUNT 8u
#define X2_RAWMEM_D_ROM_CMNX_RAWMEM_D_ROM_CMNX_BY_RAWMEM_D_ROM_CMNX_BY_RZ_COUNT 32u
#define X2_RAWMEM_D_RAM_CMNX_COUNT                16u
#define X2_RAWMEM_D_RAM_CMNX_RAWMEM_D_RAM_CMNX_BY_COUNT 8u
#define X2_RAWMEM_D_RAM_CMNX_RAWMEM_D_RAM_CMNX_BY_RAWMEM_D_RAM_CMNX_BY_RZ_COUNT 32u

/** X2 - Register Layout Typedef */
typedef struct X2_Struct {
  __I  uint16_t SUP_DIG_IDCODE_LO;                 /**< Low 16 bits of IDCODE, offset: 0x0 */
  uint8_t RESERVED_0[2];
  __I  uint16_t SUP_DIG_IDCODE_HI;                 /**< High 16 bits of IDCODE, offset: 0x4 */
  uint8_t RESERVED_1[2];
  __IO uint16_t SUP_DIG_REFCLK_OVRD_IN;            /**< Override values for incoming REFCLK and RESET controls from ASIC, offset: 0x8 */
  uint8_t RESERVED_2[2];
  __IO uint16_t SUP_DIG_SUP_OVRD_IN;               /**< Override values for support block ASIC inputs, offset: 0xC */
  uint8_t RESERVED_3[2];
  __IO uint16_t SUP_DIG_SUP_OVRD_OUT;              /**< Override values for support block ASIC outputs, offset: 0x10 */
  uint8_t RESERVED_4[2];
  __IO uint16_t SUP_DIG_LVL_OVRD_IN;               /**< Override values for level settings, offset: 0x14 */
  uint8_t RESERVED_5[2];
  __IO uint16_t SUP_DIG_DEBUG;                     /**< Debug controls, offset: 0x18 */
  uint8_t RESERVED_6[2];
  __I  uint16_t SUP_DIG_ASIC_IN;                   /**< Current values for incoming SUP control signals from ASIC, offset: 0x1C */
  uint8_t RESERVED_7[2];
  __I  uint16_t SUP_DIG_LVL_ASIC_IN;               /**< Current values for incoming level controls from ASIC, offset: 0x20 */
  uint8_t RESERVED_8[2];
  __I  uint16_t SUP_DIG_BANDGAP_ASIC_IN;           /**< Current values for incoming bandgap control from ASIC, offset: 0x24 */
  uint8_t RESERVED_9[2];
  __IO uint16_t SUP_DIG_CLK_RST_BG_PWRUP_TIME_0;   /**< BG Power UP Time Register #0, offset: 0x28 */
  uint8_t RESERVED_10[2];
  __IO uint16_t SUP_DIG_CLK_RST_BG_PWRUP_TIME_1;   /**< BG Power UP Time Register #1, offset: 0x2C */
  uint8_t RESERVED_11[2];
  __IO uint16_t SUP_ANA_RTUNE_CTRL;                /**< RTUNE_CTRL, offset: 0x30 */
  uint8_t RESERVED_12[2];
  __IO uint16_t SUP_ANA_SWITCH_PWR_MEAS;           /**< SWITCH_PWR_MEAS, offset: 0x34 */
  uint8_t RESERVED_13[2];
  __IO uint16_t SUP_ANA_SWITCH_MISC_MEAS;          /**< SWITCH_MISC_MEAS, offset: 0x38 */
  uint8_t RESERVED_14[2];
  __IO uint16_t SUP_ANA_BG;                        /**< BG, offset: 0x3C */
  uint8_t RESERVED_15[2];
  __IO uint16_t SUP_ANA_PRESCALER_CTRL;            /**< PRESCALER_CTRL, offset: 0x40 */
  uint8_t RESERVED_16[2];
  __IO uint16_t SUP_DIG_RTUNE_DEBUG;               /**< Resistor tuning debug controls, offset: 0x44 */
  uint8_t RESERVED_17[2];
  __IO uint16_t SUP_DIG_RTUNE_CONFIG;              /**< Configure Rtune Operation, offset: 0x48 */
  uint8_t RESERVED_18[2];
  __I  uint16_t SUP_DIG_RTUNE_STAT;                /**< Resistor tuning register status, offset: 0x4C */
  uint8_t RESERVED_19[2];
  __IO uint16_t SUP_DIG_RTUNE_RX_SET_VAL;          /**< Set value of RX Resistor, offset: 0x50 */
  uint8_t RESERVED_20[2];
  __IO uint16_t SUP_DIG_RTUNE_TXDN_SET_VAL;        /**< Set value of TX-DN Resistor, offset: 0x54 */
  uint8_t RESERVED_21[2];
  __IO uint16_t SUP_DIG_RTUNE_TXUP_SET_VAL;        /**< Set value of TX-UP Resistor, offset: 0x58 */
  uint8_t RESERVED_22[2];
  __I  uint16_t SUP_DIG_RTUNE_RX_STAT;             /**< RX Resistor tuning register status, offset: 0x5C */
  uint8_t RESERVED_23[2];
  __I  uint16_t SUP_DIG_RTUNE_TXDN_STAT;           /**< TX-DN Resistor tuning register status, offset: 0x60 */
  uint8_t RESERVED_24[2];
  __I  uint16_t SUP_DIG_RTUNE_TXUP_STAT;           /**< TX-UP Resistor tuning register status, offset: 0x64 */
  uint8_t RESERVED_25[2];
  __IO uint16_t SUP_DIG_ANA_RTUNE_OVRD_OUT;        /**< Override value for RTUNE signals going to ANA, offset: 0x68 */
  uint8_t RESERVED_26[2];
  __I  uint16_t SUP_DIG_ANA_STAT;                  /**< SUP input status register for SUP ANA outputs, offset: 0x6C */
  uint8_t RESERVED_27[2];
  __IO uint16_t SUP_DIG_ANA_ANA_OVRD_OUT;          /**< Override values for ana_async_rst and bandgap signals going to ANA, offset: 0x70 */
  uint8_t RESERVED_28[2];
  __IO uint16_t RAWCMN_DIG_CMN_CTL;                /**< Common control register, offset: 0x74 */
  uint8_t RESERVED_29[2];
  __IO uint16_t RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0; /**< Override values for incoming MPLLB SSC control settings, offset: 0x78 */
  uint8_t RESERVED_30[2];
  __IO uint16_t RAWCMN_DIG_CMN_CTL_1;              /**< Common control register 1, offset: 0x7C */
  uint8_t RESERVED_31[2];
  __IO uint16_t RAWCMN_DIG_CMN_CTL_2;              /**< Common control register 2, offset: 0x80 */
  uint8_t RESERVED_32[2];
  __IO uint16_t RAWCMN_DIG_MPLL_STATE_CTL;         /**< MPLL control signals for force ack state machine, offset: 0x84 */
  uint8_t RESERVED_33[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0; /**< Resistor Tune RX Value 0, offset: 0x88 */
  uint8_t RESERVED_34[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0; /**< Resistor Tune TX Down Value 0, offset: 0x8C */
  uint8_t RESERVED_35[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0; /**< Resistor Tune TX Up Value 0, offset: 0x90 */
  uint8_t RESERVED_36[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1; /**< Resistor Tune RX Value 1, offset: 0x94 */
  uint8_t RESERVED_37[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1; /**< Resistor Tune TX Down Value 1, offset: 0x98 */
  uint8_t RESERVED_38[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1; /**< Resistor Tune TX Up Value 1, offset: 0x9C */
  uint8_t RESERVED_39[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2; /**< Resistor Tune RX Value 2, offset: 0xA0 */
  uint8_t RESERVED_40[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2; /**< Resistor Tune TX Down Value 2, offset: 0xA4 */
  uint8_t RESERVED_41[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2; /**< Resistor Tune TX Up Value 2, offset: 0xA8 */
  uint8_t RESERVED_42[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3; /**< Resistor Tune RX Value 3, offset: 0xAC */
  uint8_t RESERVED_43[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3; /**< Resistor Tune TX Down Value 3, offset: 0xB0 */
  uint8_t RESERVED_44[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3; /**< Resistor Tune TX Up Value 3, offset: 0xB4 */
  uint8_t RESERVED_45[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4; /**< Resistor Tune RX Value 4, offset: 0xB8 */
  uint8_t RESERVED_46[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4; /**< Resistor Tune TX Down Value 4, offset: 0xBC */
  uint8_t RESERVED_47[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4; /**< Resistor Tune TX Up Value 4, offset: 0xC0 */
  uint8_t RESERVED_48[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5; /**< Resistor Tune RX Value 5, offset: 0xC4 */
  uint8_t RESERVED_49[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5; /**< Resistor Tune TX Down Value 5, offset: 0xC8 */
  uint8_t RESERVED_50[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5; /**< Resistor Tune TX Up Value 5, offset: 0xCC */
  uint8_t RESERVED_51[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6; /**< Resistor Tune RX Value 6, offset: 0xD0 */
  uint8_t RESERVED_52[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6; /**< Resistor Tune TX Down Value 6, offset: 0xD4 */
  uint8_t RESERVED_53[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6; /**< Resistor Tune TX Up Value 6, offset: 0xD8 */
  uint8_t RESERVED_54[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7; /**< Resistor Tune RX Value 7, offset: 0xDC */
  uint8_t RESERVED_55[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7; /**< Resistor Tune TX Down Value 7, offset: 0xE0 */
  uint8_t RESERVED_56[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7; /**< Resistor Tune TX Up Value 7, offset: 0xE4 */
  uint8_t RESERVED_57[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN; /**< Enable SRAM bootloader on power-gated exit, offset: 0xE8 */
  uint8_t RESERVED_58[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_PG_OVRD_IN;     /**< Override values for incoming power-gating signals, offset: 0xEC */
  uint8_t RESERVED_59[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_PG_OVRD_OUT;    /**< Override values for outgoing power-gating signals, offset: 0xF0 */
  uint8_t RESERVED_60[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_SUP_OVRD_IN;    /**< Override values for incoming SUP signals, offset: 0xF4 */
  uint8_t RESERVED_61[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE;  /**< Firmware Power-Up Done Status, offset: 0xF8 */
  uint8_t RESERVED_62[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_FW_VERSION_PMA_LABEL; /**< Firmware version register #0, offset: 0xFC */
  uint8_t RESERVED_63[2];
  __IO uint16_t RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL; /**< Firmware version register #1, offset: 0x100 */
  uint8_t RESERVED_64[130814];
  __IO uint16_t SUP_DIG_MPLLA_DIV_CLK_OVRD_IN;     /**< Override values for incoming MPLLA_DIV_CLK controls from ASIC, offset: 0x20000 */
  uint8_t RESERVED_65[2];
  __IO uint16_t SUP_DIG_MPLLA_OVRD_IN_0;           /**< Override values for incoming MPLLA controls from ASIC, offset: 0x20004 */
  uint8_t RESERVED_66[2];
  __IO uint16_t SUP_DIG_MPLLA_OVRD_IN_1;           /**< Override values for incoming MPLLA controls from ASIC, offset: 0x20008 */
  uint8_t RESERVED_67[2];
  __IO uint16_t SUP_DIG_MPLLA_OVRD_IN_2;           /**< Override values for incoming MPLLA controls from ASIC, offset: 0x2000C */
  uint8_t RESERVED_68[2];
  __IO uint16_t SUP_DIG_MPLLA_BANDWIDTH_OVRD_IN;   /**< Override values for incoming MPLLA bandwidth controls from ASIC, offset: 0x20010 */
  uint8_t RESERVED_69[2];
  __I  uint16_t SUP_DIG_MPLLA_ASIC_IN_0;           /**< Current values for incoming MPLLA controls from ASIC, offset: 0x20014 */
  uint8_t RESERVED_70[2];
  __I  uint16_t SUP_DIG_MPLLA_ASIC_IN_1;           /**< Current values for incoming MPLLA controls from ASIC, offset: 0x20018 */
  uint8_t RESERVED_71[2];
  __I  uint16_t SUP_DIG_MPLLA_ASIC_IN_2;           /**< Current values for incoming MPLLA controls from ASIC, offset: 0x2001C */
  uint8_t RESERVED_72[2];
  __I  uint16_t SUP_DIG_MPLLA_DIV_CLK_ASIC_IN;     /**< Current values for incoming MPLLA_DIV_CLK controls from ASIC, offset: 0x20020 */
  uint8_t RESERVED_73[2];
  __I  uint16_t SUP_DIG_MPLLA_BANDWIDTH_ASIC_IN;   /**< Current values for incoming MPLLA bandwidth controls from ASIC, offset: 0x20024 */
  uint8_t RESERVED_74[2];
  __IO uint16_t SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL; /**< MPLL Calibration controls, offset: 0x20028 */
  uint8_t RESERVED_75[2];
  __IO uint16_t SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD; /**< MPLL override controls, offset: 0x2002C */
  uint8_t RESERVED_76[2];
  __I  uint16_t SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT;   /**< MPLL status register, offset: 0x20030 */
  uint8_t RESERVED_77[2];
  __IO uint16_t SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD; /**< Thresholds for MPLL CAL Update timer and MPLL VCO Stabilization timer, offset: 0x20034 */
  uint8_t RESERVED_78[2];
  __IO uint16_t SUP_DIG_MPLLA_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD; /**< Thresholds for PCLK enable and MPLL VCO Clock Stabilization timer, offset: 0x20038 */
  uint8_t RESERVED_79[2];
  __IO uint16_t SUP_DIG_MPLLA_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD; /**< Thresholds for PCLK disable and MPLL VCO POWER DOWN timer, offset: 0x2003C */
  uint8_t RESERVED_80[2];
  __IO uint16_t SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD; /**< Thresholds for MPLL feedback clock enable and MPLL feedback digital clock disable and MPLL ANA POWER UP timer, offset: 0x20040 */
  uint8_t RESERVED_81[2];
  __I  uint16_t SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL; /**< MPLL coarse_tune value register, offset: 0x20044 */
  uint8_t RESERVED_82[2];
  __I  uint16_t SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE; /**< Value for MPLL coarse_tune when skipping calibration, offset: 0x20048 */
  uint8_t RESERVED_83[2];
  __IO uint16_t SUP_DIG_MPLLA_SSC_SS_PHASE;        /**< Current MPLL phase selector value, offset: 0x2004C */
  uint8_t RESERVED_84[2];
  __IO uint16_t SUP_DIG_MPLLA_SSC_SS_FREQ_0;       /**< Frequency Control for Spread Spectrum #0, offset: 0x20050 */
  uint8_t RESERVED_85[2];
  __IO uint16_t SUP_DIG_MPLLA_SSC_SS_FREQ_1;       /**< Frequency Control for Spread Spectrum #1, offset: 0x20054 */
  uint8_t RESERVED_86[2];
  __IO uint16_t SUP_ANA_MPLLA_MISC;                /**< MPLLA_MISC, offset: 0x20058 */
  uint8_t RESERVED_87[2];
  __IO uint16_t SUP_ANA_MPLLA_OVRD;                /**< MPLLA_OVRD, offset: 0x2005C */
  uint8_t RESERVED_88[2];
  __IO uint16_t SUP_ANA_MPLLA_ATB1;                /**< MPLLA_ATB1, offset: 0x20060 */
  uint8_t RESERVED_89[2];
  __IO uint16_t SUP_ANA_MPLLA_ATB2;                /**< MPLLA_ATB2, offset: 0x20064 */
  uint8_t RESERVED_90[2];
  __IO uint16_t SUP_ANA_MPLLA_ATB3;                /**< MPLLA_ATB3, offset: 0x20068 */
  uint8_t RESERVED_91[2];
  __IO uint16_t SUP_DIG_ANA_MPLLA_OVRD_OUT;        /**< Override value for mplla signals going to ANA, offset: 0x2006C */
  uint8_t RESERVED_92[2];
  __IO uint16_t SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT;   /**< Override value for mplla pmix signals going to ANA, offset: 0x20070 */
  uint8_t RESERVED_93[6];
  __IO uint16_t RAWCMN_DIG_MPLLA_OVRD_IN;          /**< Override values for incoming MPLLA signals, offset: 0x20078 */
  uint8_t RESERVED_94[2];
  __IO uint16_t RAWCMN_DIG_MPLLA_BW_OVRD_IN;       /**< Override values for incoming MPLLA bandwidth, offset: 0x2007C */
  uint8_t RESERVED_95[2];
  __IO uint16_t RAWCMN_DIG_LANE_FSM_OP_XTND;       /**< Lane FSM OP XTND control register, offset: 0x20080 */
  uint8_t RESERVED_96[2];
  __IO uint16_t RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1; /**< Override values for incoming MPLLA SSC control settings, offset: 0x20084 */
  uint8_t RESERVED_97[130938];
  __IO uint16_t SUP_DIG_MPLLB_DIV_CLK_OVRD_IN;     /**< Override values for incoming MPLLB_DIV_CLK controls from ASIC, offset: 0x40000 */
  uint8_t RESERVED_98[2];
  __IO uint16_t SUP_DIG_MPLLB_OVRD_IN_0;           /**< Override values for incoming MPLLB controls from ASIC, offset: 0x40004 */
  uint8_t RESERVED_99[2];
  __IO uint16_t SUP_DIG_MPLLB_OVRD_IN_1;           /**< Override values for incoming MPLLB controls from ASIC, offset: 0x40008 */
  uint8_t RESERVED_100[2];
  __IO uint16_t SUP_DIG_MPLLB_OVRD_IN_2;           /**< Override values for incoming MPLLB controls from ASIC, offset: 0x4000C */
  uint8_t RESERVED_101[2];
  __IO uint16_t SUP_DIG_MPLLB_BANDWIDTH_OVRD_IN;   /**< Override values for incoming MPLLB bandwidth controls from ASIC, offset: 0x40010 */
  uint8_t RESERVED_102[2];
  __I  uint16_t SUP_DIG_MPLLB_ASIC_IN_0;           /**< Current values for incoming MPLLB controls from ASIC, offset: 0x40014 */
  uint8_t RESERVED_103[2];
  __I  uint16_t SUP_DIG_MPLLB_ASIC_IN_1;           /**< Current values for incoming MPLLB controls from ASIC, offset: 0x40018 */
  uint8_t RESERVED_104[2];
  __I  uint16_t SUP_DIG_MPLLB_ASIC_IN_2;           /**< Current values for incoming MPLLB controls from ASIC, offset: 0x4001C */
  uint8_t RESERVED_105[2];
  __I  uint16_t SUP_DIG_MPLLB_DIV_CLK_ASIC_IN;     /**< Current values for incoming MPLLB_DIV_CLK controls from ASIC, offset: 0x40020 */
  uint8_t RESERVED_106[2];
  __I  uint16_t SUP_DIG_MPLLB_BANDWIDTH_ASIC_IN;   /**< Current values for incoming MPLLB bandwidth controls from ASIC, offset: 0x40024 */
  uint8_t RESERVED_107[2];
  __IO uint16_t SUP_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL; /**< MPLL Calibration controls, offset: 0x40028 */
  uint8_t RESERVED_108[2];
  __IO uint16_t SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_OVRD; /**< MPLL override controls, offset: 0x4002C */
  uint8_t RESERVED_109[2];
  __I  uint16_t SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT;   /**< MPLL status register, offset: 0x40030 */
  uint8_t RESERVED_110[2];
  __IO uint16_t SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD; /**< Thresholds for MPLL CAL Update timer and MPLL VCO Stabilization timer, offset: 0x40034 */
  uint8_t RESERVED_111[2];
  __IO uint16_t SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD; /**< Thresholds for PCLK enable and MPLL VCO Clock Stabilization timer, offset: 0x40038 */
  uint8_t RESERVED_112[2];
  __IO uint16_t SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD; /**< Thresholds for PCLK disable and MPLL VCO POWER DOWN timer, offset: 0x4003C */
  uint8_t RESERVED_113[2];
  __IO uint16_t SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD; /**< Thresholds for MPLL feedback clock enable and MPLL feedback digital clock disable and MPLL ANA POWER UP timer, offset: 0x40040 */
  uint8_t RESERVED_114[2];
  __I  uint16_t SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL; /**< MPLL coarse_tune value register, offset: 0x40044 */
  uint8_t RESERVED_115[2];
  __I  uint16_t SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE; /**< Value for MPLL coarse_tune when skipping calibration, offset: 0x40048 */
  uint8_t RESERVED_116[2];
  __IO uint16_t SUP_DIG_MPLLB_SSC_SS_PHASE;        /**< Current MPLL phase selector value, offset: 0x4004C */
  uint8_t RESERVED_117[2];
  __IO uint16_t SUP_DIG_MPLLB_SSC_SS_FREQ_0;       /**< Frequency Control for Spread Spectrum #0, offset: 0x40050 */
  uint8_t RESERVED_118[2];
  __IO uint16_t SUP_DIG_MPLLB_SSC_SS_FREQ_1;       /**< Frequency Control for Spread Spectrum #1, offset: 0x40054 */
  uint8_t RESERVED_119[2];
  __IO uint16_t SUP_ANA_MPLLB_MISC;                /**< MPLLB_MISC, offset: 0x40058 */
  uint8_t RESERVED_120[2];
  __IO uint16_t SUP_ANA_MPLLB_OVRD;                /**< MPLLB_OVRD, offset: 0x4005C */
  uint8_t RESERVED_121[2];
  __IO uint16_t SUP_ANA_MPLLB_ATB1;                /**< MPLLB_ATB1, offset: 0x40060 */
  uint8_t RESERVED_122[2];
  __IO uint16_t SUP_ANA_MPLLB_ATB2;                /**< MPLLB_ATB2, offset: 0x40064 */
  uint8_t RESERVED_123[2];
  __IO uint16_t SUP_ANA_MPLLB_ATB3;                /**< MPLLB_ATB3, offset: 0x40068 */
  uint8_t RESERVED_124[2];
  __IO uint16_t SUP_DIG_ANA_MPLLB_OVRD_OUT;        /**< Override value for mpllb signals going to ANA, offset: 0x4006C */
  uint8_t RESERVED_125[2];
  __IO uint16_t SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT;   /**< Override value for mpllb pmix signals going to ANA, offset: 0x40070 */
  uint8_t RESERVED_126[2];
  __IO uint16_t RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0; /**< Override values for incoming MPLLA SSC control settings, offset: 0x40074 */
  uint8_t RESERVED_127[2];
  __IO uint16_t RAWCMN_DIG_MPLLB_OVRD_IN;          /**< Override values for incoming MPLLB signals, offset: 0x40078 */
  uint8_t RESERVED_128[2];
  __IO uint16_t RAWCMN_DIG_MPLLB_BW_OVRD_IN;       /**< Override values for incoming MPLLB bandwidth, offset: 0x4007C */
  uint8_t RESERVED_129[2];
  __IO uint16_t RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1; /**< Override values for incoming MPLLB SSC control settings, offset: 0x40080 */
  uint8_t RESERVED_130[130942];
  __IO uint16_t LANE0_DIG_ASIC_LANE_OVRD_IN;       /**< Override values for incoming LANE controls from ASIC, offset: 0x60000 */
  uint8_t RESERVED_131[2];
  __IO uint16_t LANE0_DIG_ASIC_TX_OVRD_IN_0;       /**< Override values for incoming TX controls from ASIC, register #0, offset: 0x60004 */
  uint8_t RESERVED_132[2];
  __IO uint16_t LANE0_DIG_ASIC_TX_OVRD_IN_1;       /**< Override values for incoming TX drive controls from ASIC, register #1, offset: 0x60008 */
  uint8_t RESERVED_133[2];
  __IO uint16_t LANE0_DIG_ASIC_TX_OVRD_IN_2;       /**< Override values for incoming TX drive controls from ASIC, register #2, offset: 0x6000C */
  uint8_t RESERVED_134[2];
  __IO uint16_t LANE0_DIG_ASIC_TX_OVRD_IN_3;       /**< Override values for incoming TX drive controls from ASIC, register #3, offset: 0x60010 */
  uint8_t RESERVED_135[2];
  __IO uint16_t LANE0_DIG_ASIC_TX_OVRD_IN_4;       /**< Override values for incoming TX drive controls from ASIC, register #4, offset: 0x60014 */
  uint8_t RESERVED_136[2];
  __IO uint16_t LANE0_DIG_ASIC_TX_OVRD_OUT;        /**< Override values for outgoing TX controls to ASIC, offset: 0x60018 */
  uint8_t RESERVED_137[2];
  __IO uint16_t LANE0_DIG_ASIC_RX_OVRD_IN_0;       /**< Override values for incoming RX controls from ASIC, register #0, offset: 0x6001C */
  uint8_t RESERVED_138[2];
  __IO uint16_t LANE0_DIG_ASIC_RX_OVRD_IN_1;       /**< Override values for incoming RX controls from ASIC, register #1, offset: 0x60020 */
  uint8_t RESERVED_139[2];
  __IO uint16_t LANE0_DIG_ASIC_RX_OVRD_IN_2;       /**< Override values for incoming RX controls from ASIC, register #2, offset: 0x60024 */
  uint8_t RESERVED_140[2];
  __IO uint16_t LANE0_DIG_ASIC_RX_OVRD_IN_3;       /**< Override values for incoming RX controls from ASIC, register #3, offset: 0x60028 */
  uint8_t RESERVED_141[2];
  __IO uint16_t LANE0_DIG_ASIC_RX_OVRD_IN_4;       /**< Override values for incoming RX controls from ASIC, register #4, offset: 0x6002C */
  uint8_t RESERVED_142[2];
  __IO uint16_t LANE0_DIG_ASIC_RX_OVRD_IN_5;       /**< Override values for incoming RX controls from ASIC, register #5, offset: 0x60030 */
  uint8_t RESERVED_143[2];
  __IO uint16_t LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0;    /**< Override values for incoming RX EQ controls from ASIC, register #0, offset: 0x60034 */
  uint8_t RESERVED_144[2];
  __IO uint16_t LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1;    /**< Override values for incoming RX EQ controls from ASIC, register #1, offset: 0x60038 */
  uint8_t RESERVED_145[2];
