zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
  __IO uint16_t LANE0_DIG_ASIC_RX_OVRD_OUT_0;      /**< Override values for outgoing RX controls to ASIC, register #0, offset: 0x6003C */
  uint8_t RESERVED_146[2];
  __I  uint16_t LANE0_DIG_ASIC_LANE_ASIC_IN;       /**< Current values for incoming LANE controls from ASIC, offset: 0x60040 */
  uint8_t RESERVED_147[2];
  __I  uint16_t LANE0_DIG_ASIC_TX_ASIC_IN_0;       /**< Current values for incoming TX controls from ASIC, register #0, offset: 0x60044 */
  uint8_t RESERVED_148[2];
  __I  uint16_t LANE0_DIG_ASIC_TX_ASIC_IN_1;       /**< Current values for incoming TX controls from ASIC, register #1, offset: 0x60048 */
  uint8_t RESERVED_149[2];
  __I  uint16_t LANE0_DIG_ASIC_TX_ASIC_IN_2;       /**< Current values for incoming TX controls from ASIC, register #2, offset: 0x6004C */
  uint8_t RESERVED_150[2];
  __I  uint16_t LANE0_DIG_ASIC_TX_ASIC_OUT;        /**< Current values for outgoing TX status controls from PHY, offset: 0x60050 */
  uint8_t RESERVED_151[2];
  __I  uint16_t LANE0_DIG_ASIC_RX_ASIC_IN_0;       /**< Current values for incoming RX controls from ASIC, register #0, offset: 0x60054 */
  uint8_t RESERVED_152[2];
  __I  uint16_t LANE0_DIG_ASIC_RX_ASIC_IN_1;       /**< Current values for incoming RX controls from ASIC, register #1, offset: 0x60058 */
  uint8_t RESERVED_153[2];
  __I  uint16_t LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0;    /**< Current values for incoming RX EQ controls from ASIC, register #0, offset: 0x6005C */
  uint8_t RESERVED_154[2];
  __I  uint16_t LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1;    /**< Current values for incoming RX EQ controls from ASIC, register #1, offset: 0x60060 */
  uint8_t RESERVED_155[2];
  __I  uint16_t LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0; /**< Current values for incoming RX CDR VCO controls from ASIC, register #0, offset: 0x60064 */
  uint8_t RESERVED_156[2];
  __I  uint16_t LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1; /**< Current values for incoming RX CDR VCO controls from ASIC, register #1, offset: 0x60068 */
  uint8_t RESERVED_157[2];
  __I  uint16_t LANE0_DIG_ASIC_RX_ASIC_OUT_0;      /**< Current values for outgoing RX status controls from PHY, register #0, offset: 0x6006C */
  uint8_t RESERVED_158[2];
  __IO uint16_t LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0;  /**< TX Power State Control Register for P0, offset: 0x60070 */
  uint8_t RESERVED_159[2];
  __IO uint16_t LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S; /**< TX Power State Control Register for P0S, offset: 0x60074 */
  uint8_t RESERVED_160[2];
  __IO uint16_t LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1;  /**< TX Power State Control Register for P1, offset: 0x60078 */
  uint8_t RESERVED_161[2];
  __IO uint16_t LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2;  /**< TX Power State Control Register for P2, offset: 0x6007C */
  uint8_t RESERVED_162[2];
  __IO uint16_t LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0; /**< TX Power UP Time Register #0, offset: 0x60080 */
  uint8_t RESERVED_163[2];
  __IO uint16_t LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1; /**< TX Power UP Time Register #1, offset: 0x60084 */
  uint8_t RESERVED_164[2];
  __IO uint16_t LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2; /**< TX Power UP Time Register #2, offset: 0x60088 */
  uint8_t RESERVED_165[2];
  __IO uint16_t LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3; /**< TX Power UP Time Register #3, offset: 0x6008C */
  uint8_t RESERVED_166[2];
  __IO uint16_t LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4; /**< TX Power UP Time Register #4, offset: 0x60090 */
  uint8_t RESERVED_167[2];
  __IO uint16_t LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5; /**< TX Power UP Time Register #5, offset: 0x60094 */
  uint8_t RESERVED_168[2];
  __IO uint16_t LANE0_DIG_TX_LBERT_CTL;            /**< Pattern Generator controls, offset: 0x60098 */
  uint8_t RESERVED_169[2];
  __IO uint16_t LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0;   /**< TX Clock Alignment Control Register #0, offset: 0x6009C */
  uint8_t RESERVED_170[2];
  __IO uint16_t LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0;  /**< RX Power State Control Register for P0, offset: 0x600A0 */
  uint8_t RESERVED_171[2];
  __IO uint16_t LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S; /**< RX Power State Control Register for P0S, offset: 0x600A4 */
  uint8_t RESERVED_172[2];
  __IO uint16_t LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1;  /**< RX Power State Control Register for P1, offset: 0x600A8 */
  uint8_t RESERVED_173[2];
  __IO uint16_t LANE0_DIG_RX_PWRCTL_RX_PSTATE_P2;  /**< RX Power State Control Register for P2, offset: 0x600AC */
  uint8_t RESERVED_174[2];
  __IO uint16_t LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0; /**< RX Power UP Time Register #0, offset: 0x600B0 */
  uint8_t RESERVED_175[2];
  __IO uint16_t LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1; /**< RX Power UP Time Register #1, offset: 0x600B4 */
  uint8_t RESERVED_176[2];
  __IO uint16_t LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2; /**< RX Power UP Time Register #2, offset: 0x600B8 */
  uint8_t RESERVED_177[2];
  __IO uint16_t LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3; /**< RX Power UP Time Register #3, offset: 0x600BC */
  uint8_t RESERVED_178[2];
  __IO uint16_t LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0; /**< RX VCO calibration controls register #0, offset: 0x600C0 */
  uint8_t RESERVED_179[2];
  __IO uint16_t LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1; /**< RX VCO calibration controls register #1, offset: 0x600C4 */
  uint8_t RESERVED_180[2];
  __IO uint16_t LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2; /**< RX VCO calibration controls register #2, offset: 0x600C8 */
  uint8_t RESERVED_181[2];
  __IO uint16_t LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0; /**< RX Power UP Time Register #0, offset: 0x600CC */
  uint8_t RESERVED_182[2];
  __IO uint16_t LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1; /**< RX Power UP Time Register #1, offset: 0x600D0 */
  uint8_t RESERVED_183[2];
  __I  uint16_t LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0; /**< RX VCO status register #0, offset: 0x600D4 */
  uint8_t RESERVED_184[2];
  __I  uint16_t LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1; /**< RX VCO status register #1, offset: 0x600D8 */
  uint8_t RESERVED_185[2];
  __I  uint16_t LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2; /**< RX VCO status register #2, offset: 0x600DC */
  uint8_t RESERVED_186[2];
  __IO uint16_t LANE0_DIG_RX_RX_ALIGN_XAUI_COMM_MASK; /**< XAUI_COMMA Mask, offset: 0x600E0 */
  uint8_t RESERVED_187[2];
  __IO uint16_t LANE0_DIG_RX_LBERT_CTL;            /**< Pattern Matcher controls, offset: 0x600E4 */
  uint8_t RESERVED_188[2];
  __IO uint16_t LANE0_DIG_RX_LBERT_ERR;            /**< Pattern match error counter, offset: 0x600E8 */
  uint8_t RESERVED_189[2];
  __IO uint16_t LANE0_DIG_RX_CDR_CDR_CTL_0;        /**< Control bits for receiver in recovered domain, offset: 0x600EC */
  uint8_t RESERVED_190[2];
  __IO uint16_t LANE0_DIG_RX_CDR_CDR_CTL_1;        /**< CDR Control Register #1, offset: 0x600F0 */
  uint8_t RESERVED_191[2];
  __IO uint16_t LANE0_DIG_RX_CDR_CDR_CTL_2;        /**< CDR Control Register #2, offset: 0x600F4 */
  uint8_t RESERVED_192[2];
  __IO uint16_t LANE0_DIG_RX_CDR_CDR_CTL_3;        /**< CDR Control Register #3, offset: 0x600F8 */
  uint8_t RESERVED_193[2];
  __IO uint16_t LANE0_DIG_RX_CDR_CDR_CTL_4;        /**< CDR Control Register #4, offset: 0x600FC */
  uint8_t RESERVED_194[2];
  __I  uint16_t LANE0_DIG_RX_CDR_STAT;             /**< Current output values to dpll (phug, frug), offset: 0x60100 */
  uint8_t RESERVED_195[2];
  __IO uint16_t LANE0_DIG_RX_DPLL_FREQ;            /**< Current frequency integrator value., offset: 0x60104 */
  uint8_t RESERVED_196[2];
  __IO uint16_t LANE0_DIG_RX_DPLL_FREQ_BOUND_0;    /**< Frequency Bounds for incoming data stream #0, offset: 0x60108 */
  uint8_t RESERVED_197[2];
  __IO uint16_t LANE0_DIG_RX_DPLL_FREQ_BOUND_1;    /**< Frequency Bounds for incoming data stream #1, offset: 0x6010C */
  uint8_t RESERVED_198[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0;   /**< Adaptation Configuration Register #0, offset: 0x60110 */
  uint8_t RESERVED_199[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1;   /**< Adaptation Configuration Register #1, offset: 0x60114 */
  uint8_t RESERVED_200[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_ADPT_CFG_2;   /**< Adaptation Configuration Register #2, offset: 0x60118 */
  uint8_t RESERVED_201[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_ADPT_CFG_3;   /**< Adaptation Configuration Register #3, offset: 0x6011C */
  uint8_t RESERVED_202[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_ADPT_CFG_4;   /**< Adaptation Configuration Register #4, offset: 0x60120 */
  uint8_t RESERVED_203[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_ADPT_CFG_5;   /**< Adaptation Configuration Register #5, offset: 0x60124 */
  uint8_t RESERVED_204[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_ADPT_CFG_6;   /**< Adaptation Configuration Register #6, offset: 0x60128 */
  uint8_t RESERVED_205[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_ADPT_CFG_7;   /**< Adaptation Configuration Register #7, offset: 0x6012C */
  uint8_t RESERVED_206[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_ADPT_CFG_8;   /**< Adaptation Configuration Register #8, offset: 0x60130 */
  uint8_t RESERVED_207[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_ADPT_CFG_9;   /**< Adaptation Configuration Register #9, offset: 0x60134 */
  uint8_t RESERVED_208[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_RST_ADPT_CFG; /**< Reset Adaptation Configuration Register, offset: 0x60138 */
  uint8_t RESERVED_209[2];
  __I  uint16_t LANE0_DIG_RX_ADPTCTL_ATT_STATUS;   /**< Value of ATT Adaptation code, offset: 0x6013C */
  uint8_t RESERVED_210[2];
  __I  uint16_t LANE0_DIG_RX_ADPTCTL_VGA_STATUS;   /**< Value of VGA Adaptation code, offset: 0x60140 */
  uint8_t RESERVED_211[2];
  __I  uint16_t LANE0_DIG_RX_ADPTCTL_CTLE_STATUS;  /**< Value of CTLE Adaptation code, offset: 0x60144 */
  uint8_t RESERVED_212[2];
  __I  uint16_t LANE0_DIG_RX_ADPTCTL_DFE_TAP1_STATUS; /**< Value of DFE Tap1 Adaptation code, offset: 0x60148 */
  uint8_t RESERVED_213[2];
  __I  uint16_t LANE0_DIG_RX_ADPTCTL_DFE_TAP2_STATUS; /**< Value of DFE Tap2 Adaptation code, offset: 0x6014C */
  uint8_t RESERVED_214[2];
  __I  uint16_t LANE0_DIG_RX_ADPTCTL_DFE_TAP3_STATUS; /**< Value of DFE Tap3 Adaptation code, offset: 0x60150 */
  uint8_t RESERVED_215[2];
  __I  uint16_t LANE0_DIG_RX_ADPTCTL_DFE_TAP4_STATUS; /**< Value of DFE Tap4 Adaptation code, offset: 0x60154 */
  uint8_t RESERVED_216[2];
  __I  uint16_t LANE0_DIG_RX_ADPTCTL_DFE_TAP5_STATUS; /**< Value of DFE Tap5 Adaptation code, offset: 0x60158 */
  uint8_t RESERVED_217[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST; /**< Offset values for RX DFE Data Even vDAC, offset: 0x6015C */
  uint8_t RESERVED_218[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST; /**< Offset values for RX DFE Data Odd vDAC, offset: 0x60160 */
  uint8_t RESERVED_219[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN; /**< Sets values for RX SLICER CTRL EVEN signals going to ANA, offset: 0x60164 */
  uint8_t RESERVED_220[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD; /**< Sets values for RX SLICER CTRL ODD signals going to ANA, offset: 0x60168 */
  uint8_t RESERVED_221[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST; /**< Offset values for RX DFE Error Even vDAC, offset: 0x6016C */
  uint8_t RESERVED_222[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST; /**< Offset values for RX DFE Error Odd vDAC, offset: 0x60170 */
  uint8_t RESERVED_223[2];
  __I  uint16_t LANE0_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL; /**< Value of Error Slicer Level, offset: 0x60174 */
  uint8_t RESERVED_224[2];
  __IO uint16_t LANE0_DIG_RX_ADPTCTL_ADPT_RESET;   /**< Adaptation reset register, offset: 0x60178 */
  uint8_t RESERVED_225[2];
  __IO uint16_t LANE0_DIG_RX_STAT_LD_VAL_1;        /**< Stat load value for the sample counter #1, offset: 0x6017C */
  uint8_t RESERVED_226[2];
  __IO uint16_t LANE0_DIG_RX_STAT_DATA_MSK;        /**< Stat data mask bits [15:0], offset: 0x60180 */
  uint8_t RESERVED_227[2];
  __IO uint16_t LANE0_DIG_RX_STAT_MATCH_CTL0;      /**< Stat match controls register #0, offset: 0x60184 */
  uint8_t RESERVED_228[2];
  __IO uint16_t LANE0_DIG_RX_STAT_MATCH_CTL1;      /**< Stat match controls register #1, offset: 0x60188 */
  uint8_t RESERVED_229[2];
  __IO uint16_t LANE0_DIG_RX_STAT_STAT_CTL0;       /**< Stat controls register #0, offset: 0x6018C */
  uint8_t RESERVED_230[2];
  __IO uint16_t LANE0_DIG_RX_STAT_STAT_CTL1;       /**< Stat controls register #1, offset: 0x60190 */
  uint8_t RESERVED_231[2];
  __I  uint16_t LANE0_DIG_RX_STAT_SMPL_CNT1;       /**< Sample Counter #1 Status, offset: 0x60194 */
  uint8_t RESERVED_232[2];
  __I  uint16_t LANE0_DIG_RX_STAT_STAT_CNT_0;      /**< Stat Counter 0 Status, offset: 0x60198 */
  uint8_t RESERVED_233[2];
  __I  uint16_t LANE0_DIG_RX_STAT_STAT_CNT_1;      /**< Stat Counter 1 Status, offset: 0x6019C */
  uint8_t RESERVED_234[2];
  __I  uint16_t LANE0_DIG_RX_STAT_STAT_CNT_2;      /**< Stat Counter 2 Status, offset: 0x601A0 */
  uint8_t RESERVED_235[2];
  __I  uint16_t LANE0_DIG_RX_STAT_STAT_CNT_3;      /**< Stat Counter 3 Status, offset: 0x601A4 */
  uint8_t RESERVED_236[2];
  __I  uint16_t LANE0_DIG_RX_STAT_STAT_CNT_4;      /**< Stat Counter 4 Status, offset: 0x601A8 */
  uint8_t RESERVED_237[2];
  __I  uint16_t LANE0_DIG_RX_STAT_STAT_CNT_5;      /**< Stat Counter 5 Status, offset: 0x601AC */
  uint8_t RESERVED_238[2];
  __I  uint16_t LANE0_DIG_RX_STAT_STAT_CNT_6;      /**< Stat Counter 6 Status, offset: 0x601B0 */
  uint8_t RESERVED_239[2];
  __IO uint16_t LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL; /**< Calibration Comparator Control, offset: 0x601B4 */
  uint8_t RESERVED_240[2];
  __IO uint16_t LANE0_DIG_RX_STAT_MATCH_CTL2;      /**< Stat match controls register #2, offset: 0x601B8 */
  uint8_t RESERVED_241[2];
  __IO uint16_t LANE0_DIG_RX_STAT_MATCH_CTL3;      /**< Stat match controls register #3, offset: 0x601BC */
  uint8_t RESERVED_242[2];
  __IO uint16_t LANE0_DIG_RX_STAT_MATCH_CTL4;      /**< Stat match controls register #4, offset: 0x601C0 */
  uint8_t RESERVED_243[2];
  __IO uint16_t LANE0_DIG_RX_STAT_MATCH_CTL5;      /**< Stat match controls register #5, offset: 0x601C4 */
  uint8_t RESERVED_244[2];
  __IO uint16_t LANE0_DIG_RX_STAT_STAT_CTL2;       /**< Stat controls register #2, offset: 0x601C8 */
  uint8_t RESERVED_245[2];
  __IO uint16_t LANE0_DIG_RX_STAT_STAT_STOP;       /**< Stat stop register, offset: 0x601CC */
  uint8_t RESERVED_246[2];
  __IO uint16_t LANE0_DIG_ANA_TX_OVRD_OUT;         /**< Override values for TX signals going to ANA, offset: 0x601D0 */
  uint8_t RESERVED_247[2];
  __IO uint16_t LANE0_DIG_ANA_TX_TERM_CODE_OVRD_OUT; /**< Override value for TX termination code going to ANA, offset: 0x601D4 */
  uint8_t RESERVED_248[2];
  __IO uint16_t LANE0_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT; /**< Override value for TX termination code clocks going to ANA, offset: 0x601D8 */
  uint8_t RESERVED_249[2];
  __IO uint16_t LANE0_DIG_ANA_TX_EQ_OVRD_OUT_0;    /**< Override values for TX EQ signals going to ANA register #0, offset: 0x601DC */
  uint8_t RESERVED_250[2];
  __IO uint16_t LANE0_DIG_ANA_TX_EQ_OVRD_OUT_1;    /**< Override values for TX EQ signals going to ANA register #1, offset: 0x601E0 */
  uint8_t RESERVED_251[2];
  __IO uint16_t LANE0_DIG_ANA_TX_EQ_OVRD_OUT_2;    /**< Override values for TX EQ signals going to ANA register #2, offset: 0x601E4 */
  uint8_t RESERVED_252[2];
  __IO uint16_t LANE0_DIG_ANA_TX_EQ_OVRD_OUT_3;    /**< Override values for TX EQ signals going to ANA register #3, offset: 0x601E8 */
  uint8_t RESERVED_253[2];
  __IO uint16_t LANE0_DIG_ANA_RX_CTL_OVRD_OUT;     /**< Override values for RX control signals going to ANA, offset: 0x601EC */
  uint8_t RESERVED_254[2];
  __IO uint16_t LANE0_DIG_ANA_RX_PWR_OVRD_OUT;     /**< Override values for RX PWR UP/DN signals going to ANA, offset: 0x601F0 */
  uint8_t RESERVED_255[2];
  __IO uint16_t LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0;   /**< Override values for RX VCO signals going to ANA #0, offset: 0x601F4 */
  uint8_t RESERVED_256[2];
  __IO uint16_t LANE0_DIG_ANA_RX_VCO_OVRD_OUT_1;   /**< Override values for RX VCO signals going to ANA #1, offset: 0x601F8 */
  uint8_t RESERVED_257[2];
  __IO uint16_t LANE0_DIG_ANA_RX_VCO_OVRD_OUT_2;   /**< Override values for RX VCO signals going to ANA #2, offset: 0x601FC */
  uint8_t RESERVED_258[2];
  __IO uint16_t LANE0_DIG_ANA_RX_CAL;              /**< Sets values for RX CAL signals going to ANA register, offset: 0x60200 */
  uint8_t RESERVED_259[2];
  __IO uint16_t LANE0_DIG_ANA_RX_DAC_CTRL;         /**< Sets values for RX DAC CTRL value going to ANA, offset: 0x60204 */
  uint8_t RESERVED_260[2];
  __IO uint16_t LANE0_DIG_ANA_RX_DAC_CTRL_OVRD;    /**< Overrides RX DAC CTRL bus (en/val/sel) going to ANA, offset: 0x60208 */
  uint8_t RESERVED_261[2];
  __IO uint16_t LANE0_DIG_ANA_RX_DAC_CTRL_SEL;     /**< Sets values for RX DAC CTRL Select signal going to ANA, offset: 0x6020C */
  uint8_t RESERVED_262[2];
  __IO uint16_t LANE0_DIG_ANA_RX_AFE_ATT_VGA;      /**< Value for RX AFE ATT & VGA signals going to ANA, offset: 0x60210 */
  uint8_t RESERVED_263[2];
  __IO uint16_t LANE0_DIG_ANA_RX_AFE_CTLE;         /**< Values for RX AFE CTLE signals going to ANA, offset: 0x60214 */
  uint8_t RESERVED_264[2];
  __IO uint16_t LANE0_DIG_ANA_RX_SCOPE;            /**< Values for RX SCOPE signals going to ANA, offset: 0x60218 */
  uint8_t RESERVED_265[2];
  __IO uint16_t LANE0_DIG_ANA_RX_SLICER_CTRL;      /**< Sets values for RX Slicer Ctrl signals going to ANA register, offset: 0x6021C */
  uint8_t RESERVED_266[2];
  __IO uint16_t LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST; /**< Sets values for RX ANA IQ PHASE Adjust signal going to ANA register, offset: 0x60220 */
  uint8_t RESERVED_267[2];
  __IO uint16_t LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN;  /**< Sets values for RX ANA IQ SENSE signal, offset: 0x60224 */
  uint8_t RESERVED_268[2];
  __IO uint16_t LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN; /**< DAC CTRL enable signal, offset: 0x60228 */
  uint8_t RESERVED_269[2];
  __IO uint16_t LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE; /**< Afe update enable signal, offset: 0x6022C */
  uint8_t RESERVED_270[2];
  __IO uint16_t LANE0_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK; /**< Phase adjust clock signal, offset: 0x60230 */
  uint8_t RESERVED_271[2];
  __I  uint16_t LANE0_DIG_ANA_STATUS_0;            /**< Lane input status register #0, offset: 0x60234 */
  uint8_t RESERVED_272[2];
  __I  uint16_t LANE0_DIG_ANA_STATUS_1;            /**< Lane input status register #1, offset: 0x60238 */
  uint8_t RESERVED_273[2];
  __IO uint16_t LANE0_DIG_ANA_RX_TERM_CODE_OVRD_OUT; /**< Override value for RX termination code going to ANA, offset: 0x6023C */
  uint8_t RESERVED_274[2];
  __IO uint16_t LANE0_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT; /**< Override value for RX termination code clock going to ANA, offset: 0x60240 */
  uint8_t RESERVED_275[2];
  __IO uint16_t LANE0_ANA_TX_OVRD_MEAS;            /**< TX_OVRD_MEAS, offset: 0x60244 */
  uint8_t RESERVED_276[2];
  __IO uint16_t LANE0_ANA_TX_PWR_OVRD;             /**< TX_PWR_OVRD, offset: 0x60248 */
  uint8_t RESERVED_277[2];
  __IO uint16_t LANE0_ANA_TX_ALT_BUS;              /**< TX_ALT_BUS, offset: 0x6024C */
  uint8_t RESERVED_278[2];
  __IO uint16_t LANE0_ANA_TX_ATB1;                 /**< TX_ATB1, offset: 0x60250 */
  uint8_t RESERVED_279[2];
  __IO uint16_t LANE0_ANA_TX_ATB2;                 /**< TX_ATB2, offset: 0x60254 */
  uint8_t RESERVED_280[2];
  __IO uint16_t LANE0_ANA_TX_VBOOST;               /**< TX_VBOOST, offset: 0x60258 */
  uint8_t RESERVED_281[2];
  __IO uint16_t LANE0_ANA_TX_TERM_CODE;            /**< TX_TERM_CODE, offset: 0x6025C */
  uint8_t RESERVED_282[2];
  __IO uint16_t LANE0_ANA_TX_TERM_CODE_CTRL;       /**< TX_TERM_CODE_CTRL, offset: 0x60260 */
  uint8_t RESERVED_283[2];
  __IO uint16_t LANE0_ANA_TX_IBOOST_CODE;          /**< TX_IBOOST_CODE, offset: 0x60264 */
  uint8_t RESERVED_284[2];
  __IO uint16_t LANE0_ANA_TX_OVRD_CLK;             /**< TX_OVRD_CLK, offset: 0x60268 */
  uint8_t RESERVED_285[2];
  __IO uint16_t LANE0_ANA_TX_MISC;                 /**< TX_MISC, offset: 0x6026C */
  uint8_t RESERVED_286[2];
  __IO uint16_t LANE0_ANA_RX_ATB_IQSKEW;           /**< RX_ATB_IQSKEW, offset: 0x60270 */
  uint8_t RESERVED_287[2];
  __IO uint16_t LANE0_ANA_RX_DCC_OVRD;             /**< RX_DCC_OVRD, offset: 0x60274 */
  uint8_t RESERVED_288[2];
  __IO uint16_t LANE0_ANA_RX_PWR_CTRL1;            /**< RX_PWR_CTRL1, offset: 0x60278 */
  uint8_t RESERVED_289[2];
  __IO uint16_t LANE0_ANA_RX_ATB_REGREF;           /**< RX_ATB_REGREF, offset: 0x6027C */
  uint8_t RESERVED_290[2];
  __IO uint16_t LANE0_ANA_RX_CDR_AFE;              /**< RX_CDR_AFE, offset: 0x60280 */
  uint8_t RESERVED_291[2];
  __IO uint16_t LANE0_ANA_RX_PWR_CTRL2;            /**< RX_PWR_CTRL2, offset: 0x60284 */
  uint8_t RESERVED_292[2];
  __IO uint16_t LANE0_ANA_RX_MISC_OVRD;            /**< RX_MISC_OVRD, offset: 0x60288 */
  uint8_t RESERVED_293[2];
  __IO uint16_t LANE0_ANA_RX_CAL_MUXA;             /**< RX_CAL_MUXA, offset: 0x6028C */
  uint8_t RESERVED_294[2];
  __IO uint16_t LANE0_ANA_RX_ATB_MEAS1;            /**< RX_ATB_MEAS1, offset: 0x60290 */
  uint8_t RESERVED_295[2];
  __IO uint16_t LANE0_ANA_RX_ATB_MEAS2;            /**< RX_ATB_MEAS2, offset: 0x60294 */
  uint8_t RESERVED_296[2];
  __IO uint16_t LANE0_ANA_RX_CAL_MUXB;             /**< RX_CAL_MUXB, offset: 0x60298 */
  uint8_t RESERVED_297[2];
  __IO uint16_t LANE0_ANA_RX_TERM;                 /**< RX_TERM, offset: 0x6029C */
  uint8_t RESERVED_298[2];
  __IO uint16_t LANE0_ANA_RX_SLC_CTRL;             /**< RX_SLC_CTRL, offset: 0x602A0 */
  uint8_t RESERVED_299[2];
  __IO uint16_t LANE0_ANA_RX_ATB_VREG;             /**< RX_ATB_VREG, offset: 0x602A4 */
  uint8_t RESERVED_300[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_TX_OVRD_IN;    /**< Override values for incoming TX controls from PCS, offset: 0x602A8 */
  uint8_t RESERVED_301[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_TX_OVRD_IN_1;  /**< Override values for incoming TX controls from PCS, register #1, offset: 0x602AC */
  uint8_t RESERVED_302[2];
  __I  uint16_t RAWLANE0_DIG_PCS_XF_TX_PCS_IN;     /**< Current values for incoming TX controls from PCS, offset: 0x602B0 */
  uint8_t RESERVED_303[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_TX_OVRD_OUT;   /**< Override values for outgoing TX controls to PCS, offset: 0x602B4 */
  uint8_t RESERVED_304[2];
  __I  uint16_t RAWLANE0_DIG_PCS_XF_TX_PCS_OUT;    /**< Current values for outgoing TX status controls from Raw PCS, offset: 0x602B8 */
  uint8_t RESERVED_305[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_OVRD_IN;    /**< Override values for incoming RX controls from PCS, offset: 0x602BC */
  uint8_t RESERVED_306[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1;  /**< Override values for incoming RX controls from PCS, register #1, offset: 0x602C0 */
  uint8_t RESERVED_307[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2;  /**< Override values for incoming RX controls from PCS, register #2, offset: 0x602C4 */
  uint8_t RESERVED_308[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3;  /**< Override values for incoming RX controls from PCS, register #3, offset: 0x602C8 */
  uint8_t RESERVED_309[2];
  __I  uint16_t RAWLANE0_DIG_PCS_XF_RX_PCS_IN;     /**< Current values for incoming RX controls from PCS, offset: 0x602CC */
  uint8_t RESERVED_310[2];
  __I  uint16_t RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1;   /**< Current values for incoming RX controls from PCS, register #1, offset: 0x602D0 */
  uint8_t RESERVED_311[2];
  __I  uint16_t RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2;   /**< Current values for incoming RX controls from PCS, register #2, offset: 0x602D4 */
  uint8_t RESERVED_312[2];
  __I  uint16_t RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3;   /**< Current values for incoming RX controls from PCS, register #3, offset: 0x602D8 */
  uint8_t RESERVED_313[2];
  __I  uint16_t RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4;   /**< Current values for incoming RX controls from PCS, register #4, offset: 0x602DC */
  uint8_t RESERVED_314[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT;   /**< Override values for outgoing RX controls to PCS, offset: 0x602E0 */
  uint8_t RESERVED_315[2];
