zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
  __I  uint16_t RAWLANE0_DIG_PCS_XF_RX_PCS_OUT;    /**< Current values for outgoing RX status controls from Raw PCS, offset: 0x602E4 */
  uint8_t RESERVED_316[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK;  /**< RX Adaptation Acknowledge, offset: 0x602E8 */
  uint8_t RESERVED_317[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM;  /**< RX Adaptation Figure of Merit, offset: 0x602EC */
  uint8_t RESERVED_318[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR;  /**< RX calculated direction for TX-pre, offset: 0x602F0 */
  uint8_t RESERVED_319[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR; /**< RX calculated direction for TX-Main, offset: 0x602F4 */
  uint8_t RESERVED_320[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR; /**< RX calculated direction for TX-Post, offset: 0x602F8 */
  uint8_t RESERVED_321[2];
  __I  uint16_t RAWLANE0_DIG_PCS_XF_LANE_NUMBER;   /**< Current lane number, offset: 0x602FC */
  uint8_t RESERVED_322[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN; /**< Override incoming values for lane_xcvr_mode, offset: 0x60300 */
  uint8_t RESERVED_323[2];
  __I  uint16_t RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN; /**< Lane transceiver mode status, offset: 0x60304 */
  uint8_t RESERVED_324[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN;   /**< ATE Override input to control top-level inputs, offset: 0x60308 */
  uint8_t RESERVED_325[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN; /**< Override incoming values for rx_eq_delta_iq, offset: 0x6030C */
  uint8_t RESERVED_326[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN; /**< Override incoming values for tx/rx_term_ctrl, offset: 0x60310 */
  uint8_t RESERVED_327[2];
  __I  uint16_t RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN; /**< tx/rx_term_ctrl status, offset: 0x60314 */
  uint8_t RESERVED_328[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1; /**< Override values for outgoing RX controls to PCS, register #1, offset: 0x60318 */
  uint8_t RESERVED_329[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1; /**< Override values for incoming RX EQ controls from PCS, register #1, offset: 0x6031C */
  uint8_t RESERVED_330[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2; /**< Override values for incoming RX EQ controls from PCS, register #2, offset: 0x60320 */
  uint8_t RESERVED_331[2];
  __IO uint16_t RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2; /**< Override value for RX VALID/DATA_EN/DATA_EN/LANE_TX2RX_SER_LB_EN/LANE_RX2TX_PAR_LB_EN signal from PCS, offset: 0x60324 */
  uint8_t RESERVED_332[2];
  __IO uint16_t RAWLANE0_DIG_FSM_FSM_OVRD_CTL;     /**< FSM override control register, offset: 0x60328 */
  uint8_t RESERVED_333[2];
  __I  uint16_t RAWLANE0_DIG_FSM_MEM_ADDR_MON;     /**< Memory Address Monitor, offset: 0x6032C */
  uint8_t RESERVED_334[2];
  __I  uint16_t RAWLANE0_DIG_FSM_STATUS_MON;       /**< FSM Status Monitor, offset: 0x60330 */
  uint8_t RESERVED_335[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL; /**< Status of Fast RX Start Up Calibration, offset: 0x60334 */
  uint8_t RESERVED_336[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_ADAPT;    /**< Status of Fast RX Adaptation, offset: 0x60338 */
  uint8_t RESERVED_337[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL;  /**< Status of Fast RX AFE Calibration, offset: 0x6033C */
  uint8_t RESERVED_338[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL;  /**< Status of Fast RX DFE Calibration, offset: 0x60340 */
  uint8_t RESERVED_339[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT; /**< Enables fast RX DFE re -adaptation, offset: 0x60344 */
  uint8_t RESERVED_340[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL; /**< Status of Fast RX Reference Level Calibration, offset: 0x60348 */
  uint8_t RESERVED_341[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL;   /**< Status of Fast RX IQ Calibration, offset: 0x6034C */
  uint8_t RESERVED_342[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT; /**< Status of Fast RX AFE Adaptation, offset: 0x60350 */
  uint8_t RESERVED_343[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT; /**< Status of Fast RX DFE Adaptation, offset: 0x60354 */
  uint8_t RESERVED_344[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_SUP;         /**< Status of Fast Support block, offset: 0x60358 */
  uint8_t RESERVED_345[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE; /**< Status of Fast TX Common-mode Charge-up, offset: 0x6035C */
  uint8_t RESERVED_346[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_TX_RXDET;    /**< Status of Fast TX detect RX, offset: 0x60360 */
  uint8_t RESERVED_347[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_PWRUP;    /**< Status of Fast RX Power-up, offset: 0x60364 */
  uint8_t RESERVED_348[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT; /**< Status of Fast RX VCO Wait Times, offset: 0x60368 */
  uint8_t RESERVED_349[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL;  /**< Status of Fast RX VCO Calibration, offset: 0x6036C */
  uint8_t RESERVED_350[2];
  __I  uint16_t RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS; /**< Status of MPLL common calibration initiation, offset: 0x60370 */
  uint8_t RESERVED_351[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT; /**< Status of Fast RX Continuous Calibration/Adaptation, offset: 0x60374 */
  uint8_t RESERVED_352[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT; /**< Status of Fast RX Continuous Adaptation, offset: 0x60378 */
  uint8_t RESERVED_353[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL; /**< Status of Fast RX Continuous Data Calibration, offset: 0x6037C */
  uint8_t RESERVED_354[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL; /**< Status of Fast RX Continuous Phase Calibration, offset: 0x60380 */
  uint8_t RESERVED_355[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_CONT_AFE_CAL; /**< Status of Fast RX Continuous AFE Calibration, offset: 0x60384 */
  uint8_t RESERVED_356[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_IQ_ADAPT; /**< Status of Fast RX IQ_ADAPT, offset: 0x60388 */
  uint8_t RESERVED_357[2];
  __I  uint16_t RAWLANE0_DIG_FSM_RX_IQ_DELTA_ADD;  /**< Status of RX Delta addition, offset: 0x6038C */
  uint8_t RESERVED_358[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_ATT_ADAPT; /**< Enables fast RX ATT adaptation, offset: 0x60390 */
  uint8_t RESERVED_359[2];
  __I  uint16_t RAWLANE0_DIG_FSM_FAST_RX_CTLE_ADAPT; /**< Enables fast RX CTLE adaptation, offset: 0x60394 */
  uint8_t RESERVED_360[2];
  __IO uint16_t RAWLANE0_DIG_FSM_CR_REG_OP_XTND_EN; /**< CR interface timing extension enable, offset: 0x60398 */
  uint8_t RESERVED_361[2];
  __IO uint16_t RAWLANE0_DIG_FSM_TX_EQ_UPDATE_FLAG; /**< TX Eq update flag, offset: 0x6039C */
  uint8_t RESERVED_362[2];
  __I  uint16_t RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS; /**< Status of RTUNE common calibration initiation, offset: 0x603A0 */
  uint8_t RESERVED_363[2];
  __I  uint16_t RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET; /**< Offset value for IQ Phase Calculation, offset: 0x603A4 */
  uint8_t RESERVED_364[2];
  __IO uint16_t RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST; /**< Offset value for RX AFE ATT iDAC, offset: 0x603A8 */
  uint8_t RESERVED_365[2];
  __IO uint16_t RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST; /**< Offset value for RX AFE CTLE iDAC, offset: 0x603AC */
  uint8_t RESERVED_366[2];
  __IO uint16_t RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE; /**< Reference level for RX AFE Adaptation, offset: 0x603B0 */
  uint8_t RESERVED_367[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_ADAPT_FOM;     /**< Adaptation Figure of Merit (FOM), offset: 0x603B4 */
  uint8_t RESERVED_368[2];
  __IO uint16_t RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST; /**< Offset values for RX CTLE Loopback path iDAC, offset: 0x603B8 */
  uint8_t RESERVED_369[2];
  __IO uint16_t RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST; /**< Offset values for RX DFE Phase Even vDAC, offset: 0x603BC */
  uint8_t RESERVED_370[2];
  __IO uint16_t RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST; /**< Offset values for RX DFE Phase Odd vDAC, offset: 0x603C0 */
  uint8_t RESERVED_371[2];
  __IO uint16_t RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL; /**< DFE Even reference level, offset: 0x603C4 */
  uint8_t RESERVED_372[2];
  __IO uint16_t RAWLANE0_DIG_AON_DFE_ODD_REF_LVL;  /**< DFE Odd reference level, offset: 0x603C8 */
  uint8_t RESERVED_373[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_PHSADJ_LIN;    /**< RX Phase Adjust Linear Value, offset: 0x603CC */
  uint8_t RESERVED_374[2];
  __I  uint16_t RAWLANE0_DIG_AON_RX_PHSADJ_MAP;    /**< RX Phase Adjust Mapped Value, offset: 0x603D0 */
  uint8_t RESERVED_375[2];
  __IO uint16_t RAWLANE0_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST; /**< Offset values for RX DFE Data Even High vDAC, offset: 0x603D4 */
  uint8_t RESERVED_376[2];
  __IO uint16_t RAWLANE0_DIG_AON_CUSTOM_TX_IBOOST_LVL; /**< Custom tx_iboost_lvl values for lfps and ss modes, offset: 0x603D8 */
  uint8_t RESERVED_377[2];
  __IO uint16_t RAWLANE0_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST; /**< Offset values for RX DFE Data Odd High vDAC, offset: 0x603DC */
  uint8_t RESERVED_378[2];
  __IO uint16_t RAWLANE0_DIG_AON_DFE_DATA_ODD_LOW_VDAC_OFST; /**< Offset values for RX DFE Data Odd Low vDAC, offset: 0x603E0 */
  uint8_t RESERVED_379[2];
  __IO uint16_t RAWLANE0_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST; /**< Offset values for RX DFE By-Pass Even vDAC, offset: 0x603E4 */
  uint8_t RESERVED_380[2];
  __IO uint16_t RAWLANE0_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST; /**< Offset values for RX DFE By-Pass Odd vDAC, offset: 0x603E8 */
  uint8_t RESERVED_381[2];
  __IO uint16_t RAWLANE0_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST; /**< Offset values for RX DFE Error Even vDAC, offset: 0x603EC */
  uint8_t RESERVED_382[2];
  __IO uint16_t RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST; /**< Offset values for RX DFE Error Odd vDAC, offset: 0x603F0 */
  uint8_t RESERVED_383[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST; /**< Value for RX IQ PHASE Adjust, offset: 0x603F4 */
  uint8_t RESERVED_384[2];
  __IO uint16_t RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE; /**< MPLLA_COARSE_TUNE, offset: 0x603F8 */
  uint8_t RESERVED_385[2];
  __IO uint16_t RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE; /**< MPLLB_COARSE_TUNE, offset: 0x603FC */
  uint8_t RESERVED_386[2];
  __IO uint16_t RAWLANE0_DIG_AON_INIT_PWRUP_DONE;  /**< Initial Power-Up Done Status, offset: 0x60400 */
  uint8_t RESERVED_387[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_ADPT_ATT;      /**< RX Adapted value of ATT, offset: 0x60404 */
  uint8_t RESERVED_388[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_ADPT_VGA;      /**< RX Adapted value of VGA, offset: 0x60408 */
  uint8_t RESERVED_389[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_ADPT_CTLE;     /**< RX Adapted value of CTLE, offset: 0x6040C */
  uint8_t RESERVED_390[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP1; /**< RX Adapted value of DFE TAP1, offset: 0x60410 */
  uint8_t RESERVED_391[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_ADAPT_DONE;    /**< RX Adaptation Done Status, offset: 0x60414 */
  uint8_t RESERVED_392[2];
  __IO uint16_t RAWLANE0_DIG_AON_FAST_FLAGS;       /**< Fast flags for simulation only, offset: 0x60418 */
  uint8_t RESERVED_393[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2; /**< RX Adapted value of DFE TAP2, offset: 0x6041C */
  uint8_t RESERVED_394[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT; /**< RX last stable iq phase of Right of the eye, offset: 0x60420 */
  uint8_t RESERVED_395[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT; /**< RX last stable iq phase of Left of the eye, offset: 0x60424 */
  uint8_t RESERVED_396[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT; /**< RX Adapted value of PHASE IQ, offset: 0x60428 */
  uint8_t RESERVED_397[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN; /**< Sets values for RX SLICER CTRL EVEN signals going to ANA, offset: 0x6042C */
  uint8_t RESERVED_398[2];
  __IO uint16_t RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD; /**< Sets values for RX SLICER CTRL ODD signals going to ANA, offset: 0x60430 */
  uint8_t RESERVED_399[2];
  __IO uint16_t RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS; /**< MPLL Common Calibration Status, offset: 0x60434 */
  uint8_t RESERVED_400[2];
  __IO uint16_t RAWLANE0_DIG_AON_ADPT_CTL_0;       /**< Adaptation Control register #0, offset: 0x60438 */
  uint8_t RESERVED_401[2];
  __IO uint16_t RAWLANE0_DIG_AON_ADPT_CTL_1;       /**< Adaptation Control register #1, offset: 0x6043C */
  uint8_t RESERVED_402[2];
  __IO uint16_t RAWLANE0_DIG_AON_ADPT_CTL_2;       /**< Adaptation Control register #2, offset: 0x60440 */
  uint8_t RESERVED_403[2];
  __IO uint16_t RAWLANE0_DIG_AON_ADPT_CTL_3;       /**< Adaptation Control register #3, offset: 0x60444 */
  uint8_t RESERVED_404[2];
  __IO uint16_t RAWLANE0_DIG_AON_ADPT_CTL_4;       /**< Adaptation Control register #4, offset: 0x60448 */
  uint8_t RESERVED_405[2];
  __IO uint16_t RAWLANE0_DIG_AON_ADPT_CTL_5;       /**< Adaptation Control register #5, offset: 0x6044C */
  uint8_t RESERVED_406[2];
  __IO uint16_t RAWLANE0_DIG_AON_ADPT_CTL_6;       /**< Adaptation Control register #6, offset: 0x60450 */
  uint8_t RESERVED_407[2];
  __IO uint16_t RAWLANE0_DIG_AON_ADPT_CTL_7;       /**< Adaptation Control register #7, offset: 0x60454 */
  uint8_t RESERVED_408[2];
  __IO uint16_t RAWLANE0_DIG_AON_MPLL_DISABLE;     /**< LANE_MPLLA/B_DISABLE override, offset: 0x60458 */
  uint8_t RESERVED_409[2];
  __IO uint16_t RAWLANE0_DIG_AON_FAST_FLAGS_2;     /**< Fast flags for simulation only, offset: 0x6045C */
  uint8_t RESERVED_410[2];
  __IO uint16_t RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS; /**< RTUNE Common Calibration Status, offset: 0x60460 */
  uint8_t RESERVED_411[2];
  __IO uint16_t RAWLANE0_DIG_AON_TXRX_OVRD_IN;     /**< Override values for incoming AON TX/RX controls from PCS, offset: 0x60464 */
  uint8_t RESERVED_412[2];
  __IO uint16_t RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST; /**< Offset value for RX AFE ATT_2 iDAC, offset: 0x60468 */
  uint8_t RESERVED_413[2];
  __IO uint16_t RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN;  /**< Override incoming values for rxtx_cc, offset: 0x6046C */
  uint8_t RESERVED_414[2];
  __I  uint16_t RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN; /**< Incoming value of CC status from TCA, offset: 0x60470 */
  uint8_t RESERVED_415[2];
  __I  uint16_t RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT; /**< Current values for outgoing CC status to PMA, offset: 0x60474 */
  uint8_t RESERVED_416[2];
  __IO uint16_t RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ; /**< Reset routine request, offset: 0x60478 */
  uint8_t RESERVED_417[2];
  __I  uint16_t RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ; /**< Rx reset interrupt, offset: 0x6047C */
  uint8_t RESERVED_418[2];
  __I  uint16_t RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ;   /**< Rx request interrupt, offset: 0x60480 */
  uint8_t RESERVED_419[2];
  __I  uint16_t RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ;  /**< Rx rate change interrupt request, offset: 0x60484 */
  uint8_t RESERVED_420[2];
  __I  uint16_t RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ; /**< Rx pstate change interrupt request, offset: 0x60488 */
  uint8_t RESERVED_421[2];
  __I  uint16_t RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ; /**< Rx adaptation request interrupt, offset: 0x6048C */
  uint8_t RESERVED_422[2];
  __I  uint16_t RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ; /**< Rx adaptation disable interrupt, offset: 0x60490 */
  uint8_t RESERVED_423[2];
  __IO uint16_t RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ_CLR; /**< RX reset interrupt clear, offset: 0x60494 */
  uint8_t RESERVED_424[2];
  __IO uint16_t RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ_CLR; /**< RX request interrupt clear, offset: 0x60498 */
  uint8_t RESERVED_425[2];
  __IO uint16_t RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ_CLR; /**< RX rate change interrupt clear, offset: 0x6049C */
  uint8_t RESERVED_426[2];
  __IO uint16_t RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR; /**< RX pstate change interrupt clear, offset: 0x604A0 */
  uint8_t RESERVED_427[2];
  __IO uint16_t RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR; /**< RX adaptation request interrupt clear, offset: 0x604A4 */
  uint8_t RESERVED_428[2];
  __IO uint16_t RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR; /**< RX adaptation disable interrupt clear, offset: 0x604A8 */
  uint8_t RESERVED_429[2];
  __IO uint16_t RAWLANE0_DIG_IRQ_CTL_IRQ_MASK;     /**< Interrupt Mask, offset: 0x604AC */
  uint8_t RESERVED_430[2];
  __I  uint16_t RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ; /**< Lane transceiver mode interrupt, offset: 0x604B0 */
  uint8_t RESERVED_431[2];
  __IO uint16_t RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR; /**< Lane transceiver mode interrupt clear, offset: 0x604B4 */
  uint8_t RESERVED_432[2];
  __IO uint16_t RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN;  /**< Override values for incoming LANE controls, offset: 0x604B8 */
  uint8_t RESERVED_433[2];
  __IO uint16_t RAWLANE0_DIG_PMA_XF_LANE_OVRD_OUT; /**< Override values for outgoing LANE controls, offset: 0x604BC */
  uint8_t RESERVED_434[2];
  __IO uint16_t RAWLANE0_DIG_PMA_XF_SUP_OVRD_IN;   /**< Override values for incoming SUP controls from PMA, offset: 0x604C0 */
  uint8_t RESERVED_435[2];
  __I  uint16_t RAWLANE0_DIG_PMA_XF_SUP_PMA_IN;    /**< Current values for incoming MPLL status controls from PMA, offset: 0x604C4 */
  uint8_t RESERVED_436[2];
  __IO uint16_t RAWLANE0_DIG_PMA_XF_TX_OVRD_OUT;   /**< Override values for outgoing TX controls to PMA, offset: 0x604C8 */
  uint8_t RESERVED_437[2];
  __I  uint16_t RAWLANE0_DIG_PMA_XF_TX_PMA_IN;     /**< Current values for coming TX status controls from PMA, offset: 0x604CC */
  uint8_t RESERVED_438[2];
  __IO uint16_t RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT;   /**< Override values for outgoing RX controls to PMA, offset: 0x604D0 */
  uint8_t RESERVED_439[2];
  __I  uint16_t RAWLANE0_DIG_PMA_XF_RX_PMA_IN;     /**< Current values for coming RX status controls from PMA, offset: 0x604D4 */
  uint8_t RESERVED_440[2];
  __IO uint16_t RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL; /**< Lane Rtune Controls, offset: 0x604D8 */
  uint8_t RESERVED_441[2];
  __I  uint16_t RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1;  /**< Current values for incoming RTUNE status controls from PMA, offset: 0x604DC */
  uint8_t RESERVED_442[2];
  __I  uint16_t RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID; /**< Current value of RX valid from PMA, offset: 0x604E0 */
  uint8_t RESERVED_443[2];
  __IO uint16_t RAWLANE0_DIG_TX_CTL_TX_FSM_CTL;    /**< TX FSM Control, offset: 0x604E4 */
  uint8_t RESERVED_444[2];
  __IO uint16_t RAWLANE0_DIG_TX_CTL_TX_CLK_CTL;    /**< Select clock to act as TX input clock, offset: 0x604E8 */
  uint8_t RESERVED_445[2];
  __IO uint16_t RAWLANE0_DIG_RX_CTL_RX_FSM_CTL;    /**< RX FSM control register, offset: 0x604EC */
  uint8_t RESERVED_446[2];
  __IO uint16_t RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL; /**< RX LOS Mask Control, offset: 0x604F0 */
  uint8_t RESERVED_447[2];
  __IO uint16_t RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL; /**< RX Data Enable Override Control, offset: 0x604F4 */
  uint8_t RESERVED_448[2];
  __I  uint16_t RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS; /**< RX continuous offset cancellation status, offset: 0x604F8 */
  uint8_t RESERVED_449[2];
  __I  uint16_t RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS; /**< RX continuous adaptation status, offset: 0x604FC */
  uint8_t RESERVED_450[129794];
  struct X2_RAWMEM_D_ROM_CMNX_BY_RZ {              /* offset: 0x80000, array step: index*0x400, index2*0x80, index3*0x4 */
    __I  uint16_t RAWMEM_D_ROM_CMN_B_R;              /**< Common Memory #0, Bank #0, Reg #0..Common Memory #15, Bank #7, Reg #31, array offset: 0x80000, array step: index*0x400, index2*0x80, index3*0x4 */
    uint8_t RESERVED_0[2];
  } RAWMEM_D_ROM_CMNX_BY_RZ[X2_RAWMEM_D_ROM_CMNX_COUNT][X2_RAWMEM_D_ROM_CMNX_RAWMEM_D_ROM_CMNX_BY_COUNT][X2_RAWMEM_D_ROM_CMNX_RAWMEM_D_ROM_CMNX_BY_RAWMEM_D_ROM_CMNX_BY_RZ_COUNT];
  uint8_t RESERVED_451[114688];
  struct X2_RAWMEM_D_RAM_CMNX_BY_RZ {              /* offset: 0xA0000, array step: index*0x400, index2*0x80, index3*0x4 */
    __IO uint16_t RAWMEM_D_RAM_CMN_B_R;              /**< Common Memory #0, Bank #0, Reg #0..Common Memory #15, Bank #7, Reg #31, array offset: 0xA0000, array step: index*0x400, index2*0x80, index3*0x4 */
    uint8_t RESERVED_0[2];
  } RAWMEM_D_RAM_CMNX_BY_RZ[X2_RAWMEM_D_RAM_CMNX_COUNT][X2_RAWMEM_D_RAM_CMNX_RAWMEM_D_RAM_CMNX_BY_COUNT][X2_RAWMEM_D_RAM_CMNX_RAWMEM_D_RAM_CMNX_BY_RAWMEM_D_RAM_CMNX_BY_RZ_COUNT];
  uint8_t RESERVED_452[114688];
  __I  uint16_t SUPX_DIG_IDCODE_LO;                /**< Low 16 bits of IDCODE, offset: 0xC0000 */
  uint8_t RESERVED_453[2];
  __I  uint16_t SUPX_DIG_IDCODE_HI;                /**< High 16 bits of IDCODE, offset: 0xC0004 */
  uint8_t RESERVED_454[2];
  __IO uint16_t SUPX_DIG_REFCLK_OVRD_IN;           /**< Override values for incoming REFCLK and RESET controls from ASIC, offset: 0xC0008 */
  uint8_t RESERVED_455[2];
  __IO uint16_t SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN;    /**< Override values for incoming MPLLA_DIV_CLK controls from ASIC, offset: 0xC000C */
  uint8_t RESERVED_456[2];
  __IO uint16_t SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN;    /**< Override values for incoming MPLLB_DIV_CLK controls from ASIC, offset: 0xC0010 */
  uint8_t RESERVED_457[2];
  __IO uint16_t SUPX_DIG_MPLLA_OVRD_IN_0;          /**< Override values for incoming MPLLA controls from ASIC, offset: 0xC0014 */
  uint8_t RESERVED_458[2];
  __IO uint16_t SUPX_DIG_MPLLA_OVRD_IN_1;          /**< Override values for incoming MPLLA controls from ASIC, offset: 0xC0018 */
  uint8_t RESERVED_459[2];
  __IO uint16_t SUPX_DIG_MPLLA_OVRD_IN_2;          /**< Override values for incoming MPLLA controls from ASIC, offset: 0xC001C */
  uint8_t RESERVED_460[2];
  __IO uint16_t SUPX_DIG_MPLLA_BANDWIDTH_OVRD_IN;  /**< Override values for incoming MPLLA bandwidth controls from ASIC, offset: 0xC0020 */
  uint8_t RESERVED_461[2];
  __IO uint16_t SUPX_DIG_MPLLB_OVRD_IN_0;          /**< Override values for incoming MPLLB controls from ASIC, offset: 0xC0024 */
  uint8_t RESERVED_462[2];
  __IO uint16_t SUPX_DIG_MPLLB_OVRD_IN_1;          /**< Override values for incoming MPLLB controls from ASIC, offset: 0xC0028 */
  uint8_t RESERVED_463[2];
  __IO uint16_t SUPX_DIG_MPLLB_OVRD_IN_2;          /**< Override values for incoming MPLLB controls from ASIC, offset: 0xC002C */
  uint8_t RESERVED_464[2];
  __IO uint16_t SUPX_DIG_MPLLB_BANDWIDTH_OVRD_IN;  /**< Override values for incoming MPLLB bandwidth controls from ASIC, offset: 0xC0030 */
  uint8_t RESERVED_465[2];
  __IO uint16_t SUPX_DIG_SUP_OVRD_IN;              /**< Override values for support block ASIC inputs, offset: 0xC0034 */
  uint8_t RESERVED_466[2];
  __IO uint16_t SUPX_DIG_SUP_OVRD_OUT;             /**< Override values for support block ASIC outputs, offset: 0xC0038 */
  uint8_t RESERVED_467[2];
  __IO uint16_t SUPX_DIG_LVL_OVRD_IN;              /**< Override values for level settings, offset: 0xC003C */
  uint8_t RESERVED_468[2];
  __IO uint16_t SUPX_DIG_DEBUG;                    /**< Debug controls, offset: 0xC0040 */
  uint8_t RESERVED_469[2];
  __I  uint16_t SUPX_DIG_MPLLA_ASIC_IN_0;          /**< Current values for incoming MPLLA controls from ASIC, offset: 0xC0044 */
  uint8_t RESERVED_470[2];
  __I  uint16_t SUPX_DIG_MPLLA_ASIC_IN_1;          /**< Current values for incoming MPLLA controls from ASIC, offset: 0xC0048 */
  uint8_t RESERVED_471[2];
  __I  uint16_t SUPX_DIG_MPLLA_ASIC_IN_2;          /**< Current values for incoming MPLLA controls from ASIC, offset: 0xC004C */
  uint8_t RESERVED_472[2];
  __I  uint16_t SUPX_DIG_MPLLB_ASIC_IN_0;          /**< Current values for incoming MPLLB controls from ASIC, offset: 0xC0050 */
  uint8_t RESERVED_473[2];
  __I  uint16_t SUPX_DIG_MPLLB_ASIC_IN_1;          /**< Current values for incoming MPLLB controls from ASIC, offset: 0xC0054 */
  uint8_t RESERVED_474[2];
  __I  uint16_t SUPX_DIG_MPLLB_ASIC_IN_2;          /**< Current values for incoming MPLLB controls from ASIC, offset: 0xC0058 */
  uint8_t RESERVED_475[2];
  __I  uint16_t SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN;    /**< Current values for incoming MPLLA_DIV_CLK controls from ASIC, offset: 0xC005C */
  uint8_t RESERVED_476[2];
