zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
  __I  uint16_t SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN;    /**< Current values for incoming MPLLB_DIV_CLK controls from ASIC, offset: 0xC0060 */
  uint8_t RESERVED_477[2];
  __I  uint16_t SUPX_DIG_ASIC_IN;                  /**< Current values for incoming SUP control signals from ASIC, offset: 0xC0064 */
  uint8_t RESERVED_478[2];
  __I  uint16_t SUPX_DIG_LVL_ASIC_IN;              /**< Current values for incoming level controls from ASIC, offset: 0xC0068 */
  uint8_t RESERVED_479[2];
  __I  uint16_t SUPX_DIG_BANDGAP_ASIC_IN;          /**< Current values for incoming bandgap control from ASIC, offset: 0xC006C */
  uint8_t RESERVED_480[2];
  __I  uint16_t SUPX_DIG_MPLLA_BANDWIDTH_ASIC_IN;  /**< Current values for incoming MPLLA bandwidth controls from ASIC, offset: 0xC0070 */
  uint8_t RESERVED_481[2];
  __I  uint16_t SUPX_DIG_MPLLB_BANDWIDTH_ASIC_IN;  /**< Current values for incoming MPLLB bandwidth controls from ASIC, offset: 0xC0074 */
  uint8_t RESERVED_482[2];
  __IO uint16_t SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL; /**< MPLL Calibration controls, offset: 0xC0078 */
  uint8_t RESERVED_483[2];
  __IO uint16_t SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD; /**< MPLL override controls, offset: 0xC007C */
  uint8_t RESERVED_484[2];
  __I  uint16_t SUPX_DIG_MPLLA_MPLL_PWR_CTL_STAT;  /**< MPLL status register, offset: 0xC0080 */
  uint8_t RESERVED_485[2];
  __IO uint16_t SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD; /**< Thresholds for MPLL CAL Update timer and MPLL VCO Stabilization timer, offset: 0xC0084 */
  uint8_t RESERVED_486[2];
  __IO uint16_t SUPX_DIG_MPLLA_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD; /**< Thresholds for PCLK enable and MPLL VCO Clock Stabilization timer, offset: 0xC0088 */
  uint8_t RESERVED_487[2];
  __IO uint16_t SUPX_DIG_MPLLA_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD; /**< Thresholds for PCLK disable and MPLL VCO POWER DOWN timer, offset: 0xC008C */
  uint8_t RESERVED_488[2];
  __IO uint16_t SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD; /**< Thresholds for MPLL feedback clock enable and MPLL feedback digital clock disable and MPLL ANA POWER UP timer, offset: 0xC0090 */
  uint8_t RESERVED_489[2];
  __I  uint16_t SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL; /**< MPLL coarse_tune value register, offset: 0xC0094 */
  uint8_t RESERVED_490[2];
  __I  uint16_t SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE; /**< Value for MPLL coarse_tune when skipping calibration, offset: 0xC0098 */
  uint8_t RESERVED_491[2];
  __IO uint16_t SUPX_DIG_MPLLA_SSC_SS_PHASE;       /**< Current MPLL phase selector value, offset: 0xC009C */
  uint8_t RESERVED_492[2];
  __IO uint16_t SUPX_DIG_MPLLA_SSC_SS_FREQ_0;      /**< Frequency Control for Spread Spectrum #0, offset: 0xC00A0 */
  uint8_t RESERVED_493[2];
  __IO uint16_t SUPX_DIG_MPLLA_SSC_SS_FREQ_1;      /**< Frequency Control for Spread Spectrum #1, offset: 0xC00A4 */
  uint8_t RESERVED_494[2];
  __IO uint16_t SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL; /**< MPLL Calibration controls, offset: 0xC00A8 */
  uint8_t RESERVED_495[2];
  __IO uint16_t SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_OVRD; /**< MPLL override controls, offset: 0xC00AC */
  uint8_t RESERVED_496[2];
  __I  uint16_t SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT;  /**< MPLL status register, offset: 0xC00B0 */
  uint8_t RESERVED_497[2];
  __IO uint16_t SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD; /**< Thresholds for MPLL CAL Update timer and MPLL VCO Stabilization timer, offset: 0xC00B4 */
  uint8_t RESERVED_498[2];
  __IO uint16_t SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD; /**< Thresholds for PCLK enable and MPLL VCO Clock Stabilization timer, offset: 0xC00B8 */
  uint8_t RESERVED_499[2];
  __IO uint16_t SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD; /**< Thresholds for PCLK disable and MPLL VCO POWER DOWN timer, offset: 0xC00BC */
  uint8_t RESERVED_500[2];
  __IO uint16_t SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD; /**< Thresholds for MPLL feedback clock enable and MPLL feedback digital clock disable and MPLL ANA POWER UP timer, offset: 0xC00C0 */
  uint8_t RESERVED_501[2];
  __I  uint16_t SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL; /**< MPLL coarse_tune value register, offset: 0xC00C4 */
  uint8_t RESERVED_502[2];
  __I  uint16_t SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE; /**< Value for MPLL coarse_tune when skipping calibration, offset: 0xC00C8 */
  uint8_t RESERVED_503[2];
  __IO uint16_t SUPX_DIG_MPLLB_SSC_SS_PHASE;       /**< Current MPLL phase selector value, offset: 0xC00CC */
  uint8_t RESERVED_504[2];
  __IO uint16_t SUPX_DIG_MPLLB_SSC_SS_FREQ_0;      /**< Frequency Control for Spread Spectrum #0, offset: 0xC00D0 */
  uint8_t RESERVED_505[2];
  __IO uint16_t SUPX_DIG_MPLLB_SSC_SS_FREQ_1;      /**< Frequency Control for Spread Spectrum #1, offset: 0xC00D4 */
  uint8_t RESERVED_506[2];
  __IO uint16_t SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0;  /**< BG Power UP Time Register #0, offset: 0xC00D8 */
  uint8_t RESERVED_507[2];
  __IO uint16_t SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1;  /**< BG Power UP Time Register #1, offset: 0xC00DC */
  uint8_t RESERVED_508[2];
  __IO uint16_t SUPX_ANA_MPLLA_MISC;               /**< MPLLA_MISC, offset: 0xC00E0 */
  uint8_t RESERVED_509[2];
  __IO uint16_t SUPX_ANA_MPLLA_OVRD;               /**< MPLLA_OVRD, offset: 0xC00E4 */
  uint8_t RESERVED_510[2];
  __IO uint16_t SUPX_ANA_MPLLA_ATB1;               /**< MPLLA_ATB1, offset: 0xC00E8 */
  uint8_t RESERVED_511[2];
  __IO uint16_t SUPX_ANA_MPLLA_ATB2;               /**< MPLLA_ATB2, offset: 0xC00EC */
  uint8_t RESERVED_512[2];
  __IO uint16_t SUPX_ANA_MPLLA_ATB3;               /**< MPLLA_ATB3, offset: 0xC00F0 */
  uint8_t RESERVED_513[2];
  __IO uint16_t SUPX_ANA_MPLLB_MISC;               /**< MPLLB_MISC, offset: 0xC00F4 */
  uint8_t RESERVED_514[2];
  __IO uint16_t SUPX_ANA_MPLLB_OVRD;               /**< MPLLB_OVRD, offset: 0xC00F8 */
  uint8_t RESERVED_515[2];
  __IO uint16_t SUPX_ANA_MPLLB_ATB1;               /**< MPLLB_ATB1, offset: 0xC00FC */
  uint8_t RESERVED_516[2];
  __IO uint16_t SUPX_ANA_MPLLB_ATB2;               /**< MPLLB_ATB2, offset: 0xC0100 */
  uint8_t RESERVED_517[2];
  __IO uint16_t SUPX_ANA_MPLLB_ATB3;               /**< MPLLB_ATB3, offset: 0xC0104 */
  uint8_t RESERVED_518[2];
  __IO uint16_t SUPX_ANA_RTUNE_CTRL;               /**< RTUNE_CTRL, offset: 0xC0108 */
  uint8_t RESERVED_519[2];
  __IO uint16_t SUPX_ANA_SWITCH_PWR_MEAS;          /**< SWITCH_PWR_MEAS, offset: 0xC010C */
  uint8_t RESERVED_520[2];
  __IO uint16_t SUPX_ANA_SWITCH_MISC_MEAS;         /**< SWITCH_MISC_MEAS, offset: 0xC0110 */
  uint8_t RESERVED_521[2];
  __IO uint16_t SUPX_ANA_BG;                       /**< BG, offset: 0xC0114 */
  uint8_t RESERVED_522[2];
  __IO uint16_t SUPX_ANA_PRESCALER_CTRL;           /**< PRESCALER_CTRL, offset: 0xC0118 */
  uint8_t RESERVED_523[2];
  __IO uint16_t SUPX_DIG_RTUNE_DEBUG;              /**< Resistor tuning debug controls, offset: 0xC011C */
  uint8_t RESERVED_524[2];
  __IO uint16_t SUPX_DIG_RTUNE_CONFIG;             /**< Configure Rtune Operation, offset: 0xC0120 */
  uint8_t RESERVED_525[2];
  __I  uint16_t SUPX_DIG_RTUNE_STAT;               /**< Resistor tuning register status, offset: 0xC0124 */
  uint8_t RESERVED_526[2];
  __IO uint16_t SUPX_DIG_RTUNE_RX_SET_VAL;         /**< Set value of RX Resistor, offset: 0xC0128 */
  uint8_t RESERVED_527[2];
  __IO uint16_t SUPX_DIG_RTUNE_TXDN_SET_VAL;       /**< Set value of TX-DN Resistor, offset: 0xC012C */
  uint8_t RESERVED_528[2];
  __IO uint16_t SUPX_DIG_RTUNE_TXUP_SET_VAL;       /**< Set value of TX-UP Resistor, offset: 0xC0130 */
  uint8_t RESERVED_529[2];
  __I  uint16_t SUPX_DIG_RTUNE_RX_STAT;            /**< RX Resistor tuning register status, offset: 0xC0134 */
  uint8_t RESERVED_530[2];
  __I  uint16_t SUPX_DIG_RTUNE_TXDN_STAT;          /**< TX-DN Resistor tuning register status, offset: 0xC0138 */
  uint8_t RESERVED_531[2];
  __I  uint16_t SUPX_DIG_RTUNE_TXUP_STAT;          /**< TX-UP Resistor tuning register status, offset: 0xC013C */
  uint8_t RESERVED_532[2];
  __IO uint16_t SUPX_DIG_ANA_MPLLA_OVRD_OUT;       /**< Override value for mplla signals going to ANA, offset: 0xC0140 */
  uint8_t RESERVED_533[2];
  __IO uint16_t SUPX_DIG_ANA_MPLLB_OVRD_OUT;       /**< Override value for mpllb signals going to ANA, offset: 0xC0144 */
  uint8_t RESERVED_534[2];
  __IO uint16_t SUPX_DIG_ANA_RTUNE_OVRD_OUT;       /**< Override value for RTUNE signals going to ANA, offset: 0xC0148 */
  uint8_t RESERVED_535[2];
  __I  uint16_t SUPX_DIG_ANA_STAT;                 /**< SUP input status register for SUP ANA outputs, offset: 0xC014C */
  uint8_t RESERVED_536[2];
  __IO uint16_t SUPX_DIG_ANA_ANA_OVRD_OUT;         /**< Override values for ana_async_rst and bandgap signals going to ANA, offset: 0xC0150 */
  uint8_t RESERVED_537[2];
  __IO uint16_t SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT;  /**< Override value for mplla pmix signals going to ANA, offset: 0xC0154 */
  uint8_t RESERVED_538[2];
  __IO uint16_t SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT;  /**< Override value for mpllb pmix signals going to ANA, offset: 0xC0158 */
  uint8_t RESERVED_539[2];
  __IO uint16_t LANEX_DIG_ASIC_LANE_OVRD_IN;       /**< Override values for incoming LANE controls from ASIC, offset: 0xC015C */
  uint8_t RESERVED_540[2];
  __IO uint16_t LANEX_DIG_ASIC_TX_OVRD_IN_0;       /**< Override values for incoming TX controls from ASIC, register #0, offset: 0xC0160 */
  uint8_t RESERVED_541[2];
  __IO uint16_t LANEX_DIG_ASIC_TX_OVRD_IN_1;       /**< Override values for incoming TX drive controls from ASIC, register #1, offset: 0xC0164 */
  uint8_t RESERVED_542[2];
  __IO uint16_t LANEX_DIG_ASIC_TX_OVRD_IN_2;       /**< Override values for incoming TX drive controls from ASIC, register #2, offset: 0xC0168 */
  uint8_t RESERVED_543[2];
  __IO uint16_t LANEX_DIG_ASIC_TX_OVRD_IN_3;       /**< Override values for incoming TX drive controls from ASIC, register #3, offset: 0xC016C */
  uint8_t RESERVED_544[2];
  __IO uint16_t LANEX_DIG_ASIC_TX_OVRD_IN_4;       /**< Override values for incoming TX drive controls from ASIC, register #4, offset: 0xC0170 */
  uint8_t RESERVED_545[2];
  __IO uint16_t LANEX_DIG_ASIC_TX_OVRD_OUT;        /**< Override values for outgoing TX controls to ASIC, offset: 0xC0174 */
  uint8_t RESERVED_546[2];
  __IO uint16_t LANEX_DIG_ASIC_RX_OVRD_IN_0;       /**< Override values for incoming RX controls from ASIC, register #0, offset: 0xC0178 */
  uint8_t RESERVED_547[2];
  __IO uint16_t LANEX_DIG_ASIC_RX_OVRD_IN_1;       /**< Override values for incoming RX controls from ASIC, register #1, offset: 0xC017C */
  uint8_t RESERVED_548[2];
  __IO uint16_t LANEX_DIG_ASIC_RX_OVRD_IN_2;       /**< Override values for incoming RX controls from ASIC, register #2, offset: 0xC0180 */
  uint8_t RESERVED_549[2];
  __IO uint16_t LANEX_DIG_ASIC_RX_OVRD_IN_3;       /**< Override values for incoming RX controls from ASIC, register #3, offset: 0xC0184 */
  uint8_t RESERVED_550[2];
  __IO uint16_t LANEX_DIG_ASIC_RX_OVRD_IN_4;       /**< Override values for incoming RX controls from ASIC, register #4, offset: 0xC0188 */
  uint8_t RESERVED_551[2];
  __IO uint16_t LANEX_DIG_ASIC_RX_OVRD_IN_5;       /**< Override values for incoming RX controls from ASIC, register #5, offset: 0xC018C */
  uint8_t RESERVED_552[2];
  __IO uint16_t LANEX_DIG_ASIC_RX_OVRD_EQ_IN_0;    /**< Override values for incoming RX EQ controls from ASIC, register #0, offset: 0xC0190 */
  uint8_t RESERVED_553[2];
  __IO uint16_t LANEX_DIG_ASIC_RX_OVRD_EQ_IN_1;    /**< Override values for incoming RX EQ controls from ASIC, register #1, offset: 0xC0194 */
  uint8_t RESERVED_554[2];
  __IO uint16_t LANEX_DIG_ASIC_RX_OVRD_OUT_0;      /**< Override values for outgoing RX controls to ASIC, register #0, offset: 0xC0198 */
  uint8_t RESERVED_555[2];
  __I  uint16_t LANEX_DIG_ASIC_LANE_ASIC_IN;       /**< Current values for incoming LANE controls from ASIC, offset: 0xC019C */
  uint8_t RESERVED_556[2];
  __I  uint16_t LANEX_DIG_ASIC_TX_ASIC_IN_0;       /**< Current values for incoming TX controls from ASIC, register #0, offset: 0xC01A0 */
  uint8_t RESERVED_557[2];
  __I  uint16_t LANEX_DIG_ASIC_TX_ASIC_IN_1;       /**< Current values for incoming TX controls from ASIC, register #1, offset: 0xC01A4 */
  uint8_t RESERVED_558[2];
  __I  uint16_t LANEX_DIG_ASIC_TX_ASIC_IN_2;       /**< Current values for incoming TX controls from ASIC, register #2, offset: 0xC01A8 */
  uint8_t RESERVED_559[2];
  __I  uint16_t LANEX_DIG_ASIC_TX_ASIC_OUT;        /**< Current values for outgoing TX status controls from PHY, offset: 0xC01AC */
  uint8_t RESERVED_560[2];
  __I  uint16_t LANEX_DIG_ASIC_RX_ASIC_IN_0;       /**< Current values for incoming RX controls from ASIC, register #0, offset: 0xC01B0 */
  uint8_t RESERVED_561[2];
  __I  uint16_t LANEX_DIG_ASIC_RX_ASIC_IN_1;       /**< Current values for incoming RX controls from ASIC, register #1, offset: 0xC01B4 */
  uint8_t RESERVED_562[2];
  __I  uint16_t LANEX_DIG_ASIC_RX_EQ_ASIC_IN_0;    /**< Current values for incoming RX EQ controls from ASIC, register #0, offset: 0xC01B8 */
  uint8_t RESERVED_563[2];
  __I  uint16_t LANEX_DIG_ASIC_RX_EQ_ASIC_IN_1;    /**< Current values for incoming RX EQ controls from ASIC, register #1, offset: 0xC01BC */
  uint8_t RESERVED_564[2];
  __I  uint16_t LANEX_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0; /**< Current values for incoming RX CDR VCO controls from ASIC, register #0, offset: 0xC01C0 */
  uint8_t RESERVED_565[2];
  __I  uint16_t LANEX_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1; /**< Current values for incoming RX CDR VCO controls from ASIC, register #1, offset: 0xC01C4 */
  uint8_t RESERVED_566[2];
  __I  uint16_t LANEX_DIG_ASIC_RX_ASIC_OUT_0;      /**< Current values for outgoing RX status controls from PHY, register #0, offset: 0xC01C8 */
  uint8_t RESERVED_567[2];
  __IO uint16_t LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0;  /**< TX Power State Control Register for P0, offset: 0xC01CC */
  uint8_t RESERVED_568[2];
  __IO uint16_t LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0S; /**< TX Power State Control Register for P0S, offset: 0xC01D0 */
  uint8_t RESERVED_569[2];
  __IO uint16_t LANEX_DIG_TX_PWRCTL_TX_PSTATE_P1;  /**< TX Power State Control Register for P1, offset: 0xC01D4 */
  uint8_t RESERVED_570[2];
  __IO uint16_t LANEX_DIG_TX_PWRCTL_TX_PSTATE_P2;  /**< TX Power State Control Register for P2, offset: 0xC01D8 */
  uint8_t RESERVED_571[2];
  __IO uint16_t LANEX_DIG_TX_PWRCTL_TX_PWRUP_TIME_0; /**< TX Power UP Time Register #0, offset: 0xC01DC */
  uint8_t RESERVED_572[2];
  __IO uint16_t LANEX_DIG_TX_PWRCTL_TX_PWRUP_TIME_1; /**< TX Power UP Time Register #1, offset: 0xC01E0 */
  uint8_t RESERVED_573[2];
  __IO uint16_t LANEX_DIG_TX_PWRCTL_TX_PWRUP_TIME_2; /**< TX Power UP Time Register #2, offset: 0xC01E4 */
  uint8_t RESERVED_574[2];
  __IO uint16_t LANEX_DIG_TX_PWRCTL_TX_PWRUP_TIME_3; /**< TX Power UP Time Register #3, offset: 0xC01E8 */
  uint8_t RESERVED_575[2];
  __IO uint16_t LANEX_DIG_TX_PWRCTL_TX_PWRUP_TIME_4; /**< TX Power UP Time Register #4, offset: 0xC01EC */
  uint8_t RESERVED_576[2];
  __IO uint16_t LANEX_DIG_TX_PWRCTL_TX_PWRUP_TIME_5; /**< TX Power UP Time Register #5, offset: 0xC01F0 */
  uint8_t RESERVED_577[2];
  __IO uint16_t LANEX_DIG_TX_LBERT_CTL;            /**< Pattern Generator controls, offset: 0xC01F4 */
  uint8_t RESERVED_578[2];
  __IO uint16_t LANEX_DIG_TX_CLK_ALIGN_TX_CTL_0;   /**< TX Clock Alignment Control Register #0, offset: 0xC01F8 */
  uint8_t RESERVED_579[2];
  __IO uint16_t LANEX_DIG_RX_PWRCTL_RX_PSTATE_P0;  /**< RX Power State Control Register for P0, offset: 0xC01FC */
  uint8_t RESERVED_580[2];
  __IO uint16_t LANEX_DIG_RX_PWRCTL_RX_PSTATE_P0S; /**< RX Power State Control Register for P0S, offset: 0xC0200 */
  uint8_t RESERVED_581[2];
  __IO uint16_t LANEX_DIG_RX_PWRCTL_RX_PSTATE_P1;  /**< RX Power State Control Register for P1, offset: 0xC0204 */
  uint8_t RESERVED_582[2];
  __IO uint16_t LANEX_DIG_RX_PWRCTL_RX_PSTATE_P2;  /**< RX Power State Control Register for P2, offset: 0xC0208 */
  uint8_t RESERVED_583[2];
  __IO uint16_t LANEX_DIG_RX_PWRCTL_RX_PWRUP_TIME_0; /**< RX Power UP Time Register #0, offset: 0xC020C */
  uint8_t RESERVED_584[2];
  __IO uint16_t LANEX_DIG_RX_PWRCTL_RX_PWRUP_TIME_1; /**< RX Power UP Time Register #1, offset: 0xC0210 */
  uint8_t RESERVED_585[2];
  __IO uint16_t LANEX_DIG_RX_PWRCTL_RX_PWRUP_TIME_2; /**< RX Power UP Time Register #2, offset: 0xC0214 */
  uint8_t RESERVED_586[2];
  __IO uint16_t LANEX_DIG_RX_PWRCTL_RX_PWRUP_TIME_3; /**< RX Power UP Time Register #3, offset: 0xC0218 */
  uint8_t RESERVED_587[2];
  __IO uint16_t LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0; /**< RX VCO calibration controls register #0, offset: 0xC021C */
  uint8_t RESERVED_588[2];
  __IO uint16_t LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1; /**< RX VCO calibration controls register #1, offset: 0xC0220 */
  uint8_t RESERVED_589[2];
  __IO uint16_t LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2; /**< RX VCO calibration controls register #2, offset: 0xC0224 */
  uint8_t RESERVED_590[2];
  __IO uint16_t LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0; /**< RX Power UP Time Register #0, offset: 0xC0228 */
  uint8_t RESERVED_591[2];
  __IO uint16_t LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1; /**< RX Power UP Time Register #1, offset: 0xC022C */
  uint8_t RESERVED_592[2];
  __I  uint16_t LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0; /**< RX VCO status register #0, offset: 0xC0230 */
  uint8_t RESERVED_593[2];
  __I  uint16_t LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1; /**< RX VCO status register #1, offset: 0xC0234 */
  uint8_t RESERVED_594[2];
  __I  uint16_t LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2; /**< RX VCO status register #2, offset: 0xC0238 */
  uint8_t RESERVED_595[2];
  __IO uint16_t LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK; /**< XAUI_COMMA Mask, offset: 0xC023C */
  uint8_t RESERVED_596[2];
  __IO uint16_t LANEX_DIG_RX_LBERT_CTL;            /**< Pattern Matcher controls, offset: 0xC0240 */
  uint8_t RESERVED_597[2];
  __IO uint16_t LANEX_DIG_RX_LBERT_ERR;            /**< Pattern match error counter, offset: 0xC0244 */
  uint8_t RESERVED_598[2];
  __IO uint16_t LANEX_DIG_RX_CDR_CDR_CTL_0;        /**< Control bits for receiver in recovered domain, offset: 0xC0248 */
  uint8_t RESERVED_599[2];
  __IO uint16_t LANEX_DIG_RX_CDR_CDR_CTL_1;        /**< CDR Control Register #1, offset: 0xC024C */
  uint8_t RESERVED_600[2];
  __IO uint16_t LANEX_DIG_RX_CDR_CDR_CTL_2;        /**< CDR Control Register #2, offset: 0xC0250 */
  uint8_t RESERVED_601[2];
  __IO uint16_t LANEX_DIG_RX_CDR_CDR_CTL_3;        /**< CDR Control Register #3, offset: 0xC0254 */
  uint8_t RESERVED_602[2];
  __IO uint16_t LANEX_DIG_RX_CDR_CDR_CTL_4;        /**< CDR Control Register #4, offset: 0xC0258 */
  uint8_t RESERVED_603[2];
  __I  uint16_t LANEX_DIG_RX_CDR_STAT;             /**< Current output values to dpll (phug, frug), offset: 0xC025C */
  uint8_t RESERVED_604[2];
  __IO uint16_t LANEX_DIG_RX_DPLL_FREQ;            /**< Current frequency integrator value., offset: 0xC0260 */
  uint8_t RESERVED_605[2];
  __IO uint16_t LANEX_DIG_RX_DPLL_FREQ_BOUND_0;    /**< Frequency Bounds for incoming data stream #0, offset: 0xC0264 */
  uint8_t RESERVED_606[2];
  __IO uint16_t LANEX_DIG_RX_DPLL_FREQ_BOUND_1;    /**< Frequency Bounds for incoming data stream #1, offset: 0xC0268 */
  uint8_t RESERVED_607[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0;   /**< Adaptation Configuration Register #0, offset: 0xC026C */
  uint8_t RESERVED_608[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1;   /**< Adaptation Configuration Register #1, offset: 0xC0270 */
  uint8_t RESERVED_609[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2;   /**< Adaptation Configuration Register #2, offset: 0xC0274 */
  uint8_t RESERVED_610[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3;   /**< Adaptation Configuration Register #3, offset: 0xC0278 */
  uint8_t RESERVED_611[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4;   /**< Adaptation Configuration Register #4, offset: 0xC027C */
  uint8_t RESERVED_612[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5;   /**< Adaptation Configuration Register #5, offset: 0xC0280 */
  uint8_t RESERVED_613[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6;   /**< Adaptation Configuration Register #6, offset: 0xC0284 */
  uint8_t RESERVED_614[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7;   /**< Adaptation Configuration Register #7, offset: 0xC0288 */
  uint8_t RESERVED_615[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8;   /**< Adaptation Configuration Register #8, offset: 0xC028C */
  uint8_t RESERVED_616[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9;   /**< Adaptation Configuration Register #9, offset: 0xC0290 */
  uint8_t RESERVED_617[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG; /**< Reset Adaptation Configuration Register, offset: 0xC0294 */
  uint8_t RESERVED_618[2];
  __I  uint16_t LANEX_DIG_RX_ADPTCTL_ATT_STATUS;   /**< Value of ATT Adaptation code, offset: 0xC0298 */
  uint8_t RESERVED_619[2];
  __I  uint16_t LANEX_DIG_RX_ADPTCTL_VGA_STATUS;   /**< Value of VGA Adaptation code, offset: 0xC029C */
  uint8_t RESERVED_620[2];
  __I  uint16_t LANEX_DIG_RX_ADPTCTL_CTLE_STATUS;  /**< Value of CTLE Adaptation code, offset: 0xC02A0 */
  uint8_t RESERVED_621[2];
  __I  uint16_t LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS; /**< Value of DFE Tap1 Adaptation code, offset: 0xC02A4 */
  uint8_t RESERVED_622[2];
  __I  uint16_t LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS; /**< Value of DFE Tap2 Adaptation code, offset: 0xC02A8 */
  uint8_t RESERVED_623[2];
  __I  uint16_t LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS; /**< Value of DFE Tap3 Adaptation code, offset: 0xC02AC */
  uint8_t RESERVED_624[2];
  __I  uint16_t LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS; /**< Value of DFE Tap4 Adaptation code, offset: 0xC02B0 */
  uint8_t RESERVED_625[2];
  __I  uint16_t LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS; /**< Value of DFE Tap5 Adaptation code, offset: 0xC02B4 */
  uint8_t RESERVED_626[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST; /**< Offset values for RX DFE Data Even vDAC, offset: 0xC02B8 */
  uint8_t RESERVED_627[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST; /**< Offset values for RX DFE Data Odd vDAC, offset: 0xC02BC */
  uint8_t RESERVED_628[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN; /**< Sets values for RX SLICER CTRL EVEN signals going to ANA, offset: 0xC02C0 */
  uint8_t RESERVED_629[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD; /**< Sets values for RX SLICER CTRL ODD signals going to ANA, offset: 0xC02C4 */
  uint8_t RESERVED_630[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST; /**< Offset values for RX DFE Error Even vDAC, offset: 0xC02C8 */
  uint8_t RESERVED_631[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST; /**< Offset values for RX DFE Error Odd vDAC, offset: 0xC02CC */
  uint8_t RESERVED_632[2];
  __I  uint16_t LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL; /**< Value of Error Slicer Level, offset: 0xC02D0 */
  uint8_t RESERVED_633[2];
  __IO uint16_t LANEX_DIG_RX_ADPTCTL_ADPT_RESET;   /**< Adaptation reset register, offset: 0xC02D4 */
  uint8_t RESERVED_634[2];
  __IO uint16_t LANEX_DIG_RX_STAT_LD_VAL_1;        /**< Stat load value for the sample counter #1, offset: 0xC02D8 */
  uint8_t RESERVED_635[2];
  __IO uint16_t LANEX_DIG_RX_STAT_DATA_MSK;        /**< Stat data mask bits [15:0], offset: 0xC02DC */
  uint8_t RESERVED_636[2];
  __IO uint16_t LANEX_DIG_RX_STAT_MATCH_CTL0;      /**< Stat match controls register #0, offset: 0xC02E0 */
  uint8_t RESERVED_637[2];
  __IO uint16_t LANEX_DIG_RX_STAT_MATCH_CTL1;      /**< Stat match controls register #1, offset: 0xC02E4 */
  uint8_t RESERVED_638[2];
  __IO uint16_t LANEX_DIG_RX_STAT_STAT_CTL0;       /**< Stat controls register #0, offset: 0xC02E8 */
  uint8_t RESERVED_639[2];
