zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
  __IO uint16_t LANEX_DIG_RX_STAT_STAT_CTL1;       /**< Stat controls register #1, offset: 0xC02EC */
  uint8_t RESERVED_640[2];
  __I  uint16_t LANEX_DIG_RX_STAT_SMPL_CNT1;       /**< Sample Counter #1 Status, offset: 0xC02F0 */
  uint8_t RESERVED_641[2];
  __I  uint16_t LANEX_DIG_RX_STAT_STAT_CNT_0;      /**< Stat Counter 0 Status, offset: 0xC02F4 */
  uint8_t RESERVED_642[2];
  __I  uint16_t LANEX_DIG_RX_STAT_STAT_CNT_1;      /**< Stat Counter 1 Status, offset: 0xC02F8 */
  uint8_t RESERVED_643[2];
  __I  uint16_t LANEX_DIG_RX_STAT_STAT_CNT_2;      /**< Stat Counter 2 Status, offset: 0xC02FC */
  uint8_t RESERVED_644[2];
  __I  uint16_t LANEX_DIG_RX_STAT_STAT_CNT_3;      /**< Stat Counter 3 Status, offset: 0xC0300 */
  uint8_t RESERVED_645[2];
  __I  uint16_t LANEX_DIG_RX_STAT_STAT_CNT_4;      /**< Stat Counter 4 Status, offset: 0xC0304 */
  uint8_t RESERVED_646[2];
  __I  uint16_t LANEX_DIG_RX_STAT_STAT_CNT_5;      /**< Stat Counter 5 Status, offset: 0xC0308 */
  uint8_t RESERVED_647[2];
  __I  uint16_t LANEX_DIG_RX_STAT_STAT_CNT_6;      /**< Stat Counter 6 Status, offset: 0xC030C */
  uint8_t RESERVED_648[2];
  __IO uint16_t LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL; /**< Calibration Comparator Control, offset: 0xC0310 */
  uint8_t RESERVED_649[2];
  __IO uint16_t LANEX_DIG_RX_STAT_MATCH_CTL2;      /**< Stat match controls register #2, offset: 0xC0314 */
  uint8_t RESERVED_650[2];
  __IO uint16_t LANEX_DIG_RX_STAT_MATCH_CTL3;      /**< Stat match controls register #3, offset: 0xC0318 */
  uint8_t RESERVED_651[2];
  __IO uint16_t LANEX_DIG_RX_STAT_MATCH_CTL4;      /**< Stat match controls register #4, offset: 0xC031C */
  uint8_t RESERVED_652[2];
  __IO uint16_t LANEX_DIG_RX_STAT_MATCH_CTL5;      /**< Stat match controls register #5, offset: 0xC0320 */
  uint8_t RESERVED_653[2];
  __IO uint16_t LANEX_DIG_RX_STAT_STAT_CTL2;       /**< Stat controls register #2, offset: 0xC0324 */
  uint8_t RESERVED_654[2];
  __IO uint16_t LANEX_DIG_RX_STAT_STAT_STOP;       /**< Stat stop register, offset: 0xC0328 */
  uint8_t RESERVED_655[2];
  __IO uint16_t LANEX_DIG_ANA_TX_OVRD_OUT;         /**< Override values for TX signals going to ANA, offset: 0xC032C */
  uint8_t RESERVED_656[2];
  __IO uint16_t LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT; /**< Override value for TX termination code going to ANA, offset: 0xC0330 */
  uint8_t RESERVED_657[2];
  __IO uint16_t LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT; /**< Override value for TX termination code clocks going to ANA, offset: 0xC0334 */
  uint8_t RESERVED_658[2];
  __IO uint16_t LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0;    /**< Override values for TX EQ signals going to ANA register #0, offset: 0xC0338 */
  uint8_t RESERVED_659[2];
  __IO uint16_t LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1;    /**< Override values for TX EQ signals going to ANA register #1, offset: 0xC033C */
  uint8_t RESERVED_660[2];
  __IO uint16_t LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2;    /**< Override values for TX EQ signals going to ANA register #2, offset: 0xC0340 */
  uint8_t RESERVED_661[2];
  __IO uint16_t LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3;    /**< Override values for TX EQ signals going to ANA register #3, offset: 0xC0344 */
  uint8_t RESERVED_662[2];
  __IO uint16_t LANEX_DIG_ANA_RX_CTL_OVRD_OUT;     /**< Override values for RX control signals going to ANA, offset: 0xC0348 */
  uint8_t RESERVED_663[2];
  __IO uint16_t LANEX_DIG_ANA_RX_PWR_OVRD_OUT;     /**< Override values for RX PWR UP/DN signals going to ANA, offset: 0xC034C */
  uint8_t RESERVED_664[2];
  __IO uint16_t LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0;   /**< Override values for RX VCO signals going to ANA #0, offset: 0xC0350 */
  uint8_t RESERVED_665[2];
  __IO uint16_t LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1;   /**< Override values for RX VCO signals going to ANA #1, offset: 0xC0354 */
  uint8_t RESERVED_666[2];
  __IO uint16_t LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2;   /**< Override values for RX VCO signals going to ANA #2, offset: 0xC0358 */
  uint8_t RESERVED_667[2];
  __IO uint16_t LANEX_DIG_ANA_RX_CAL;              /**< Sets values for RX CAL signals going to ANA register, offset: 0xC035C */
  uint8_t RESERVED_668[2];
  __IO uint16_t LANEX_DIG_ANA_RX_DAC_CTRL;         /**< Sets values for RX DAC CTRL value going to ANA, offset: 0xC0360 */
  uint8_t RESERVED_669[2];
  __IO uint16_t LANEX_DIG_ANA_RX_DAC_CTRL_OVRD;    /**< Overrides RX DAC CTRL bus (en/val/sel) going to ANA, offset: 0xC0364 */
  uint8_t RESERVED_670[2];
  __IO uint16_t LANEX_DIG_ANA_RX_DAC_CTRL_SEL;     /**< Sets values for RX DAC CTRL Select signal going to ANA, offset: 0xC0368 */
  uint8_t RESERVED_671[2];
  __IO uint16_t LANEX_DIG_ANA_RX_AFE_ATT_VGA;      /**< Value for RX AFE ATT & VGA signals going to ANA, offset: 0xC036C */
  uint8_t RESERVED_672[2];
  __IO uint16_t LANEX_DIG_ANA_RX_AFE_CTLE;         /**< Values for RX AFE CTLE signals going to ANA, offset: 0xC0370 */
  uint8_t RESERVED_673[2];
  __IO uint16_t LANEX_DIG_ANA_RX_SCOPE;            /**< Values for RX SCOPE signals going to ANA, offset: 0xC0374 */
  uint8_t RESERVED_674[2];
  __IO uint16_t LANEX_DIG_ANA_RX_SLICER_CTRL;      /**< Sets values for RX Slicer Ctrl signals going to ANA register, offset: 0xC0378 */
  uint8_t RESERVED_675[2];
  __IO uint16_t LANEX_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST; /**< Sets values for RX ANA IQ PHASE Adjust signal going to ANA register, offset: 0xC037C */
  uint8_t RESERVED_676[2];
  __IO uint16_t LANEX_DIG_ANA_RX_ANA_IQ_SENSE_EN;  /**< Sets values for RX ANA IQ SENSE signal, offset: 0xC0380 */
  uint8_t RESERVED_677[2];
  __IO uint16_t LANEX_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN; /**< DAC CTRL enable signal, offset: 0xC0384 */
  uint8_t RESERVED_678[2];
  __IO uint16_t LANEX_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE; /**< Afe update enable signal, offset: 0xC0388 */
  uint8_t RESERVED_679[2];
  __IO uint16_t LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK; /**< Phase adjust clock signal, offset: 0xC038C */
  uint8_t RESERVED_680[2];
  __I  uint16_t LANEX_DIG_ANA_STATUS_0;            /**< Lane input status register #0, offset: 0xC0390 */
  uint8_t RESERVED_681[2];
  __I  uint16_t LANEX_DIG_ANA_STATUS_1;            /**< Lane input status register #1, offset: 0xC0394 */
  uint8_t RESERVED_682[2];
  __IO uint16_t LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT; /**< Override value for RX termination code going to ANA, offset: 0xC0398 */
  uint8_t RESERVED_683[2];
  __IO uint16_t LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT; /**< Override value for RX termination code clock going to ANA, offset: 0xC039C */
  uint8_t RESERVED_684[2];
  __IO uint16_t LANEX_ANA_TX_OVRD_MEAS;            /**< TX_OVRD_MEAS, offset: 0xC03A0 */
  uint8_t RESERVED_685[2];
  __IO uint16_t LANEX_ANA_TX_PWR_OVRD;             /**< TX_PWR_OVRD, offset: 0xC03A4 */
  uint8_t RESERVED_686[2];
  __IO uint16_t LANEX_ANA_TX_ALT_BUS;              /**< TX_ALT_BUS, offset: 0xC03A8 */
  uint8_t RESERVED_687[2];
  __IO uint16_t LANEX_ANA_TX_ATB1;                 /**< TX_ATB1, offset: 0xC03AC */
  uint8_t RESERVED_688[2];
  __IO uint16_t LANEX_ANA_TX_ATB2;                 /**< TX_ATB2, offset: 0xC03B0 */
  uint8_t RESERVED_689[2];
  __IO uint16_t LANEX_ANA_TX_VBOOST;               /**< TX_VBOOST, offset: 0xC03B4 */
  uint8_t RESERVED_690[2];
  __IO uint16_t LANEX_ANA_TX_TERM_CODE;            /**< TX_TERM_CODE, offset: 0xC03B8 */
  uint8_t RESERVED_691[2];
  __IO uint16_t LANEX_ANA_TX_TERM_CODE_CTRL;       /**< TX_TERM_CODE_CTRL, offset: 0xC03BC */
  uint8_t RESERVED_692[2];
  __IO uint16_t LANEX_ANA_TX_IBOOST_CODE;          /**< TX_IBOOST_CODE, offset: 0xC03C0 */
  uint8_t RESERVED_693[2];
  __IO uint16_t LANEX_ANA_TX_OVRD_CLK;             /**< TX_OVRD_CLK, offset: 0xC03C4 */
  uint8_t RESERVED_694[2];
  __IO uint16_t LANEX_ANA_TX_MISC;                 /**< TX_MISC, offset: 0xC03C8 */
  uint8_t RESERVED_695[2];
  __IO uint16_t LANEX_ANA_RX_ATB_IQSKEW;           /**< RX_ATB_IQSKEW, offset: 0xC03CC */
  uint8_t RESERVED_696[2];
  __IO uint16_t LANEX_ANA_RX_DCC_OVRD;             /**< RX_DCC_OVRD, offset: 0xC03D0 */
  uint8_t RESERVED_697[2];
  __IO uint16_t LANEX_ANA_RX_PWR_CTRL1;            /**< RX_PWR_CTRL1, offset: 0xC03D4 */
  uint8_t RESERVED_698[2];
  __IO uint16_t LANEX_ANA_RX_ATB_REGREF;           /**< RX_ATB_REGREF, offset: 0xC03D8 */
  uint8_t RESERVED_699[2];
  __IO uint16_t LANEX_ANA_RX_CDR_AFE;              /**< RX_CDR_AFE, offset: 0xC03DC */
  uint8_t RESERVED_700[2];
  __IO uint16_t LANEX_ANA_RX_PWR_CTRL2;            /**< RX_PWR_CTRL2, offset: 0xC03E0 */
  uint8_t RESERVED_701[2];
  __IO uint16_t LANEX_ANA_RX_MISC_OVRD;            /**< RX_MISC_OVRD, offset: 0xC03E4 */
  uint8_t RESERVED_702[2];
  __IO uint16_t LANEX_ANA_RX_CAL_MUXA;             /**< RX_CAL_MUXA, offset: 0xC03E8 */
  uint8_t RESERVED_703[2];
  __IO uint16_t LANEX_ANA_RX_ATB_MEAS1;            /**< RX_ATB_MEAS1, offset: 0xC03EC */
  uint8_t RESERVED_704[2];
  __IO uint16_t LANEX_ANA_RX_ATB_MEAS2;            /**< RX_ATB_MEAS2, offset: 0xC03F0 */
  uint8_t RESERVED_705[2];
  __IO uint16_t LANEX_ANA_RX_CAL_MUXB;             /**< RX_CAL_MUXB, offset: 0xC03F4 */
  uint8_t RESERVED_706[2];
  __IO uint16_t LANEX_ANA_RX_TERM;                 /**< RX_TERM, offset: 0xC03F8 */
  uint8_t RESERVED_707[2];
  __IO uint16_t LANEX_ANA_RX_SLC_CTRL;             /**< RX_SLC_CTRL, offset: 0xC03FC */
  uint8_t RESERVED_708[2];
  __IO uint16_t LANEX_ANA_RX_ATB_VREG;             /**< RX_ATB_VREG, offset: 0xC0400 */
  uint8_t RESERVED_709[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_TX_OVRD_IN;    /**< Override values for incoming TX controls from PCS, offset: 0xC0404 */
  uint8_t RESERVED_710[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_1;  /**< Override values for incoming TX controls from PCS, register #1, offset: 0xC0408 */
  uint8_t RESERVED_711[2];
  __I  uint16_t RAWLANEX_DIG_PCS_XF_TX_PCS_IN;     /**< Current values for incoming TX controls from PCS, offset: 0xC040C */
  uint8_t RESERVED_712[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT;   /**< Override values for outgoing TX controls to PCS, offset: 0xC0410 */
  uint8_t RESERVED_713[2];
  __I  uint16_t RAWLANEX_DIG_PCS_XF_TX_PCS_OUT;    /**< Current values for outgoing TX status controls from Raw PCS, offset: 0xC0414 */
  uint8_t RESERVED_714[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_OVRD_IN;    /**< Override values for incoming RX controls from PCS, offset: 0xC0418 */
  uint8_t RESERVED_715[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1;  /**< Override values for incoming RX controls from PCS, register #1, offset: 0xC041C */
  uint8_t RESERVED_716[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_2;  /**< Override values for incoming RX controls from PCS, register #2, offset: 0xC0420 */
  uint8_t RESERVED_717[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_3;  /**< Override values for incoming RX controls from PCS, register #3, offset: 0xC0424 */
  uint8_t RESERVED_718[2];
  __I  uint16_t RAWLANEX_DIG_PCS_XF_RX_PCS_IN;     /**< Current values for incoming RX controls from PCS, offset: 0xC0428 */
  uint8_t RESERVED_719[2];
  __I  uint16_t RAWLANEX_DIG_PCS_XF_RX_PCS_IN_1;   /**< Current values for incoming RX controls from PCS, register #1, offset: 0xC042C */
  uint8_t RESERVED_720[2];
  __I  uint16_t RAWLANEX_DIG_PCS_XF_RX_PCS_IN_2;   /**< Current values for incoming RX controls from PCS, register #2, offset: 0xC0430 */
  uint8_t RESERVED_721[2];
  __I  uint16_t RAWLANEX_DIG_PCS_XF_RX_PCS_IN_3;   /**< Current values for incoming RX controls from PCS, register #3, offset: 0xC0434 */
  uint8_t RESERVED_722[2];
  __I  uint16_t RAWLANEX_DIG_PCS_XF_RX_PCS_IN_4;   /**< Current values for incoming RX controls from PCS, register #4, offset: 0xC0438 */
  uint8_t RESERVED_723[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT;   /**< Override values for outgoing RX controls to PCS, offset: 0xC043C */
  uint8_t RESERVED_724[2];
  __I  uint16_t RAWLANEX_DIG_PCS_XF_RX_PCS_OUT;    /**< Current values for outgoing RX status controls from Raw PCS, offset: 0xC0440 */
  uint8_t RESERVED_725[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_ADAPT_ACK;  /**< RX Adaptation Acknowledge, offset: 0xC0444 */
  uint8_t RESERVED_726[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_ADAPT_FOM;  /**< RX Adaptation Figure of Merit, offset: 0xC0448 */
  uint8_t RESERVED_727[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_TXPRE_DIR;  /**< RX calculated direction for TX-pre, offset: 0xC044C */
  uint8_t RESERVED_728[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR; /**< RX calculated direction for TX-Main, offset: 0xC0450 */
  uint8_t RESERVED_729[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR; /**< RX calculated direction for TX-Post, offset: 0xC0454 */
  uint8_t RESERVED_730[2];
  __I  uint16_t RAWLANEX_DIG_PCS_XF_LANE_NUMBER;   /**< Current lane number, offset: 0xC0458 */
  uint8_t RESERVED_731[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN; /**< Override incoming values for lane_xcvr_mode, offset: 0xC045C */
  uint8_t RESERVED_732[2];
  __I  uint16_t RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN; /**< Lane transceiver mode status, offset: 0xC0460 */
  uint8_t RESERVED_733[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN;   /**< ATE Override input to control top-level inputs, offset: 0xC0464 */
  uint8_t RESERVED_734[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN; /**< Override incoming values for rx_eq_delta_iq, offset: 0xC0468 */
  uint8_t RESERVED_735[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN; /**< Override incoming values for tx/rx_term_ctrl, offset: 0xC046C */
  uint8_t RESERVED_736[2];
  __I  uint16_t RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_IN; /**< tx/rx_term_ctrl status, offset: 0xC0470 */
  uint8_t RESERVED_737[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_1; /**< Override values for outgoing RX controls to PCS, register #1, offset: 0xC0474 */
  uint8_t RESERVED_738[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_EQ_OVRD_IN_1; /**< Override values for incoming RX EQ controls from PCS, register #1, offset: 0xC0478 */
  uint8_t RESERVED_739[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_EQ_OVRD_IN_2; /**< Override values for incoming RX EQ controls from PCS, register #2, offset: 0xC047C */
  uint8_t RESERVED_740[2];
  __IO uint16_t RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2; /**< Override value for RX VALID/DATA_EN/DATA_EN/LANE_TX2RX_SER_LB_EN/LANE_RX2TX_PAR_LB_EN signal from PCS, offset: 0xC0480 */
  uint8_t RESERVED_741[2];
  __IO uint16_t RAWLANEX_DIG_FSM_FSM_OVRD_CTL;     /**< FSM override control register, offset: 0xC0484 */
  uint8_t RESERVED_742[2];
  __I  uint16_t RAWLANEX_DIG_FSM_MEM_ADDR_MON;     /**< Memory Address Monitor, offset: 0xC0488 */
  uint8_t RESERVED_743[2];
  __I  uint16_t RAWLANEX_DIG_FSM_STATUS_MON;       /**< FSM Status Monitor, offset: 0xC048C */
  uint8_t RESERVED_744[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_STARTUP_CAL; /**< Status of Fast RX Start Up Calibration, offset: 0xC0490 */
  uint8_t RESERVED_745[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_ADAPT;    /**< Status of Fast RX Adaptation, offset: 0xC0494 */
  uint8_t RESERVED_746[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_AFE_CAL;  /**< Status of Fast RX AFE Calibration, offset: 0xC0498 */
  uint8_t RESERVED_747[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_DFE_CAL;  /**< Status of Fast RX DFE Calibration, offset: 0xC049C */
  uint8_t RESERVED_748[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_DFE_RE_ADAPT; /**< Enables fast RX DFE re -adaptation, offset: 0xC04A0 */
  uint8_t RESERVED_749[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_REFLVL_CAL; /**< Status of Fast RX Reference Level Calibration, offset: 0xC04A4 */
  uint8_t RESERVED_750[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_IQ_CAL;   /**< Status of Fast RX IQ Calibration, offset: 0xC04A8 */
  uint8_t RESERVED_751[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_AFE_ADAPT; /**< Status of Fast RX AFE Adaptation, offset: 0xC04AC */
  uint8_t RESERVED_752[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT; /**< Status of Fast RX DFE Adaptation, offset: 0xC04B0 */
  uint8_t RESERVED_753[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_SUP;         /**< Status of Fast Support block, offset: 0xC04B4 */
  uint8_t RESERVED_754[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE; /**< Status of Fast TX Common-mode Charge-up, offset: 0xC04B8 */
  uint8_t RESERVED_755[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_TX_RXDET;    /**< Status of Fast TX detect RX, offset: 0xC04BC */
  uint8_t RESERVED_756[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_PWRUP;    /**< Status of Fast RX Power-up, offset: 0xC04C0 */
  uint8_t RESERVED_757[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT; /**< Status of Fast RX VCO Wait Times, offset: 0xC04C4 */
  uint8_t RESERVED_758[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL;  /**< Status of Fast RX VCO Calibration, offset: 0xC04C8 */
  uint8_t RESERVED_759[2];
  __I  uint16_t RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS; /**< Status of MPLL common calibration initiation, offset: 0xC04CC */
  uint8_t RESERVED_760[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT; /**< Status of Fast RX Continuous Calibration/Adaptation, offset: 0xC04D0 */
  uint8_t RESERVED_761[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT; /**< Status of Fast RX Continuous Adaptation, offset: 0xC04D4 */
  uint8_t RESERVED_762[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL; /**< Status of Fast RX Continuous Data Calibration, offset: 0xC04D8 */
  uint8_t RESERVED_763[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL; /**< Status of Fast RX Continuous Phase Calibration, offset: 0xC04DC */
  uint8_t RESERVED_764[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL; /**< Status of Fast RX Continuous AFE Calibration, offset: 0xC04E0 */
  uint8_t RESERVED_765[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT; /**< Status of Fast RX IQ_ADAPT, offset: 0xC04E4 */
  uint8_t RESERVED_766[2];
  __I  uint16_t RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD;  /**< Status of RX Delta addition, offset: 0xC04E8 */
  uint8_t RESERVED_767[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT; /**< Enables fast RX ATT adaptation, offset: 0xC04EC */
  uint8_t RESERVED_768[2];
  __I  uint16_t RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT; /**< Enables fast RX CTLE adaptation, offset: 0xC04F0 */
  uint8_t RESERVED_769[2];
  __IO uint16_t RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN; /**< CR interface timing extension enable, offset: 0xC04F4 */
  uint8_t RESERVED_770[2];
  __IO uint16_t RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG; /**< TX Eq update flag, offset: 0xC04F8 */
  uint8_t RESERVED_771[2];
  __I  uint16_t RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS; /**< Status of RTUNE common calibration initiation, offset: 0xC04FC */
  uint8_t RESERVED_772[2];
  __I  uint16_t RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET; /**< Offset value for IQ Phase Calculation, offset: 0xC0500 */
  uint8_t RESERVED_773[2];
  __IO uint16_t RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST; /**< Offset value for RX AFE ATT iDAC, offset: 0xC0504 */
  uint8_t RESERVED_774[2];
  __IO uint16_t RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST; /**< Offset value for RX AFE CTLE iDAC, offset: 0xC0508 */
  uint8_t RESERVED_775[2];
  __IO uint16_t RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE; /**< Reference level for RX AFE Adaptation, offset: 0xC050C */
  uint8_t RESERVED_776[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_ADAPT_FOM;     /**< Adaptation Figure of Merit (FOM), offset: 0xC0510 */
  uint8_t RESERVED_777[2];
  __IO uint16_t RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST; /**< Offset values for RX CTLE Loopback path iDAC, offset: 0xC0514 */
  uint8_t RESERVED_778[2];
  __IO uint16_t RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST; /**< Offset values for RX DFE Phase Even vDAC, offset: 0xC0518 */
  uint8_t RESERVED_779[2];
  __IO uint16_t RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST; /**< Offset values for RX DFE Phase Odd vDAC, offset: 0xC051C */
  uint8_t RESERVED_780[2];
  __IO uint16_t RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL; /**< DFE Even reference level, offset: 0xC0520 */
  uint8_t RESERVED_781[2];
  __IO uint16_t RAWLANEX_DIG_AON_DFE_ODD_REF_LVL;  /**< DFE Odd reference level, offset: 0xC0524 */
  uint8_t RESERVED_782[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_PHSADJ_LIN;    /**< RX Phase Adjust Linear Value, offset: 0xC0528 */
  uint8_t RESERVED_783[2];
  __I  uint16_t RAWLANEX_DIG_AON_RX_PHSADJ_MAP;    /**< RX Phase Adjust Mapped Value, offset: 0xC052C */
  uint8_t RESERVED_784[2];
  __IO uint16_t RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST; /**< Offset values for RX DFE Data Even High vDAC, offset: 0xC0530 */
  uint8_t RESERVED_785[2];
  __IO uint16_t RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL; /**< Custom tx_iboost_lvl values for lfps and ss modes, offset: 0xC0534 */
  uint8_t RESERVED_786[2];
  __IO uint16_t RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST; /**< Offset values for RX DFE Data Odd High vDAC, offset: 0xC0538 */
  uint8_t RESERVED_787[2];
  __IO uint16_t RAWLANEX_DIG_AON_DFE_DATA_ODD_LOW_VDAC_OFST; /**< Offset values for RX DFE Data Odd Low vDAC, offset: 0xC053C */
  uint8_t RESERVED_788[2];
  __IO uint16_t RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST; /**< Offset values for RX DFE By-Pass Even vDAC, offset: 0xC0540 */
  uint8_t RESERVED_789[2];
  __IO uint16_t RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST; /**< Offset values for RX DFE By-Pass Odd vDAC, offset: 0xC0544 */
  uint8_t RESERVED_790[2];
  __IO uint16_t RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST; /**< Offset values for RX DFE Error Even vDAC, offset: 0xC0548 */
  uint8_t RESERVED_791[2];
  __IO uint16_t RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST; /**< Offset values for RX DFE Error Odd vDAC, offset: 0xC054C */
  uint8_t RESERVED_792[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST; /**< Value for RX IQ PHASE Adjust, offset: 0xC0550 */
  uint8_t RESERVED_793[2];
  __IO uint16_t RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE; /**< MPLLA_COARSE_TUNE, offset: 0xC0554 */
  uint8_t RESERVED_794[2];
  __IO uint16_t RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE; /**< MPLLB_COARSE_TUNE, offset: 0xC0558 */
  uint8_t RESERVED_795[2];
  __IO uint16_t RAWLANEX_DIG_AON_INIT_PWRUP_DONE;  /**< Initial Power-Up Done Status, offset: 0xC055C */
  uint8_t RESERVED_796[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_ADPT_ATT;      /**< RX Adapted value of ATT, offset: 0xC0560 */
  uint8_t RESERVED_797[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_ADPT_VGA;      /**< RX Adapted value of VGA, offset: 0xC0564 */
  uint8_t RESERVED_798[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_ADPT_CTLE;     /**< RX Adapted value of CTLE, offset: 0xC0568 */
  uint8_t RESERVED_799[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1; /**< RX Adapted value of DFE TAP1, offset: 0xC056C */
  uint8_t RESERVED_800[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_ADAPT_DONE;    /**< RX Adaptation Done Status, offset: 0xC0570 */
  uint8_t RESERVED_801[2];
  __IO uint16_t RAWLANEX_DIG_AON_FAST_FLAGS;       /**< Fast flags for simulation only, offset: 0xC0574 */
  uint8_t RESERVED_802[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2; /**< RX Adapted value of DFE TAP2, offset: 0xC0578 */
  uint8_t RESERVED_803[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT; /**< RX last stable iq phase of Right of the eye, offset: 0xC057C */
  uint8_t RESERVED_804[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT; /**< RX last stable iq phase of Left of the eye, offset: 0xC0580 */
  uint8_t RESERVED_805[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT; /**< RX Adapted value of PHASE IQ, offset: 0xC0584 */
  uint8_t RESERVED_806[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN; /**< Sets values for RX SLICER CTRL EVEN signals going to ANA, offset: 0xC0588 */
  uint8_t RESERVED_807[2];
  __IO uint16_t RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD; /**< Sets values for RX SLICER CTRL ODD signals going to ANA, offset: 0xC058C */
  uint8_t RESERVED_808[2];
  __IO uint16_t RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS; /**< MPLL Common Calibration Status, offset: 0xC0590 */
  uint8_t RESERVED_809[2];
  __IO uint16_t RAWLANEX_DIG_AON_ADPT_CTL_0;       /**< Adaptation Control register #0, offset: 0xC0594 */
  uint8_t RESERVED_810[2];
