zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
  __IO uint16_t RAWLANEX_DIG_AON_ADPT_CTL_1;       /**< Adaptation Control register #1, offset: 0xC0598 */
  uint8_t RESERVED_811[2];
  __IO uint16_t RAWLANEX_DIG_AON_ADPT_CTL_2;       /**< Adaptation Control register #2, offset: 0xC059C */
  uint8_t RESERVED_812[2];
  __IO uint16_t RAWLANEX_DIG_AON_ADPT_CTL_3;       /**< Adaptation Control register #3, offset: 0xC05A0 */
  uint8_t RESERVED_813[2];
  __IO uint16_t RAWLANEX_DIG_AON_ADPT_CTL_4;       /**< Adaptation Control register #4, offset: 0xC05A4 */
  uint8_t RESERVED_814[2];
  __IO uint16_t RAWLANEX_DIG_AON_ADPT_CTL_5;       /**< Adaptation Control register #5, offset: 0xC05A8 */
  uint8_t RESERVED_815[2];
  __IO uint16_t RAWLANEX_DIG_AON_ADPT_CTL_6;       /**< Adaptation Control register #6, offset: 0xC05AC */
  uint8_t RESERVED_816[2];
  __IO uint16_t RAWLANEX_DIG_AON_ADPT_CTL_7;       /**< Adaptation Control register #7, offset: 0xC05B0 */
  uint8_t RESERVED_817[2];
  __IO uint16_t RAWLANEX_DIG_AON_MPLL_DISABLE;     /**< LANE_MPLLA/B_DISABLE override, offset: 0xC05B4 */
  uint8_t RESERVED_818[2];
  __IO uint16_t RAWLANEX_DIG_AON_FAST_FLAGS_2;     /**< Fast flags for simulation only, offset: 0xC05B8 */
  uint8_t RESERVED_819[2];
  __IO uint16_t RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS; /**< RTUNE Common Calibration Status, offset: 0xC05BC */
  uint8_t RESERVED_820[2];
  __IO uint16_t RAWLANEX_DIG_AON_TXRX_OVRD_IN;     /**< Override values for incoming AON TX/RX controls from PCS, offset: 0xC05C0 */
  uint8_t RESERVED_821[2];
  __IO uint16_t RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST; /**< Offset value for RX AFE ATT_2 iDAC, offset: 0xC05C4 */
  uint8_t RESERVED_822[2];
  __IO uint16_t RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN;  /**< Override incoming values for rxtx_cc, offset: 0xC05C8 */
  uint8_t RESERVED_823[2];
  __I  uint16_t RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN; /**< Incoming value of CC status from TCA, offset: 0xC05CC */
  uint8_t RESERVED_824[2];
  __I  uint16_t RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT; /**< Current values for outgoing CC status to PMA, offset: 0xC05D0 */
  uint8_t RESERVED_825[2];
  __IO uint16_t RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ; /**< Reset routine request, offset: 0xC05D4 */
  uint8_t RESERVED_826[2];
  __I  uint16_t RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ; /**< Rx reset interrupt, offset: 0xC05D8 */
  uint8_t RESERVED_827[2];
  __I  uint16_t RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ;   /**< Rx request interrupt, offset: 0xC05DC */
  uint8_t RESERVED_828[2];
  __I  uint16_t RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ;  /**< Rx rate change interrupt request, offset: 0xC05E0 */
  uint8_t RESERVED_829[2];
  __I  uint16_t RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ; /**< Rx pstate change interrupt request, offset: 0xC05E4 */
  uint8_t RESERVED_830[2];
  __I  uint16_t RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ; /**< Rx adaptation request interrupt, offset: 0xC05E8 */
  uint8_t RESERVED_831[2];
  __I  uint16_t RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ; /**< Rx adaptation disable interrupt, offset: 0xC05EC */
  uint8_t RESERVED_832[2];
  __IO uint16_t RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR; /**< RX reset interrupt clear, offset: 0xC05F0 */
  uint8_t RESERVED_833[2];
  __IO uint16_t RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR; /**< RX request interrupt clear, offset: 0xC05F4 */
  uint8_t RESERVED_834[2];
  __IO uint16_t RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR; /**< RX rate change interrupt clear, offset: 0xC05F8 */
  uint8_t RESERVED_835[2];
  __IO uint16_t RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR; /**< RX pstate change interrupt clear, offset: 0xC05FC */
  uint8_t RESERVED_836[2];
  __IO uint16_t RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR; /**< RX adaptation request interrupt clear, offset: 0xC0600 */
  uint8_t RESERVED_837[2];
  __IO uint16_t RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR; /**< RX adaptation disable interrupt clear, offset: 0xC0604 */
  uint8_t RESERVED_838[2];
  __IO uint16_t RAWLANEX_DIG_IRQ_CTL_IRQ_MASK;     /**< Interrupt Mask, offset: 0xC0608 */
  uint8_t RESERVED_839[2];
  __I  uint16_t RAWLANEX_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ; /**< Lane transceiver mode interrupt, offset: 0xC060C */
  uint8_t RESERVED_840[2];
  __IO uint16_t RAWLANEX_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR; /**< Lane transceiver mode interrupt clear, offset: 0xC0610 */
  uint8_t RESERVED_841[2];
  __IO uint16_t RAWLANEX_DIG_PMA_XF_LANE_OVRD_IN;  /**< Override values for incoming LANE controls, offset: 0xC0614 */
  uint8_t RESERVED_842[2];
  __IO uint16_t RAWLANEX_DIG_PMA_XF_LANE_OVRD_OUT; /**< Override values for outgoing LANE controls, offset: 0xC0618 */
  uint8_t RESERVED_843[2];
  __IO uint16_t RAWLANEX_DIG_PMA_XF_SUP_OVRD_IN;   /**< Override values for incoming SUP controls from PMA, offset: 0xC061C */
  uint8_t RESERVED_844[2];
  __I  uint16_t RAWLANEX_DIG_PMA_XF_SUP_PMA_IN;    /**< Current values for incoming MPLL status controls from PMA, offset: 0xC0620 */
  uint8_t RESERVED_845[2];
  __IO uint16_t RAWLANEX_DIG_PMA_XF_TX_OVRD_OUT;   /**< Override values for outgoing TX controls to PMA, offset: 0xC0624 */
  uint8_t RESERVED_846[2];
  __I  uint16_t RAWLANEX_DIG_PMA_XF_TX_PMA_IN;     /**< Current values for coming TX status controls from PMA, offset: 0xC0628 */
  uint8_t RESERVED_847[2];
  __IO uint16_t RAWLANEX_DIG_PMA_XF_RX_OVRD_OUT;   /**< Override values for outgoing RX controls to PMA, offset: 0xC062C */
  uint8_t RESERVED_848[2];
  __I  uint16_t RAWLANEX_DIG_PMA_XF_RX_PMA_IN;     /**< Current values for coming RX status controls from PMA, offset: 0xC0630 */
  uint8_t RESERVED_849[2];
  __IO uint16_t RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL; /**< Lane Rtune Controls, offset: 0xC0634 */
  uint8_t RESERVED_850[2];
  __I  uint16_t RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1;  /**< Current values for incoming RTUNE status controls from PMA, offset: 0xC0638 */
  uint8_t RESERVED_851[2];
  __I  uint16_t RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID; /**< Current value of RX valid from PMA, offset: 0xC063C */
  uint8_t RESERVED_852[2];
  __IO uint16_t RAWLANEX_DIG_TX_CTL_TX_FSM_CTL;    /**< TX FSM Control, offset: 0xC0640 */
  uint8_t RESERVED_853[2];
  __IO uint16_t RAWLANEX_DIG_TX_CTL_TX_CLK_CTL;    /**< Select clock to act as TX input clock, offset: 0xC0644 */
  uint8_t RESERVED_854[2];
  __IO uint16_t RAWLANEX_DIG_RX_CTL_RX_FSM_CTL;    /**< RX FSM control register, offset: 0xC0648 */
  uint8_t RESERVED_855[2];
  __IO uint16_t RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL; /**< RX LOS Mask Control, offset: 0xC064C */
  uint8_t RESERVED_856[2];
  __IO uint16_t RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL; /**< RX Data Enable Override Control, offset: 0xC0650 */
  uint8_t RESERVED_857[2];
  __I  uint16_t RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS; /**< RX continuous offset cancellation status, offset: 0xC0654 */
  uint8_t RESERVED_858[2];
  __I  uint16_t RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS; /**< RX continuous adaptation status, offset: 0xC0658 */
} X2_Type, *X2_MemMapPtr;

/** Number of instances of the X2 module. */
#define X2_INSTANCE_COUNT                        (1u)

/* X2 - Peripheral instance base addresses */
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__X2 base address */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__X2_BASE (0xC00000u)
/** Peripheral NETC_ENET_PHY_PHY_CTRL_EX_LOCK__X2 base pointer */
#define IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__X2    ((X2_Type *)IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__X2_BASE)
/** Array initializer of X2 peripheral base addresses */
#define IP_X2_BASE_ADDRS                         { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__X2_BASE }
/** Array initializer of X2 peripheral base pointers */
#define IP_X2_BASE_PTRS                          { IP_NETC_ENET_PHY_PHY_CTRL_EX_LOCK__X2 }

/* ----------------------------------------------------------------------------
   -- X2 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup X2_Register_Masks X2 Register Masks
 * @{
 */

/*! @name SUP_DIG_IDCODE_LO - Low 16 bits of IDCODE */
/*! @{ */

#define X2_SUP_DIG_IDCODE_LO_data_MASK           (0xFFFFU)
#define X2_SUP_DIG_IDCODE_LO_data_SHIFT          (0U)
#define X2_SUP_DIG_IDCODE_LO_data_WIDTH          (16U)
#define X2_SUP_DIG_IDCODE_LO_data(x)             (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_IDCODE_LO_data_SHIFT)) & X2_SUP_DIG_IDCODE_LO_data_MASK)
/*! @} */

/*! @name SUP_DIG_IDCODE_HI - High 16 bits of IDCODE */
/*! @{ */

#define X2_SUP_DIG_IDCODE_HI_data_MASK           (0xFFFFU)
#define X2_SUP_DIG_IDCODE_HI_data_SHIFT          (0U)
#define X2_SUP_DIG_IDCODE_HI_data_WIDTH          (16U)
#define X2_SUP_DIG_IDCODE_HI_data(x)             (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_IDCODE_HI_data_SHIFT)) & X2_SUP_DIG_IDCODE_HI_data_MASK)
/*! @} */

/*! @name SUP_DIG_REFCLK_OVRD_IN - Override values for incoming REFCLK and RESET controls from ASIC */
/*! @{ */

