zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_EN_MASK (0x1U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_EN_SHIFT (0U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_EN(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_EN_SHIFT)) & X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_EN_MASK)

#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_EN_OVRD_EN_MASK (0x2U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_EN_OVRD_EN_SHIFT (1U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_EN_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_EN_OVRD_EN_SHIFT)) & X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_EN_OVRD_EN_MASK)

#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_MASK (0x4U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_SHIFT (2U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_WIDTH (1U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_SHIFT)) & X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_MASK)

#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_OVRD_EN_MASK (0x8U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_OVRD_EN_SHIFT (3U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_OVRD_EN_SHIFT)) & X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_OVRD_EN_MASK)

#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_USE_PAD_MASK (0x10U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_USE_PAD_SHIFT (4U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_USE_PAD_WIDTH (1U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_USE_PAD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_REFCLK_OVRD_IN_REF_USE_PAD_SHIFT)) & X2_SUP_DIG_REFCLK_OVRD_IN_REF_USE_PAD_MASK)

#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_USE_PAD_OVRD_EN_MASK (0x20U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_USE_PAD_OVRD_EN_SHIFT (5U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_USE_PAD_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_USE_PAD_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_REFCLK_OVRD_IN_REF_USE_PAD_OVRD_EN_SHIFT)) & X2_SUP_DIG_REFCLK_OVRD_IN_REF_USE_PAD_OVRD_EN_MASK)

#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_MASK (0x40U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_SHIFT (6U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_SHIFT)) & X2_SUP_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_MASK)

#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_OVRD_EN_MASK (0x80U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_OVRD_EN_SHIFT (7U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_OVRD_EN_SHIFT)) & X2_SUP_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_OVRD_EN_MASK)

#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_MASK (0x700U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_SHIFT (8U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_WIDTH (3U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_SHIFT)) & X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_MASK)

#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_OVRD_EN_MASK (0x800U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_OVRD_EN_SHIFT (11U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_OVRD_EN_SHIFT)) & X2_SUP_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_OVRD_EN_MASK)

#define X2_SUP_DIG_REFCLK_OVRD_IN_BG_EN_MASK     (0x1000U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_BG_EN_SHIFT    (12U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_BG_EN_WIDTH    (1U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_BG_EN(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_REFCLK_OVRD_IN_BG_EN_SHIFT)) & X2_SUP_DIG_REFCLK_OVRD_IN_BG_EN_MASK)

#define X2_SUP_DIG_REFCLK_OVRD_IN_BG_EN_OVRD_EN_MASK (0x2000U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_BG_EN_OVRD_EN_SHIFT (13U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_BG_EN_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_BG_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_REFCLK_OVRD_IN_BG_EN_OVRD_EN_SHIFT)) & X2_SUP_DIG_REFCLK_OVRD_IN_BG_EN_OVRD_EN_MASK)

#define X2_SUP_DIG_REFCLK_OVRD_IN_RESERVED_15_14_MASK (0xC000U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_RESERVED_15_14_SHIFT (14U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_RESERVED_15_14_WIDTH (2U)
#define X2_SUP_DIG_REFCLK_OVRD_IN_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_REFCLK_OVRD_IN_RESERVED_15_14_SHIFT)) & X2_SUP_DIG_REFCLK_OVRD_IN_RESERVED_15_14_MASK)
/*! @} */

/*! @name SUP_DIG_SUP_OVRD_IN - Override values for support block ASIC inputs */
/*! @{ */

#define X2_SUP_DIG_SUP_OVRD_IN_RTUNE_REQ_MASK    (0x1U)
#define X2_SUP_DIG_SUP_OVRD_IN_RTUNE_REQ_SHIFT   (0U)
#define X2_SUP_DIG_SUP_OVRD_IN_RTUNE_REQ_WIDTH   (1U)
#define X2_SUP_DIG_SUP_OVRD_IN_RTUNE_REQ(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_IN_RTUNE_REQ_SHIFT)) & X2_SUP_DIG_SUP_OVRD_IN_RTUNE_REQ_MASK)

#define X2_SUP_DIG_SUP_OVRD_IN_RTUNE_OVRD_EN_MASK (0x2U)
#define X2_SUP_DIG_SUP_OVRD_IN_RTUNE_OVRD_EN_SHIFT (1U)
#define X2_SUP_DIG_SUP_OVRD_IN_RTUNE_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_IN_RTUNE_OVRD_EN(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_IN_RTUNE_OVRD_EN_SHIFT)) & X2_SUP_DIG_SUP_OVRD_IN_RTUNE_OVRD_EN_MASK)

#define X2_SUP_DIG_SUP_OVRD_IN_RES_REQ_IN_MASK   (0x4U)
#define X2_SUP_DIG_SUP_OVRD_IN_RES_REQ_IN_SHIFT  (2U)
#define X2_SUP_DIG_SUP_OVRD_IN_RES_REQ_IN_WIDTH  (1U)
#define X2_SUP_DIG_SUP_OVRD_IN_RES_REQ_IN(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_IN_RES_REQ_IN_SHIFT)) & X2_SUP_DIG_SUP_OVRD_IN_RES_REQ_IN_MASK)

#define X2_SUP_DIG_SUP_OVRD_IN_RES_ACK_IN_MASK   (0x8U)
#define X2_SUP_DIG_SUP_OVRD_IN_RES_ACK_IN_SHIFT  (3U)
#define X2_SUP_DIG_SUP_OVRD_IN_RES_ACK_IN_WIDTH  (1U)
#define X2_SUP_DIG_SUP_OVRD_IN_RES_ACK_IN(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_IN_RES_ACK_IN_SHIFT)) & X2_SUP_DIG_SUP_OVRD_IN_RES_ACK_IN_MASK)

#define X2_SUP_DIG_SUP_OVRD_IN_RES_OVRD_EN_MASK  (0x10U)
#define X2_SUP_DIG_SUP_OVRD_IN_RES_OVRD_EN_SHIFT (4U)
#define X2_SUP_DIG_SUP_OVRD_IN_RES_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_IN_RES_OVRD_EN(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_IN_RES_OVRD_EN_SHIFT)) & X2_SUP_DIG_SUP_OVRD_IN_RES_OVRD_EN_MASK)

#define X2_SUP_DIG_SUP_OVRD_IN_RESERVED_15_5_MASK (0xFFE0U)
#define X2_SUP_DIG_SUP_OVRD_IN_RESERVED_15_5_SHIFT (5U)
#define X2_SUP_DIG_SUP_OVRD_IN_RESERVED_15_5_WIDTH (11U)
#define X2_SUP_DIG_SUP_OVRD_IN_RESERVED_15_5(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_IN_RESERVED_15_5_SHIFT)) & X2_SUP_DIG_SUP_OVRD_IN_RESERVED_15_5_MASK)
/*! @} */

