zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name SUP_DIG_SUP_OVRD_OUT - Override values for support block ASIC outputs */
/*! @{ */

#define X2_SUP_DIG_SUP_OVRD_OUT_RTUNE_ACK_MASK   (0x1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RTUNE_ACK_SHIFT  (0U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RTUNE_ACK_WIDTH  (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RTUNE_ACK(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_RTUNE_ACK_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_RTUNE_ACK_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_RTUNE_ACK_OVRD_EN_MASK (0x2U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RTUNE_ACK_OVRD_EN_SHIFT (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RTUNE_ACK_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RTUNE_ACK_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_RTUNE_ACK_OVRD_EN_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_RTUNE_ACK_OVRD_EN_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_RES_REQ_OUT_MASK (0x4U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RES_REQ_OUT_SHIFT (2U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RES_REQ_OUT_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RES_REQ_OUT(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_RES_REQ_OUT_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_RES_REQ_OUT_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_RES_REQ_OUT_OVRD_EN_MASK (0x8U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RES_REQ_OUT_OVRD_EN_SHIFT (3U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RES_REQ_OUT_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RES_REQ_OUT_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_RES_REQ_OUT_OVRD_EN_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_RES_REQ_OUT_OVRD_EN_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_RES_ACK_OUT_MASK (0x10U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RES_ACK_OUT_SHIFT (4U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RES_ACK_OUT_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RES_ACK_OUT(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_RES_ACK_OUT_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_RES_ACK_OUT_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_RES_ACK_OUT_OVRD_EN_MASK (0x20U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RES_ACK_OUT_OVRD_EN_SHIFT (5U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RES_ACK_OUT_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RES_ACK_OUT_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_RES_ACK_OUT_OVRD_EN_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_RES_ACK_OUT_OVRD_EN_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLA_STATE_MASK (0x40U)
#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLA_STATE_SHIFT (6U)
#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLA_STATE_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLA_STATE(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_MPLLA_STATE_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_MPLLA_STATE_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLA_STATE_OVRD_EN_MASK (0x80U)
#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLA_STATE_OVRD_EN_SHIFT (7U)
#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLA_STATE_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLA_STATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_MPLLA_STATE_OVRD_EN_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_MPLLA_STATE_OVRD_EN_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLB_STATE_MASK (0x100U)
#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLB_STATE_SHIFT (8U)
#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLB_STATE_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLB_STATE(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_MPLLB_STATE_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_MPLLB_STATE_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLB_STATE_OVRD_EN_MASK (0x200U)
#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLB_STATE_OVRD_EN_SHIFT (9U)
#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLB_STATE_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_MPLLB_STATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_MPLLB_STATE_OVRD_EN_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_MPLLB_STATE_OVRD_EN_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_BG_LANE_STATE_MASK (0x400U)
#define X2_SUP_DIG_SUP_OVRD_OUT_BG_LANE_STATE_SHIFT (10U)
#define X2_SUP_DIG_SUP_OVRD_OUT_BG_LANE_STATE_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_BG_LANE_STATE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_BG_LANE_STATE_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_BG_LANE_STATE_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_BG_LANE_STATE_OVRD_EN_MASK (0x800U)
#define X2_SUP_DIG_SUP_OVRD_OUT_BG_LANE_STATE_OVRD_EN_SHIFT (11U)
#define X2_SUP_DIG_SUP_OVRD_OUT_BG_LANE_STATE_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_BG_LANE_STATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_BG_LANE_STATE_OVRD_EN_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_BG_LANE_STATE_OVRD_EN_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_BG_SUP_STATE_MASK (0x1000U)
#define X2_SUP_DIG_SUP_OVRD_OUT_BG_SUP_STATE_SHIFT (12U)
#define X2_SUP_DIG_SUP_OVRD_OUT_BG_SUP_STATE_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_BG_SUP_STATE(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_BG_SUP_STATE_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_BG_SUP_STATE_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_BG_SUP_STATE_OVRD_EN_MASK (0x2000U)
#define X2_SUP_DIG_SUP_OVRD_OUT_BG_SUP_STATE_OVRD_EN_SHIFT (13U)
#define X2_SUP_DIG_SUP_OVRD_OUT_BG_SUP_STATE_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_SUP_OVRD_OUT_BG_SUP_STATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_BG_SUP_STATE_OVRD_EN_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_BG_SUP_STATE_OVRD_EN_MASK)

#define X2_SUP_DIG_SUP_OVRD_OUT_RESERVED_15_14_MASK (0xC000U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RESERVED_15_14_SHIFT (14U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RESERVED_15_14_WIDTH (2U)
#define X2_SUP_DIG_SUP_OVRD_OUT_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_SUP_OVRD_OUT_RESERVED_15_14_SHIFT)) & X2_SUP_DIG_SUP_OVRD_OUT_RESERVED_15_14_MASK)
/*! @} */

/*! @name SUP_DIG_LVL_OVRD_IN - Override values for level settings */
/*! @{ */

#define X2_SUP_DIG_LVL_OVRD_IN_RX_VREF_CTRL_MASK (0x1FU)
#define X2_SUP_DIG_LVL_OVRD_IN_RX_VREF_CTRL_SHIFT (0U)
#define X2_SUP_DIG_LVL_OVRD_IN_RX_VREF_CTRL_WIDTH (5U)
#define X2_SUP_DIG_LVL_OVRD_IN_RX_VREF_CTRL(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_LVL_OVRD_IN_RX_VREF_CTRL_SHIFT)) & X2_SUP_DIG_LVL_OVRD_IN_RX_VREF_CTRL_MASK)

#define X2_SUP_DIG_LVL_OVRD_IN_RX_VREF_CTRL_EN_MASK (0x20U)
#define X2_SUP_DIG_LVL_OVRD_IN_RX_VREF_CTRL_EN_SHIFT (5U)
#define X2_SUP_DIG_LVL_OVRD_IN_RX_VREF_CTRL_EN_WIDTH (1U)
#define X2_SUP_DIG_LVL_OVRD_IN_RX_VREF_CTRL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_LVL_OVRD_IN_RX_VREF_CTRL_EN_SHIFT)) & X2_SUP_DIG_LVL_OVRD_IN_RX_VREF_CTRL_EN_MASK)

#define X2_SUP_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_MASK (0x1C0U)
#define X2_SUP_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_SHIFT (6U)
#define X2_SUP_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_WIDTH (3U)
#define X2_SUP_DIG_LVL_OVRD_IN_TX_VBOOST_LVL(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_SHIFT)) & X2_SUP_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_MASK)

#define X2_SUP_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_EN_MASK (0x200U)
#define X2_SUP_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_EN_SHIFT (9U)
#define X2_SUP_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_EN_WIDTH (1U)
#define X2_SUP_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_EN_SHIFT)) & X2_SUP_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_EN_MASK)

#define X2_SUP_DIG_LVL_OVRD_IN_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUP_DIG_LVL_OVRD_IN_RESERVED_15_10_SHIFT (10U)
#define X2_SUP_DIG_LVL_OVRD_IN_RESERVED_15_10_WIDTH (6U)
#define X2_SUP_DIG_LVL_OVRD_IN_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_LVL_OVRD_IN_RESERVED_15_10_SHIFT)) & X2_SUP_DIG_LVL_OVRD_IN_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUP_DIG_DEBUG - Debug controls */
/*! @{ */

#define X2_SUP_DIG_DEBUG_DTB_SEL_MASK            (0x7U)
#define X2_SUP_DIG_DEBUG_DTB_SEL_SHIFT           (0U)
#define X2_SUP_DIG_DEBUG_DTB_SEL_WIDTH           (3U)
#define X2_SUP_DIG_DEBUG_DTB_SEL(x)              (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_DEBUG_DTB_SEL_SHIFT)) & X2_SUP_DIG_DEBUG_DTB_SEL_MASK)

#define X2_SUP_DIG_DEBUG_RESERVED_15_3_MASK      (0xFFF8U)
#define X2_SUP_DIG_DEBUG_RESERVED_15_3_SHIFT     (3U)
#define X2_SUP_DIG_DEBUG_RESERVED_15_3_WIDTH     (13U)
#define X2_SUP_DIG_DEBUG_RESERVED_15_3(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_DEBUG_RESERVED_15_3_SHIFT)) & X2_SUP_DIG_DEBUG_RESERVED_15_3_MASK)
/*! @} */

/*! @name SUP_DIG_ASIC_IN - Current values for incoming SUP control signals from ASIC */
/*! @{ */

#define X2_SUP_DIG_ASIC_IN_PHY_RESET_MASK        (0x1U)
#define X2_SUP_DIG_ASIC_IN_PHY_RESET_SHIFT       (0U)
#define X2_SUP_DIG_ASIC_IN_PHY_RESET_WIDTH       (1U)
#define X2_SUP_DIG_ASIC_IN_PHY_RESET(x)          (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_PHY_RESET_SHIFT)) & X2_SUP_DIG_ASIC_IN_PHY_RESET_MASK)

#define X2_SUP_DIG_ASIC_IN_REF_CLK_EN_MASK       (0x2U)
#define X2_SUP_DIG_ASIC_IN_REF_CLK_EN_SHIFT      (1U)
#define X2_SUP_DIG_ASIC_IN_REF_CLK_EN_WIDTH      (1U)
#define X2_SUP_DIG_ASIC_IN_REF_CLK_EN(x)         (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_REF_CLK_EN_SHIFT)) & X2_SUP_DIG_ASIC_IN_REF_CLK_EN_MASK)

#define X2_SUP_DIG_ASIC_IN_REF_CLK_DIV2_EN_MASK  (0x4U)
#define X2_SUP_DIG_ASIC_IN_REF_CLK_DIV2_EN_SHIFT (2U)
#define X2_SUP_DIG_ASIC_IN_REF_CLK_DIV2_EN_WIDTH (1U)
#define X2_SUP_DIG_ASIC_IN_REF_CLK_DIV2_EN(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_REF_CLK_DIV2_EN_SHIFT)) & X2_SUP_DIG_ASIC_IN_REF_CLK_DIV2_EN_MASK)

#define X2_SUP_DIG_ASIC_IN_REF_REPEAT_CLK_EN_MASK (0x8U)
#define X2_SUP_DIG_ASIC_IN_REF_REPEAT_CLK_EN_SHIFT (3U)
#define X2_SUP_DIG_ASIC_IN_REF_REPEAT_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_ASIC_IN_REF_REPEAT_CLK_EN(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_REF_REPEAT_CLK_EN_SHIFT)) & X2_SUP_DIG_ASIC_IN_REF_REPEAT_CLK_EN_MASK)

#define X2_SUP_DIG_ASIC_IN_REF_USE_PAD_MASK      (0x10U)
#define X2_SUP_DIG_ASIC_IN_REF_USE_PAD_SHIFT     (4U)
#define X2_SUP_DIG_ASIC_IN_REF_USE_PAD_WIDTH     (1U)
#define X2_SUP_DIG_ASIC_IN_REF_USE_PAD(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_REF_USE_PAD_SHIFT)) & X2_SUP_DIG_ASIC_IN_REF_USE_PAD_MASK)

#define X2_SUP_DIG_ASIC_IN_TEST_BURNIN_MASK      (0x20U)
#define X2_SUP_DIG_ASIC_IN_TEST_BURNIN_SHIFT     (5U)
#define X2_SUP_DIG_ASIC_IN_TEST_BURNIN_WIDTH     (1U)
#define X2_SUP_DIG_ASIC_IN_TEST_BURNIN(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_TEST_BURNIN_SHIFT)) & X2_SUP_DIG_ASIC_IN_TEST_BURNIN_MASK)

#define X2_SUP_DIG_ASIC_IN_TEST_POWERDOWN_MASK   (0x40U)
#define X2_SUP_DIG_ASIC_IN_TEST_POWERDOWN_SHIFT  (6U)
#define X2_SUP_DIG_ASIC_IN_TEST_POWERDOWN_WIDTH  (1U)
#define X2_SUP_DIG_ASIC_IN_TEST_POWERDOWN(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_TEST_POWERDOWN_SHIFT)) & X2_SUP_DIG_ASIC_IN_TEST_POWERDOWN_MASK)

#define X2_SUP_DIG_ASIC_IN_RTUNE_REQ_MASK        (0x80U)
#define X2_SUP_DIG_ASIC_IN_RTUNE_REQ_SHIFT       (7U)
#define X2_SUP_DIG_ASIC_IN_RTUNE_REQ_WIDTH       (1U)
#define X2_SUP_DIG_ASIC_IN_RTUNE_REQ(x)          (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_RTUNE_REQ_SHIFT)) & X2_SUP_DIG_ASIC_IN_RTUNE_REQ_MASK)

#define X2_SUP_DIG_ASIC_IN_RTUNE_ACK_MASK        (0x100U)
#define X2_SUP_DIG_ASIC_IN_RTUNE_ACK_SHIFT       (8U)
#define X2_SUP_DIG_ASIC_IN_RTUNE_ACK_WIDTH       (1U)
#define X2_SUP_DIG_ASIC_IN_RTUNE_ACK(x)          (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_RTUNE_ACK_SHIFT)) & X2_SUP_DIG_ASIC_IN_RTUNE_ACK_MASK)

#define X2_SUP_DIG_ASIC_IN_RES_REQ_IN_MASK       (0x200U)
#define X2_SUP_DIG_ASIC_IN_RES_REQ_IN_SHIFT      (9U)
#define X2_SUP_DIG_ASIC_IN_RES_REQ_IN_WIDTH      (1U)
#define X2_SUP_DIG_ASIC_IN_RES_REQ_IN(x)         (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_RES_REQ_IN_SHIFT)) & X2_SUP_DIG_ASIC_IN_RES_REQ_IN_MASK)

#define X2_SUP_DIG_ASIC_IN_RES_REQ_OUT_MASK      (0x400U)
#define X2_SUP_DIG_ASIC_IN_RES_REQ_OUT_SHIFT     (10U)
#define X2_SUP_DIG_ASIC_IN_RES_REQ_OUT_WIDTH     (1U)
#define X2_SUP_DIG_ASIC_IN_RES_REQ_OUT(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_RES_REQ_OUT_SHIFT)) & X2_SUP_DIG_ASIC_IN_RES_REQ_OUT_MASK)

#define X2_SUP_DIG_ASIC_IN_RES_ACK_IN_MASK       (0x800U)
#define X2_SUP_DIG_ASIC_IN_RES_ACK_IN_SHIFT      (11U)
#define X2_SUP_DIG_ASIC_IN_RES_ACK_IN_WIDTH      (1U)
#define X2_SUP_DIG_ASIC_IN_RES_ACK_IN(x)         (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_RES_ACK_IN_SHIFT)) & X2_SUP_DIG_ASIC_IN_RES_ACK_IN_MASK)

#define X2_SUP_DIG_ASIC_IN_RES_ACK_OUT_MASK      (0x1000U)
#define X2_SUP_DIG_ASIC_IN_RES_ACK_OUT_SHIFT     (12U)
#define X2_SUP_DIG_ASIC_IN_RES_ACK_OUT_WIDTH     (1U)
#define X2_SUP_DIG_ASIC_IN_RES_ACK_OUT(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_RES_ACK_OUT_SHIFT)) & X2_SUP_DIG_ASIC_IN_RES_ACK_OUT_MASK)

#define X2_SUP_DIG_ASIC_IN_MPLLA_STATE_MASK      (0x2000U)
#define X2_SUP_DIG_ASIC_IN_MPLLA_STATE_SHIFT     (13U)
#define X2_SUP_DIG_ASIC_IN_MPLLA_STATE_WIDTH     (1U)
#define X2_SUP_DIG_ASIC_IN_MPLLA_STATE(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_MPLLA_STATE_SHIFT)) & X2_SUP_DIG_ASIC_IN_MPLLA_STATE_MASK)

