zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUP_DIG_ASIC_IN_MPLLB_STATE_MASK      (0x4000U)
#define X2_SUP_DIG_ASIC_IN_MPLLB_STATE_SHIFT     (14U)
#define X2_SUP_DIG_ASIC_IN_MPLLB_STATE_WIDTH     (1U)
#define X2_SUP_DIG_ASIC_IN_MPLLB_STATE(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_MPLLB_STATE_SHIFT)) & X2_SUP_DIG_ASIC_IN_MPLLB_STATE_MASK)

#define X2_SUP_DIG_ASIC_IN_TEST_TX_REF_CLK_EN_MASK (0x8000U)
#define X2_SUP_DIG_ASIC_IN_TEST_TX_REF_CLK_EN_SHIFT (15U)
#define X2_SUP_DIG_ASIC_IN_TEST_TX_REF_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_ASIC_IN_TEST_TX_REF_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ASIC_IN_TEST_TX_REF_CLK_EN_SHIFT)) & X2_SUP_DIG_ASIC_IN_TEST_TX_REF_CLK_EN_MASK)
/*! @} */

/*! @name SUP_DIG_LVL_ASIC_IN - Current values for incoming level controls from ASIC */
/*! @{ */

#define X2_SUP_DIG_LVL_ASIC_IN_RX_VREF_CTRL_MASK (0x1FU)
#define X2_SUP_DIG_LVL_ASIC_IN_RX_VREF_CTRL_SHIFT (0U)
#define X2_SUP_DIG_LVL_ASIC_IN_RX_VREF_CTRL_WIDTH (5U)
#define X2_SUP_DIG_LVL_ASIC_IN_RX_VREF_CTRL(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_LVL_ASIC_IN_RX_VREF_CTRL_SHIFT)) & X2_SUP_DIG_LVL_ASIC_IN_RX_VREF_CTRL_MASK)

#define X2_SUP_DIG_LVL_ASIC_IN_TX_VBOOST_LVL_MASK (0xE0U)
#define X2_SUP_DIG_LVL_ASIC_IN_TX_VBOOST_LVL_SHIFT (5U)
#define X2_SUP_DIG_LVL_ASIC_IN_TX_VBOOST_LVL_WIDTH (3U)
#define X2_SUP_DIG_LVL_ASIC_IN_TX_VBOOST_LVL(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_LVL_ASIC_IN_TX_VBOOST_LVL_SHIFT)) & X2_SUP_DIG_LVL_ASIC_IN_TX_VBOOST_LVL_MASK)

#define X2_SUP_DIG_LVL_ASIC_IN_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUP_DIG_LVL_ASIC_IN_RESERVED_15_8_SHIFT (8U)
#define X2_SUP_DIG_LVL_ASIC_IN_RESERVED_15_8_WIDTH (8U)
#define X2_SUP_DIG_LVL_ASIC_IN_RESERVED_15_8(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_LVL_ASIC_IN_RESERVED_15_8_SHIFT)) & X2_SUP_DIG_LVL_ASIC_IN_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUP_DIG_BANDGAP_ASIC_IN - Current values for incoming bandgap control from ASIC */
/*! @{ */

#define X2_SUP_DIG_BANDGAP_ASIC_IN_BG_EN_MASK    (0x1U)
#define X2_SUP_DIG_BANDGAP_ASIC_IN_BG_EN_SHIFT   (0U)
#define X2_SUP_DIG_BANDGAP_ASIC_IN_BG_EN_WIDTH   (1U)
#define X2_SUP_DIG_BANDGAP_ASIC_IN_BG_EN(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_BANDGAP_ASIC_IN_BG_EN_SHIFT)) & X2_SUP_DIG_BANDGAP_ASIC_IN_BG_EN_MASK)

#define X2_SUP_DIG_BANDGAP_ASIC_IN_RESERVED_15_1_MASK (0xFFFEU)
#define X2_SUP_DIG_BANDGAP_ASIC_IN_RESERVED_15_1_SHIFT (1U)
#define X2_SUP_DIG_BANDGAP_ASIC_IN_RESERVED_15_1_WIDTH (15U)
#define X2_SUP_DIG_BANDGAP_ASIC_IN_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_BANDGAP_ASIC_IN_RESERVED_15_1_SHIFT)) & X2_SUP_DIG_BANDGAP_ASIC_IN_RESERVED_15_1_MASK)
/*! @} */

/*! @name SUP_DIG_CLK_RST_BG_PWRUP_TIME_0 - BG Power UP Time Register #0 */
/*! @{ */

#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_BG_SUP_EN_TIME_MASK (0x1FFU)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_BG_SUP_EN_TIME_SHIFT (0U)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_BG_SUP_EN_TIME_WIDTH (9U)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_BG_SUP_EN_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_BG_SUP_EN_TIME_SHIFT)) & X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_BG_SUP_EN_TIME_MASK)

#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_FAST_BG_WAIT_MASK (0x200U)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_FAST_BG_WAIT_SHIFT (9U)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_FAST_BG_WAIT_WIDTH (1U)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_FAST_BG_WAIT(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_FAST_BG_WAIT_SHIFT)) & X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_FAST_BG_WAIT_MASK)

#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_RESERVED_15_10_SHIFT (10U)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_RESERVED_15_10_WIDTH (6U)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_RESERVED_15_10_SHIFT)) & X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_0_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUP_DIG_CLK_RST_BG_PWRUP_TIME_1 - BG Power UP Time Register #1 */
/*! @{ */

#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_1_BG_LANE_EN_TIME_MASK (0x3FFU)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_1_BG_LANE_EN_TIME_SHIFT (0U)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_1_BG_LANE_EN_TIME_WIDTH (10U)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_1_BG_LANE_EN_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_1_BG_LANE_EN_TIME_SHIFT)) & X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_1_BG_LANE_EN_TIME_MASK)

#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_1_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_1_RESERVED_15_10_SHIFT (10U)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_1_RESERVED_15_10_WIDTH (6U)
#define X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_1_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_1_RESERVED_15_10_SHIFT)) & X2_SUP_DIG_CLK_RST_BG_PWRUP_TIME_1_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUP_ANA_RTUNE_CTRL - RTUNE_CTRL */
/*! @{ */

#define X2_SUP_ANA_RTUNE_CTRL_rt_sel_atbf_MASK   (0x1U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_sel_atbf_SHIFT  (0U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_sel_atbf_WIDTH  (1U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_sel_atbf(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_RTUNE_CTRL_rt_sel_atbf_SHIFT)) & X2_SUP_ANA_RTUNE_CTRL_rt_sel_atbf_MASK)

#define X2_SUP_ANA_RTUNE_CTRL_rt_sel_atbp_MASK   (0x2U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_sel_atbp_SHIFT  (1U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_sel_atbp_WIDTH  (1U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_sel_atbp(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_RTUNE_CTRL_rt_sel_atbp_SHIFT)) & X2_SUP_ANA_RTUNE_CTRL_rt_sel_atbp_MASK)

#define X2_SUP_ANA_RTUNE_CTRL_rt_atb_MASK        (0x4U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_atb_SHIFT       (2U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_atb_WIDTH       (1U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_atb(x)          (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_RTUNE_CTRL_rt_atb_SHIFT)) & X2_SUP_ANA_RTUNE_CTRL_rt_atb_MASK)

#define X2_SUP_ANA_RTUNE_CTRL_rt_dac_chop_MASK   (0x8U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_dac_chop_SHIFT  (3U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_dac_chop_WIDTH  (1U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_dac_chop(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_RTUNE_CTRL_rt_dac_chop_SHIFT)) & X2_SUP_ANA_RTUNE_CTRL_rt_dac_chop_MASK)

#define X2_SUP_ANA_RTUNE_CTRL_rt_dac_mode_MASK   (0x30U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_dac_mode_SHIFT  (4U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_dac_mode_WIDTH  (2U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_dac_mode(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_RTUNE_CTRL_rt_dac_mode_SHIFT)) & X2_SUP_ANA_RTUNE_CTRL_rt_dac_mode_MASK)

#define X2_SUP_ANA_RTUNE_CTRL_NC6_MASK           (0x40U)
#define X2_SUP_ANA_RTUNE_CTRL_NC6_SHIFT          (6U)
#define X2_SUP_ANA_RTUNE_CTRL_NC6_WIDTH          (1U)
#define X2_SUP_ANA_RTUNE_CTRL_NC6(x)             (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_RTUNE_CTRL_NC6_SHIFT)) & X2_SUP_ANA_RTUNE_CTRL_NC6_MASK)

#define X2_SUP_ANA_RTUNE_CTRL_rt_en_frcon_MASK   (0x80U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_en_frcon_SHIFT  (7U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_en_frcon_WIDTH  (1U)
#define X2_SUP_ANA_RTUNE_CTRL_rt_en_frcon(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_RTUNE_CTRL_rt_en_frcon_SHIFT)) & X2_SUP_ANA_RTUNE_CTRL_rt_en_frcon_MASK)

#define X2_SUP_ANA_RTUNE_CTRL_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUP_ANA_RTUNE_CTRL_RESERVED_15_8_SHIFT (8U)
#define X2_SUP_ANA_RTUNE_CTRL_RESERVED_15_8_WIDTH (8U)
#define X2_SUP_ANA_RTUNE_CTRL_RESERVED_15_8(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_RTUNE_CTRL_RESERVED_15_8_SHIFT)) & X2_SUP_ANA_RTUNE_CTRL_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUP_ANA_SWITCH_PWR_MEAS - SWITCH_PWR_MEAS */
/*! @{ */

#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_bias_ref_MASK (0x1U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_bias_ref_SHIFT (0U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_bias_ref_WIDTH (1U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_bias_ref(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_bias_ref_SHIFT)) & X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_bias_ref_MASK)

#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vph_MASK (0x2U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vph_SHIFT (1U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vph_WIDTH (1U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vph(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vph_SHIFT)) & X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vph_MASK)

#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_vref_MASK (0x4U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_vref_SHIFT (2U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_vref_WIDTH (1U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_vref(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_vref_SHIFT)) & X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_vref_MASK)

#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vp_MASK (0x8U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vp_SHIFT (3U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vp_WIDTH (1U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vp(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vp_SHIFT)) & X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_vp_MASK)

