zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_gd_MASK (0x10U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_gd_SHIFT (4U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_gd_WIDTH (1U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_gd(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_gd_SHIFT)) & X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_gd_MASK)

#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_half_vph_MASK (0x20U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_half_vph_SHIFT (5U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_half_vph_WIDTH (1U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_half_vph(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_half_vph_SHIFT)) & X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_half_vph_MASK)

#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_MASK   (0x40U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_SHIFT  (6U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_WIDTH  (1U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_SHIFT)) & X2_SUP_ANA_SWITCH_PWR_MEAS_atb_sw_MASK)

#define X2_SUP_ANA_SWITCH_PWR_MEAS_NC7_MASK      (0x80U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_NC7_SHIFT     (7U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_NC7_WIDTH     (1U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_NC7(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_PWR_MEAS_NC7_SHIFT)) & X2_SUP_ANA_SWITCH_PWR_MEAS_NC7_MASK)

#define X2_SUP_ANA_SWITCH_PWR_MEAS_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_RESERVED_15_8_SHIFT (8U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_RESERVED_15_8_WIDTH (8U)
#define X2_SUP_ANA_SWITCH_PWR_MEAS_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_PWR_MEAS_RESERVED_15_8_SHIFT)) & X2_SUP_ANA_SWITCH_PWR_MEAS_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUP_ANA_SWITCH_MISC_MEAS - SWITCH_MISC_MEAS */
/*! @{ */

#define X2_SUP_ANA_SWITCH_MISC_MEAS_hyst_ref_MASK (0x3U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_hyst_ref_SHIFT (0U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_hyst_ref_WIDTH (2U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_hyst_ref(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_MISC_MEAS_hyst_ref_SHIFT)) & X2_SUP_ANA_SWITCH_MISC_MEAS_hyst_ref_MASK)

#define X2_SUP_ANA_SWITCH_MISC_MEAS_sel_vpll_ref_MASK (0xCU)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_sel_vpll_ref_SHIFT (2U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_sel_vpll_ref_WIDTH (2U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_sel_vpll_ref(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_MISC_MEAS_sel_vpll_ref_SHIFT)) & X2_SUP_ANA_SWITCH_MISC_MEAS_sel_vpll_ref_MASK)

#define X2_SUP_ANA_SWITCH_MISC_MEAS_NC4_MASK     (0x10U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_NC4_SHIFT    (4U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_NC4_WIDTH    (1U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_NC4(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_MISC_MEAS_NC4_SHIFT)) & X2_SUP_ANA_SWITCH_MISC_MEAS_NC4_MASK)

#define X2_SUP_ANA_SWITCH_MISC_MEAS_temp_meas_MASK (0x20U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_temp_meas_SHIFT (5U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_temp_meas_WIDTH (1U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_temp_meas(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_MISC_MEAS_temp_meas_SHIFT)) & X2_SUP_ANA_SWITCH_MISC_MEAS_temp_meas_MASK)

#define X2_SUP_ANA_SWITCH_MISC_MEAS_NC7_6_MASK   (0xC0U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_NC7_6_SHIFT  (6U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_NC7_6_WIDTH  (2U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_NC7_6(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_MISC_MEAS_NC7_6_SHIFT)) & X2_SUP_ANA_SWITCH_MISC_MEAS_NC7_6_MASK)

#define X2_SUP_ANA_SWITCH_MISC_MEAS_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_RESERVED_15_8_SHIFT (8U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_RESERVED_15_8_WIDTH (8U)
#define X2_SUP_ANA_SWITCH_MISC_MEAS_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_SWITCH_MISC_MEAS_RESERVED_15_8_SHIFT)) & X2_SUP_ANA_SWITCH_MISC_MEAS_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUP_ANA_BG - BG */
/*! @{ */

#define X2_SUP_ANA_BG_bypass_bg_MASK             (0x1U)
#define X2_SUP_ANA_BG_bypass_bg_SHIFT            (0U)
#define X2_SUP_ANA_BG_bypass_bg_WIDTH            (1U)
#define X2_SUP_ANA_BG_bypass_bg(x)               (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_BG_bypass_bg_SHIFT)) & X2_SUP_ANA_BG_bypass_bg_MASK)

#define X2_SUP_ANA_BG_sel_vbg_vref_MASK          (0x6U)
#define X2_SUP_ANA_BG_sel_vbg_vref_SHIFT         (1U)
#define X2_SUP_ANA_BG_sel_vbg_vref_WIDTH         (2U)
#define X2_SUP_ANA_BG_sel_vbg_vref(x)            (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_BG_sel_vbg_vref_SHIFT)) & X2_SUP_ANA_BG_sel_vbg_vref_MASK)

#define X2_SUP_ANA_BG_chop_en_MASK               (0x8U)
#define X2_SUP_ANA_BG_chop_en_SHIFT              (3U)
#define X2_SUP_ANA_BG_chop_en_WIDTH              (1U)
#define X2_SUP_ANA_BG_chop_en(x)                 (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_BG_chop_en_SHIFT)) & X2_SUP_ANA_BG_chop_en_MASK)

#define X2_SUP_ANA_BG_por_start_kick_en_MASK     (0x10U)
#define X2_SUP_ANA_BG_por_start_kick_en_SHIFT    (4U)
#define X2_SUP_ANA_BG_por_start_kick_en_WIDTH    (1U)
#define X2_SUP_ANA_BG_por_start_kick_en(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_BG_por_start_kick_en_SHIFT)) & X2_SUP_ANA_BG_por_start_kick_en_MASK)

#define X2_SUP_ANA_BG_NC7_5_MASK                 (0xE0U)
#define X2_SUP_ANA_BG_NC7_5_SHIFT                (5U)
#define X2_SUP_ANA_BG_NC7_5_WIDTH                (3U)
#define X2_SUP_ANA_BG_NC7_5(x)                   (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_BG_NC7_5_SHIFT)) & X2_SUP_ANA_BG_NC7_5_MASK)

#define X2_SUP_ANA_BG_RESERVED_15_8_MASK         (0xFF00U)
#define X2_SUP_ANA_BG_RESERVED_15_8_SHIFT        (8U)
#define X2_SUP_ANA_BG_RESERVED_15_8_WIDTH        (8U)
#define X2_SUP_ANA_BG_RESERVED_15_8(x)           (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_BG_RESERVED_15_8_SHIFT)) & X2_SUP_ANA_BG_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUP_ANA_PRESCALER_CTRL - PRESCALER_CTRL */
/*! @{ */

#define X2_SUP_ANA_PRESCALER_CTRL_meas_vreg_MASK (0x1U)
#define X2_SUP_ANA_PRESCALER_CTRL_meas_vreg_SHIFT (0U)
#define X2_SUP_ANA_PRESCALER_CTRL_meas_vreg_WIDTH (1U)
#define X2_SUP_ANA_PRESCALER_CTRL_meas_vreg(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_PRESCALER_CTRL_meas_vreg_SHIFT)) & X2_SUP_ANA_PRESCALER_CTRL_meas_vreg_MASK)

#define X2_SUP_ANA_PRESCALER_CTRL_NC1_MASK       (0x2U)
#define X2_SUP_ANA_PRESCALER_CTRL_NC1_SHIFT      (1U)
#define X2_SUP_ANA_PRESCALER_CTRL_NC1_WIDTH      (1U)
#define X2_SUP_ANA_PRESCALER_CTRL_NC1(x)         (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_PRESCALER_CTRL_NC1_SHIFT)) & X2_SUP_ANA_PRESCALER_CTRL_NC1_MASK)

#define X2_SUP_ANA_PRESCALER_CTRL_atb_select_MASK (0x4U)
#define X2_SUP_ANA_PRESCALER_CTRL_atb_select_SHIFT (2U)
#define X2_SUP_ANA_PRESCALER_CTRL_atb_select_WIDTH (1U)
#define X2_SUP_ANA_PRESCALER_CTRL_atb_select(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_PRESCALER_CTRL_atb_select_SHIFT)) & X2_SUP_ANA_PRESCALER_CTRL_atb_select_MASK)

#define X2_SUP_ANA_PRESCALER_CTRL_NC7_3_MASK     (0xF8U)
#define X2_SUP_ANA_PRESCALER_CTRL_NC7_3_SHIFT    (3U)
#define X2_SUP_ANA_PRESCALER_CTRL_NC7_3_WIDTH    (5U)
#define X2_SUP_ANA_PRESCALER_CTRL_NC7_3(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_PRESCALER_CTRL_NC7_3_SHIFT)) & X2_SUP_ANA_PRESCALER_CTRL_NC7_3_MASK)

#define X2_SUP_ANA_PRESCALER_CTRL_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUP_ANA_PRESCALER_CTRL_RESERVED_15_8_SHIFT (8U)
#define X2_SUP_ANA_PRESCALER_CTRL_RESERVED_15_8_WIDTH (8U)
#define X2_SUP_ANA_PRESCALER_CTRL_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_PRESCALER_CTRL_RESERVED_15_8_SHIFT)) & X2_SUP_ANA_PRESCALER_CTRL_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUP_DIG_RTUNE_DEBUG - Resistor tuning debug controls */
/*! @{ */

#define X2_SUP_DIG_RTUNE_DEBUG_FLIP_COMP_MASK    (0x1U)
#define X2_SUP_DIG_RTUNE_DEBUG_FLIP_COMP_SHIFT   (0U)
#define X2_SUP_DIG_RTUNE_DEBUG_FLIP_COMP_WIDTH   (1U)
#define X2_SUP_DIG_RTUNE_DEBUG_FLIP_COMP(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_RTUNE_DEBUG_FLIP_COMP_SHIFT)) & X2_SUP_DIG_RTUNE_DEBUG_FLIP_COMP_MASK)

#define X2_SUP_DIG_RTUNE_DEBUG_MAN_TUNE_MASK     (0x2U)
#define X2_SUP_DIG_RTUNE_DEBUG_MAN_TUNE_SHIFT    (1U)
#define X2_SUP_DIG_RTUNE_DEBUG_MAN_TUNE_WIDTH    (1U)
#define X2_SUP_DIG_RTUNE_DEBUG_MAN_TUNE(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_RTUNE_DEBUG_MAN_TUNE_SHIFT)) & X2_SUP_DIG_RTUNE_DEBUG_MAN_TUNE_MASK)

#define X2_SUP_DIG_RTUNE_DEBUG_SET_VAL_MASK      (0x4U)
#define X2_SUP_DIG_RTUNE_DEBUG_SET_VAL_SHIFT     (2U)
#define X2_SUP_DIG_RTUNE_DEBUG_SET_VAL_WIDTH     (1U)
#define X2_SUP_DIG_RTUNE_DEBUG_SET_VAL(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_RTUNE_DEBUG_SET_VAL_SHIFT)) & X2_SUP_DIG_RTUNE_DEBUG_SET_VAL_MASK)

#define X2_SUP_DIG_RTUNE_DEBUG_TYPE_MASK         (0x18U)
#define X2_SUP_DIG_RTUNE_DEBUG_TYPE_SHIFT        (3U)
#define X2_SUP_DIG_RTUNE_DEBUG_TYPE_WIDTH        (2U)
#define X2_SUP_DIG_RTUNE_DEBUG_TYPE(x)           (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_RTUNE_DEBUG_TYPE_SHIFT)) & X2_SUP_DIG_RTUNE_DEBUG_TYPE_MASK)

#define X2_SUP_DIG_RTUNE_DEBUG_VALUE_MASK        (0x7FE0U)
#define X2_SUP_DIG_RTUNE_DEBUG_VALUE_SHIFT       (5U)
#define X2_SUP_DIG_RTUNE_DEBUG_VALUE_WIDTH       (10U)
#define X2_SUP_DIG_RTUNE_DEBUG_VALUE(x)          (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_RTUNE_DEBUG_VALUE_SHIFT)) & X2_SUP_DIG_RTUNE_DEBUG_VALUE_MASK)

