zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUP_DIG_ANA_ANA_OVRD_OUT_RESERVED_15_5_MASK (0xFFE0U)
#define X2_SUP_DIG_ANA_ANA_OVRD_OUT_RESERVED_15_5_SHIFT (5U)
#define X2_SUP_DIG_ANA_ANA_OVRD_OUT_RESERVED_15_5_WIDTH (11U)
#define X2_SUP_DIG_ANA_ANA_OVRD_OUT_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_ANA_OVRD_OUT_RESERVED_15_5_SHIFT)) & X2_SUP_DIG_ANA_ANA_OVRD_OUT_RESERVED_15_5_MASK)
/*! @} */

/*! @name RAWCMN_DIG_CMN_CTL - Common control register */
/*! @{ */

#define X2_RAWCMN_DIG_CMN_CTL_PHY_FUNC_RST_MASK  (0x1U)
#define X2_RAWCMN_DIG_CMN_CTL_PHY_FUNC_RST_SHIFT (0U)
#define X2_RAWCMN_DIG_CMN_CTL_PHY_FUNC_RST_WIDTH (1U)
#define X2_RAWCMN_DIG_CMN_CTL_PHY_FUNC_RST(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_CMN_CTL_PHY_FUNC_RST_SHIFT)) & X2_RAWCMN_DIG_CMN_CTL_PHY_FUNC_RST_MASK)

#define X2_RAWCMN_DIG_CMN_CTL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWCMN_DIG_CMN_CTL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWCMN_DIG_CMN_CTL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWCMN_DIG_CMN_CTL_RESERVED_15_1(x)   (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_CMN_CTL_RESERVED_15_1_SHIFT)) & X2_RAWCMN_DIG_CMN_CTL_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0 - Override values for incoming MPLLB SSC control settings */
/*! @{ */

#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_RANGE_OVRD_VAL_MASK (0x7U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_RANGE_OVRD_VAL_SHIFT (0U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_RANGE_OVRD_VAL_WIDTH (3U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_RANGE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_RANGE_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_RANGE_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_RANGE_OVRD_EN_MASK (0x8U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_RANGE_OVRD_EN_SHIFT (3U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_RANGE_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_RANGE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_RANGE_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_RANGE_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_CLK_SEL_OVRD_VAL_MASK (0x70U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_CLK_SEL_OVRD_VAL_SHIFT (4U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_CLK_SEL_OVRD_VAL_WIDTH (3U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_CLK_SEL_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_CLK_SEL_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_CLK_SEL_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_CLK_SEL_OVRD_EN_MASK (0x80U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_CLK_SEL_OVRD_EN_SHIFT (7U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_CLK_SEL_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_CLK_SEL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_CLK_SEL_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_CLK_SEL_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_EN_OVRD_VAL_MASK (0x100U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_EN_OVRD_VAL_SHIFT (8U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_EN_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_EN_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_EN_OVRD_EN_MASK (0x200U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_EN_OVRD_EN_SHIFT (9U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_EN_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_MPLLB_SSC_EN_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_0_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_CMN_CTL_1 - Common control register 1 */
/*! @{ */

#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLA_INIT_CAL_DISABLE_OVRD_VAL_MASK (0x1U)
#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLA_INIT_CAL_DISABLE_OVRD_VAL_SHIFT (0U)
#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLA_INIT_CAL_DISABLE_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLA_INIT_CAL_DISABLE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_CMN_CTL_1_MPLLA_INIT_CAL_DISABLE_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_CMN_CTL_1_MPLLA_INIT_CAL_DISABLE_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLA_INIT_CAL_DISABLE_OVRD_EN_MASK (0x2U)
#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLA_INIT_CAL_DISABLE_OVRD_EN_SHIFT (1U)
#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLA_INIT_CAL_DISABLE_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLA_INIT_CAL_DISABLE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_CMN_CTL_1_MPLLA_INIT_CAL_DISABLE_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_CMN_CTL_1_MPLLA_INIT_CAL_DISABLE_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLB_INIT_CAL_DISABLE_OVRD_VAL_MASK (0x4U)
#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLB_INIT_CAL_DISABLE_OVRD_VAL_SHIFT (2U)
#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLB_INIT_CAL_DISABLE_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLB_INIT_CAL_DISABLE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_CMN_CTL_1_MPLLB_INIT_CAL_DISABLE_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_CMN_CTL_1_MPLLB_INIT_CAL_DISABLE_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLB_INIT_CAL_DISABLE_OVRD_EN_MASK (0x8U)
#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLB_INIT_CAL_DISABLE_OVRD_EN_SHIFT (3U)
#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLB_INIT_CAL_DISABLE_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_CMN_CTL_1_MPLLB_INIT_CAL_DISABLE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_CMN_CTL_1_MPLLB_INIT_CAL_DISABLE_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_CMN_CTL_1_MPLLB_INIT_CAL_DISABLE_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_CMN_CTL_1_RTUNE_REQ_OVRD_VAL_MASK (0x10U)
#define X2_RAWCMN_DIG_CMN_CTL_1_RTUNE_REQ_OVRD_VAL_SHIFT (4U)
#define X2_RAWCMN_DIG_CMN_CTL_1_RTUNE_REQ_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_CMN_CTL_1_RTUNE_REQ_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_CMN_CTL_1_RTUNE_REQ_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_CMN_CTL_1_RTUNE_REQ_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_CMN_CTL_1_RTUNE_REQ_OVRD_EN_MASK (0x20U)
#define X2_RAWCMN_DIG_CMN_CTL_1_RTUNE_REQ_OVRD_EN_SHIFT (5U)
#define X2_RAWCMN_DIG_CMN_CTL_1_RTUNE_REQ_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_CMN_CTL_1_RTUNE_REQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_CMN_CTL_1_RTUNE_REQ_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_CMN_CTL_1_RTUNE_REQ_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_CMN_CTL_1_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWCMN_DIG_CMN_CTL_1_RESERVED_15_6_SHIFT (6U)
#define X2_RAWCMN_DIG_CMN_CTL_1_RESERVED_15_6_WIDTH (10U)
#define X2_RAWCMN_DIG_CMN_CTL_1_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_CMN_CTL_1_RESERVED_15_6_SHIFT)) & X2_RAWCMN_DIG_CMN_CTL_1_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWCMN_DIG_CMN_CTL_2 - Common control register 2 */
/*! @{ */

#define X2_RAWCMN_DIG_CMN_CTL_2_TX_WAIT_MPLL_OFF_TIME_MASK (0x3FU)
#define X2_RAWCMN_DIG_CMN_CTL_2_TX_WAIT_MPLL_OFF_TIME_SHIFT (0U)
#define X2_RAWCMN_DIG_CMN_CTL_2_TX_WAIT_MPLL_OFF_TIME_WIDTH (6U)
#define X2_RAWCMN_DIG_CMN_CTL_2_TX_WAIT_MPLL_OFF_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_CMN_CTL_2_TX_WAIT_MPLL_OFF_TIME_SHIFT)) & X2_RAWCMN_DIG_CMN_CTL_2_TX_WAIT_MPLL_OFF_TIME_MASK)

#define X2_RAWCMN_DIG_CMN_CTL_2_FW_PWRUP_DONE_MASK (0x40U)
#define X2_RAWCMN_DIG_CMN_CTL_2_FW_PWRUP_DONE_SHIFT (6U)
#define X2_RAWCMN_DIG_CMN_CTL_2_FW_PWRUP_DONE_WIDTH (1U)
#define X2_RAWCMN_DIG_CMN_CTL_2_FW_PWRUP_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_CMN_CTL_2_FW_PWRUP_DONE_SHIFT)) & X2_RAWCMN_DIG_CMN_CTL_2_FW_PWRUP_DONE_MASK)

#define X2_RAWCMN_DIG_CMN_CTL_2_RESERVED_15_7_MASK (0xFF80U)
#define X2_RAWCMN_DIG_CMN_CTL_2_RESERVED_15_7_SHIFT (7U)
#define X2_RAWCMN_DIG_CMN_CTL_2_RESERVED_15_7_WIDTH (9U)
#define X2_RAWCMN_DIG_CMN_CTL_2_RESERVED_15_7(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_CMN_CTL_2_RESERVED_15_7_SHIFT)) & X2_RAWCMN_DIG_CMN_CTL_2_RESERVED_15_7_MASK)
/*! @} */

/*! @name RAWCMN_DIG_MPLL_STATE_CTL - MPLL control signals for force ack state machine */
/*! @{ */

#define X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLL_FORCE_ON_TIME_MASK (0xFU)
#define X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLL_FORCE_ON_TIME_SHIFT (0U)
#define X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLL_FORCE_ON_TIME_WIDTH (4U)
#define X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLL_FORCE_ON_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLL_FORCE_ON_TIME_SHIFT)) & X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLL_FORCE_ON_TIME_MASK)

#define X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLLB_BANK_SEL_MASK (0x10U)
#define X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLLB_BANK_SEL_SHIFT (4U)
#define X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLLB_BANK_SEL_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLLB_BANK_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLLB_BANK_SEL_SHIFT)) & X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLLB_BANK_SEL_MASK)

