zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLLA_BANK_SEL_MASK (0x20U)
#define X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLLA_BANK_SEL_SHIFT (5U)
#define X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLLA_BANK_SEL_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLLA_BANK_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLLA_BANK_SEL_SHIFT)) & X2_RAWCMN_DIG_MPLL_STATE_CTL_MPLLA_BANK_SEL_MASK)

#define X2_RAWCMN_DIG_MPLL_STATE_CTL_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWCMN_DIG_MPLL_STATE_CTL_RESERVED_15_6_SHIFT (6U)
#define X2_RAWCMN_DIG_MPLL_STATE_CTL_RESERVED_15_6_WIDTH (10U)
#define X2_RAWCMN_DIG_MPLL_STATE_CTL_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLL_STATE_CTL_RESERVED_15_6_SHIFT)) & X2_RAWCMN_DIG_MPLL_STATE_CTL_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0 - Resistor Tune RX Value 0 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0_RTUNE_RX_VAL_0_MASK (0x3FU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0_RTUNE_RX_VAL_0_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0_RTUNE_RX_VAL_0_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0_RTUNE_RX_VAL_0(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0_RTUNE_RX_VAL_0_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0_RTUNE_RX_VAL_0_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0_RESERVED_15_6_SHIFT (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0_RESERVED_15_6_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0_RESERVED_15_6_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_0_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0 - Resistor Tune TX Down Value 0 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0_RTUNE_TXDN_VAL_0_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0_RTUNE_TXDN_VAL_0_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0_RTUNE_TXDN_VAL_0_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0_RTUNE_TXDN_VAL_0(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0_RTUNE_TXDN_VAL_0_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0_RTUNE_TXDN_VAL_0_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_0_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0 - Resistor Tune TX Up Value 0 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0_RTUNE_TXUP_VAL_0_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0_RTUNE_TXUP_VAL_0_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0_RTUNE_TXUP_VAL_0_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0_RTUNE_TXUP_VAL_0(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0_RTUNE_TXUP_VAL_0_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0_RTUNE_TXUP_VAL_0_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_0_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1 - Resistor Tune RX Value 1 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1_RTUNE_RX_VAL_1_MASK (0x3FU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1_RTUNE_RX_VAL_1_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1_RTUNE_RX_VAL_1_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1_RTUNE_RX_VAL_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1_RTUNE_RX_VAL_1_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1_RTUNE_RX_VAL_1_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1_RESERVED_15_6_SHIFT (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1_RESERVED_15_6_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1_RESERVED_15_6_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_1_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1 - Resistor Tune TX Down Value 1 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1_RTUNE_TXDN_VAL_1_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1_RTUNE_TXDN_VAL_1_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1_RTUNE_TXDN_VAL_1_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1_RTUNE_TXDN_VAL_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1_RTUNE_TXDN_VAL_1_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1_RTUNE_TXDN_VAL_1_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_1_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1 - Resistor Tune TX Up Value 1 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1_RTUNE_TXUP_VAL_1_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1_RTUNE_TXUP_VAL_1_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1_RTUNE_TXUP_VAL_1_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1_RTUNE_TXUP_VAL_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1_RTUNE_TXUP_VAL_1_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1_RTUNE_TXUP_VAL_1_MASK)

