zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_1_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2 - Resistor Tune RX Value 2 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2_RTUNE_RX_VAL_2_MASK (0x3FU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2_RTUNE_RX_VAL_2_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2_RTUNE_RX_VAL_2_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2_RTUNE_RX_VAL_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2_RTUNE_RX_VAL_2_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2_RTUNE_RX_VAL_2_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2_RESERVED_15_6_SHIFT (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2_RESERVED_15_6_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2_RESERVED_15_6_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_2_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2 - Resistor Tune TX Down Value 2 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2_RTUNE_TXDN_VAL_2_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2_RTUNE_TXDN_VAL_2_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2_RTUNE_TXDN_VAL_2_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2_RTUNE_TXDN_VAL_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2_RTUNE_TXDN_VAL_2_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2_RTUNE_TXDN_VAL_2_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_2_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2 - Resistor Tune TX Up Value 2 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2_RTUNE_TXUP_VAL_2_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2_RTUNE_TXUP_VAL_2_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2_RTUNE_TXUP_VAL_2_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2_RTUNE_TXUP_VAL_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2_RTUNE_TXUP_VAL_2_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2_RTUNE_TXUP_VAL_2_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_2_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3 - Resistor Tune RX Value 3 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3_RTUNE_RX_VAL_3_MASK (0x3FU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3_RTUNE_RX_VAL_3_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3_RTUNE_RX_VAL_3_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3_RTUNE_RX_VAL_3(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3_RTUNE_RX_VAL_3_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3_RTUNE_RX_VAL_3_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3_RESERVED_15_6_SHIFT (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3_RESERVED_15_6_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3_RESERVED_15_6_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_3_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3 - Resistor Tune TX Down Value 3 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3_RTUNE_TXDN_VAL_3_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3_RTUNE_TXDN_VAL_3_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3_RTUNE_TXDN_VAL_3_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3_RTUNE_TXDN_VAL_3(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3_RTUNE_TXDN_VAL_3_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3_RTUNE_TXDN_VAL_3_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_3_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3 - Resistor Tune TX Up Value 3 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3_RTUNE_TXUP_VAL_3_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3_RTUNE_TXUP_VAL_3_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3_RTUNE_TXUP_VAL_3_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3_RTUNE_TXUP_VAL_3(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3_RTUNE_TXUP_VAL_3_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3_RTUNE_TXUP_VAL_3_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_3_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4 - Resistor Tune RX Value 4 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4_RTUNE_RX_VAL_4_MASK (0x3FU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4_RTUNE_RX_VAL_4_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4_RTUNE_RX_VAL_4_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4_RTUNE_RX_VAL_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4_RTUNE_RX_VAL_4_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4_RTUNE_RX_VAL_4_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4_RESERVED_15_6_SHIFT (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4_RESERVED_15_6_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4_RESERVED_15_6_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_4_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4 - Resistor Tune TX Down Value 4 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4_RTUNE_TXDN_VAL_4_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4_RTUNE_TXDN_VAL_4_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4_RTUNE_TXDN_VAL_4_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4_RTUNE_TXDN_VAL_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4_RTUNE_TXDN_VAL_4_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4_RTUNE_TXDN_VAL_4_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_4_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4 - Resistor Tune TX Up Value 4 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4_RTUNE_TXUP_VAL_4_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4_RTUNE_TXUP_VAL_4_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4_RTUNE_TXUP_VAL_4_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4_RTUNE_TXUP_VAL_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4_RTUNE_TXUP_VAL_4_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4_RTUNE_TXUP_VAL_4_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_4_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5 - Resistor Tune RX Value 5 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5_RTUNE_RX_VAL_5_MASK (0x3FU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5_RTUNE_RX_VAL_5_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5_RTUNE_RX_VAL_5_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5_RTUNE_RX_VAL_5(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5_RTUNE_RX_VAL_5_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5_RTUNE_RX_VAL_5_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5_RESERVED_15_6_SHIFT (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5_RESERVED_15_6_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5_RESERVED_15_6_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_5_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5 - Resistor Tune TX Down Value 5 */
/*! @{ */

