zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5_RTUNE_TXDN_VAL_5_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5_RTUNE_TXDN_VAL_5_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5_RTUNE_TXDN_VAL_5_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5_RTUNE_TXDN_VAL_5(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5_RTUNE_TXDN_VAL_5_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5_RTUNE_TXDN_VAL_5_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_5_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5 - Resistor Tune TX Up Value 5 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5_RTUNE_TXUP_VAL_5_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5_RTUNE_TXUP_VAL_5_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5_RTUNE_TXUP_VAL_5_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5_RTUNE_TXUP_VAL_5(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5_RTUNE_TXUP_VAL_5_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5_RTUNE_TXUP_VAL_5_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_5_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6 - Resistor Tune RX Value 6 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6_RTUNE_RX_VAL_6_MASK (0x3FU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6_RTUNE_RX_VAL_6_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6_RTUNE_RX_VAL_6_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6_RTUNE_RX_VAL_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6_RTUNE_RX_VAL_6_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6_RTUNE_RX_VAL_6_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6_RESERVED_15_6_SHIFT (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6_RESERVED_15_6_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6_RESERVED_15_6_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_6_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6 - Resistor Tune TX Down Value 6 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6_RTUNE_TXDN_VAL_6_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6_RTUNE_TXDN_VAL_6_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6_RTUNE_TXDN_VAL_6_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6_RTUNE_TXDN_VAL_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6_RTUNE_TXDN_VAL_6_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6_RTUNE_TXDN_VAL_6_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_6_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6 - Resistor Tune TX Up Value 6 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6_RTUNE_TXUP_VAL_6_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6_RTUNE_TXUP_VAL_6_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6_RTUNE_TXUP_VAL_6_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6_RTUNE_TXUP_VAL_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6_RTUNE_TXUP_VAL_6_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6_RTUNE_TXUP_VAL_6_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_6_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7 - Resistor Tune RX Value 7 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7_RTUNE_RX_VAL_7_MASK (0x3FU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7_RTUNE_RX_VAL_7_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7_RTUNE_RX_VAL_7_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7_RTUNE_RX_VAL_7(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7_RTUNE_RX_VAL_7_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7_RTUNE_RX_VAL_7_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7_RESERVED_15_6_SHIFT (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7_RESERVED_15_6_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7_RESERVED_15_6_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_RX_VAL_7_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7 - Resistor Tune TX Down Value 7 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7_RTUNE_TXDN_VAL_7_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7_RTUNE_TXDN_VAL_7_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7_RTUNE_TXDN_VAL_7_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7_RTUNE_TXDN_VAL_7(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7_RTUNE_TXDN_VAL_7_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7_RTUNE_TXDN_VAL_7_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXDN_VAL_7_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7 - Resistor Tune TX Up Value 7 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7_RTUNE_TXUP_VAL_7_MASK (0x3FFU)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7_RTUNE_TXUP_VAL_7_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7_RTUNE_TXUP_VAL_7_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7_RTUNE_TXUP_VAL_7(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7_RTUNE_TXUP_VAL_7_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7_RTUNE_TXUP_VAL_7_MASK)

#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_RTUNE_TXUP_VAL_7_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN - Enable SRAM bootloader on power-gated exit */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN_SRAM_PGATE_BL_EN_MASK (0x1U)
#define X2_RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN_SRAM_PGATE_BL_EN_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN_SRAM_PGATE_BL_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN_SRAM_PGATE_BL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN_SRAM_PGATE_BL_EN_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN_SRAM_PGATE_BL_EN_MASK)

