zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN_RESERVED_15_1_SHIFT (1U)
#define X2_RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN_RESERVED_15_1_WIDTH (15U)
#define X2_RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN_RESERVED_15_1_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_SRAM_PGATE_BL_EN_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_PG_OVRD_IN - Override values for incoming power-gating signals */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PMA_PWR_STABLE_OVRD_MASK (0x1U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PMA_PWR_STABLE_OVRD_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PMA_PWR_STABLE_OVRD_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PMA_PWR_STABLE_OVRD(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PMA_PWR_STABLE_OVRD_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PMA_PWR_STABLE_OVRD_MASK)

#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PCS_PWR_STABLE_OVRD_MASK (0x2U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PCS_PWR_STABLE_OVRD_SHIFT (1U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PCS_PWR_STABLE_OVRD_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PCS_PWR_STABLE_OVRD(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PCS_PWR_STABLE_OVRD_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PCS_PWR_STABLE_OVRD_MASK)

#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_RESET_OVRD_VAL_MASK (0x4U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_RESET_OVRD_VAL_SHIFT (2U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_RESET_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_RESET_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_RESET_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_RESET_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_RESET_OVRD_EN_MASK (0x8U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_RESET_OVRD_EN_SHIFT (3U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_RESET_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_RESET_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_RESET_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_RESET_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_MODE_EN_OVRD_VAL_MASK (0x10U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_MODE_EN_OVRD_VAL_SHIFT (4U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_MODE_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_MODE_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_MODE_EN_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_MODE_EN_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_MODE_EN_OVRD_EN_MASK (0x20U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_MODE_EN_OVRD_EN_SHIFT (5U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_MODE_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_MODE_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_MODE_EN_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_PG_MODE_EN_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_RESERVED_15_6_SHIFT (6U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_RESERVED_15_6_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_RESERVED_15_6_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_PG_OVRD_IN_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_PG_OVRD_OUT - Override values for outgoing power-gating signals */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_PMA_PWR_EN_OVRD_MASK (0x1U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_PMA_PWR_EN_OVRD_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_PMA_PWR_EN_OVRD_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_PMA_PWR_EN_OVRD(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_PMA_PWR_EN_OVRD_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_PMA_PWR_EN_OVRD_MASK)

#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_PCS_PWR_EN_OVRD_MASK (0x2U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_PCS_PWR_EN_OVRD_SHIFT (1U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_PCS_PWR_EN_OVRD_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_PCS_PWR_EN_OVRD(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_PCS_PWR_EN_OVRD_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_PCS_PWR_EN_OVRD_MASK)

#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_RESERVED_15_2_SHIFT (2U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_RESERVED_15_2_WIDTH (14U)
#define X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_RESERVED_15_2_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_PG_OVRD_OUT_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_SUP_OVRD_IN - Override values for incoming SUP signals */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLA_FORCE_EN_OVRD_VAL_MASK (0x1U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLA_FORCE_EN_OVRD_VAL_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLA_FORCE_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLA_FORCE_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLA_FORCE_EN_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLA_FORCE_EN_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLA_FORCE_EN_OVRD_EN_MASK (0x2U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLA_FORCE_EN_OVRD_EN_SHIFT (1U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLA_FORCE_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLA_FORCE_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLA_FORCE_EN_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLA_FORCE_EN_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLB_FORCE_EN_OVRD_VAL_MASK (0x4U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLB_FORCE_EN_OVRD_VAL_SHIFT (2U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLB_FORCE_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLB_FORCE_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLB_FORCE_EN_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLB_FORCE_EN_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLB_FORCE_EN_OVRD_EN_MASK (0x8U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLB_FORCE_EN_OVRD_EN_SHIFT (3U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLB_FORCE_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLB_FORCE_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLB_FORCE_EN_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_MPLLB_FORCE_EN_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_REF_CLK_EN_OVRD_VAL_MASK (0x10U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_REF_CLK_EN_OVRD_VAL_SHIFT (4U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_REF_CLK_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_REF_CLK_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_REF_CLK_EN_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_REF_CLK_EN_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_REF_CLK_EN_OVRD_EN_MASK (0x20U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_REF_CLK_EN_OVRD_EN_SHIFT (5U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_REF_CLK_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_REF_CLK_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_REF_CLK_EN_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_REF_CLK_EN_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_RESERVED_15_6_SHIFT (6U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_RESERVED_15_6_WIDTH (10U)
#define X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_RESERVED_15_6_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_SUP_OVRD_IN_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE - Firmware Power-Up Done Status */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE_FW_PWRUP_DONE_MASK (0x1U)
#define X2_RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE_FW_PWRUP_DONE_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE_FW_PWRUP_DONE_WIDTH (1U)
#define X2_RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE_FW_PWRUP_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE_FW_PWRUP_DONE_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE_FW_PWRUP_DONE_MASK)

#define X2_RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE_RESERVED_15_1_SHIFT (1U)
#define X2_RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE_RESERVED_15_1_WIDTH (15U)
#define X2_RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE_RESERVED_15_1_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_FW_PWRUP_DONE_RESERVED_15_1_MASK)
/*! @} */

