zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name RAWCMN_DIG_AON_CMN_FW_VERSION_PMA_LABEL - Firmware version register #0 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PMA_LABEL_PMA_LABEL_MASK (0xFFFFU)
#define X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PMA_LABEL_PMA_LABEL_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PMA_LABEL_PMA_LABEL_WIDTH (16U)
#define X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PMA_LABEL_PMA_LABEL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PMA_LABEL_PMA_LABEL_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PMA_LABEL_PMA_LABEL_MASK)
/*! @} */

/*! @name RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL - Firmware version register #1 */
/*! @{ */

#define X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL_FW_LABEL_MASK (0xFFU)
#define X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL_FW_LABEL_SHIFT (0U)
#define X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL_FW_LABEL_WIDTH (8U)
#define X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL_FW_LABEL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL_FW_LABEL_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL_FW_LABEL_MASK)

#define X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL_PCS_RAW_LABEL_MASK (0xFF00U)
#define X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL_PCS_RAW_LABEL_SHIFT (8U)
#define X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL_PCS_RAW_LABEL_WIDTH (8U)
#define X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL_PCS_RAW_LABEL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL_PCS_RAW_LABEL_SHIFT)) & X2_RAWCMN_DIG_AON_CMN_FW_VERSION_PCS_RAW_FW_LABEL_PCS_RAW_LABEL_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLA_DIV_CLK_OVRD_IN - Override values for incoming MPLLA_DIV_CLK controls from ASIC */
/*! @{ */

#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_CLK_EN_MASK (0x1U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_CLK_EN_SHIFT (0U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_CLK_EN_SHIFT)) & X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_CLK_EN_MASK)

#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_MULTIPLIER_MASK (0x1FEU)
#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_MULTIPLIER_SHIFT (1U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_MULTIPLIER_WIDTH (8U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_MULTIPLIER(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_MULTIPLIER_SHIFT)) & X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_MULTIPLIER_MASK)

#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_OVRD_EN_MASK (0x200U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_OVRD_EN_SHIFT (9U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_OVRD_EN_SHIFT)) & X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_OVRD_EN_MASK)

#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_RESERVED_15_10_SHIFT (10U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_RESERVED_15_10_WIDTH (6U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_RESERVED_15_10_SHIFT)) & X2_SUP_DIG_MPLLA_DIV_CLK_OVRD_IN_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLA_OVRD_IN_0 - Override values for incoming MPLLA controls from ASIC */
/*! @{ */

#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_EN_MASK (0x1U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_EN_SHIFT (0U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_EN(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_EN_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_EN_MASK)

#define X2_SUP_DIG_MPLLA_OVRD_IN_0_REF_CLK_MPLLA_DIV2_EN_MASK (0x2U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_REF_CLK_MPLLA_DIV2_EN_SHIFT (1U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_REF_CLK_MPLLA_DIV2_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_REF_CLK_MPLLA_DIV2_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_0_REF_CLK_MPLLA_DIV2_EN_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_0_REF_CLK_MPLLA_DIV2_EN_MASK)

#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV8_CLK_EN_MASK (0x4U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV8_CLK_EN_SHIFT (2U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV8_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV8_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV8_CLK_EN_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV8_CLK_EN_MASK)

#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV10_CLK_EN_MASK (0x8U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV10_CLK_EN_SHIFT (3U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV10_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV10_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV10_CLK_EN_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV10_CLK_EN_MASK)

#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_MULTIPLIER_MASK (0xFF0U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_MULTIPLIER_SHIFT (4U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_MULTIPLIER_WIDTH (8U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_MULTIPLIER(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_MULTIPLIER_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_MULTIPLIER_MASK)

#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_TX_CLK_DIV_MASK (0x7000U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_TX_CLK_DIV_SHIFT (12U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_TX_CLK_DIV_WIDTH (3U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_TX_CLK_DIV(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_TX_CLK_DIV_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_0_MPLLA_TX_CLK_DIV_MASK)

#define X2_SUP_DIG_MPLLA_OVRD_IN_0_OVRD_EN_MASK  (0x8000U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_OVRD_EN_SHIFT (15U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_0_OVRD_EN(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_0_OVRD_EN_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_0_OVRD_EN_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLA_OVRD_IN_1 - Override values for incoming MPLLA controls from ASIC */
/*! @{ */

#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_EN_MASK (0x1U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_EN_SHIFT (0U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_EN_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_EN_MASK)

