zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_RANGE_MASK (0xEU)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_RANGE_SHIFT (1U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_RANGE_WIDTH (3U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_RANGE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_RANGE_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_RANGE_MASK)

#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_CLK_SEL_MASK (0x70U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_CLK_SEL_SHIFT (4U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_CLK_SEL_WIDTH (3U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_CLK_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_CLK_SEL_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_CLK_SEL_MASK)

#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_OVRD_EN_MASK (0x80U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_OVRD_EN_SHIFT (7U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_OVRD_EN_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_OVRD_EN_MASK)

#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_WORD_DIV2_EN_MASK (0x100U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_WORD_DIV2_EN_SHIFT (8U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_WORD_DIV2_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_WORD_DIV2_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_WORD_DIV2_EN_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_1_MPLLA_WORD_DIV2_EN_MASK)

#define X2_SUP_DIG_MPLLA_OVRD_IN_1_RESERVED_15_9_MASK (0xFE00U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_RESERVED_15_9_SHIFT (9U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_RESERVED_15_9_WIDTH (7U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_1_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_1_RESERVED_15_9_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_1_RESERVED_15_9_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLA_OVRD_IN_2 - Override values for incoming MPLLA controls from ASIC */
/*! @{ */

#define X2_SUP_DIG_MPLLA_OVRD_IN_2_MPLLA_FRACN_CTRL_MASK (0x7FFU)
#define X2_SUP_DIG_MPLLA_OVRD_IN_2_MPLLA_FRACN_CTRL_SHIFT (0U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_2_MPLLA_FRACN_CTRL_WIDTH (11U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_2_MPLLA_FRACN_CTRL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_2_MPLLA_FRACN_CTRL_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_2_MPLLA_FRACN_CTRL_MASK)

#define X2_SUP_DIG_MPLLA_OVRD_IN_2_RESERVED_15_11_MASK (0xF800U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_2_RESERVED_15_11_SHIFT (11U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_2_RESERVED_15_11_WIDTH (5U)
#define X2_SUP_DIG_MPLLA_OVRD_IN_2_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_OVRD_IN_2_RESERVED_15_11_SHIFT)) & X2_SUP_DIG_MPLLA_OVRD_IN_2_RESERVED_15_11_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLA_BANDWIDTH_OVRD_IN - Override values for incoming MPLLA bandwidth controls from ASIC */
/*! @{ */

#define X2_SUP_DIG_MPLLA_BANDWIDTH_OVRD_IN_MPLLA_BANDWIDTH_MASK (0xFFFFU)
#define X2_SUP_DIG_MPLLA_BANDWIDTH_OVRD_IN_MPLLA_BANDWIDTH_SHIFT (0U)
#define X2_SUP_DIG_MPLLA_BANDWIDTH_OVRD_IN_MPLLA_BANDWIDTH_WIDTH (16U)
#define X2_SUP_DIG_MPLLA_BANDWIDTH_OVRD_IN_MPLLA_BANDWIDTH(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_BANDWIDTH_OVRD_IN_MPLLA_BANDWIDTH_SHIFT)) & X2_SUP_DIG_MPLLA_BANDWIDTH_OVRD_IN_MPLLA_BANDWIDTH_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLA_ASIC_IN_0 - Current values for incoming MPLLA controls from ASIC */
/*! @{ */

#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_EN_MASK (0x1U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_EN_SHIFT (0U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_EN(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_EN_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_EN_MASK)

#define X2_SUP_DIG_MPLLA_ASIC_IN_0_REF_CLK_MPLLA_DIV2_EN_MASK (0x2U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_REF_CLK_MPLLA_DIV2_EN_SHIFT (1U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_REF_CLK_MPLLA_DIV2_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_REF_CLK_MPLLA_DIV2_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_0_REF_CLK_MPLLA_DIV2_EN_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_0_REF_CLK_MPLLA_DIV2_EN_MASK)

#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV8_CLK_EN_MASK (0x4U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV8_CLK_EN_SHIFT (2U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV8_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV8_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV8_CLK_EN_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV8_CLK_EN_MASK)

#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV10_CLK_EN_MASK (0x8U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV10_CLK_EN_SHIFT (3U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV10_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV10_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV10_CLK_EN_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV10_CLK_EN_MASK)

#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_MULTIPLIER_MASK (0xFF0U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_MULTIPLIER_SHIFT (4U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_MULTIPLIER_WIDTH (8U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_MULTIPLIER(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_MULTIPLIER_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_MULTIPLIER_MASK)

#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_TX_CLK_DIV_MASK (0x7000U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_TX_CLK_DIV_SHIFT (12U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_TX_CLK_DIV_WIDTH (3U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_TX_CLK_DIV(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_TX_CLK_DIV_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_0_MPLLA_TX_CLK_DIV_MASK)

#define X2_SUP_DIG_MPLLA_ASIC_IN_0_RESERVED_15_15_MASK (0x8000U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_RESERVED_15_15_SHIFT (15U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_RESERVED_15_15_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_0_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_0_RESERVED_15_15_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_0_RESERVED_15_15_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLA_ASIC_IN_1 - Current values for incoming MPLLA controls from ASIC */
/*! @{ */

#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_EN_MASK (0x1U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_EN_SHIFT (0U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_EN_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_EN_MASK)

#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_RANGE_MASK (0xEU)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_RANGE_SHIFT (1U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_RANGE_WIDTH (3U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_RANGE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_RANGE_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_RANGE_MASK)

#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_CLK_SEL_MASK (0x70U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_CLK_SEL_SHIFT (4U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_CLK_SEL_WIDTH (3U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_CLK_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_CLK_SEL_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_CLK_SEL_MASK)

