zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_WORD_DIV2_EN_MASK (0x80U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_WORD_DIV2_EN_SHIFT (7U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_WORD_DIV2_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_WORD_DIV2_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_WORD_DIV2_EN_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_1_MPLLA_WORD_DIV2_EN_MASK)

#define X2_SUP_DIG_MPLLA_ASIC_IN_1_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_RESERVED_15_8_SHIFT (8U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_RESERVED_15_8_WIDTH (8U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_1_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_1_RESERVED_15_8_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_1_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLA_ASIC_IN_2 - Current values for incoming MPLLA controls from ASIC */
/*! @{ */

#define X2_SUP_DIG_MPLLA_ASIC_IN_2_MPLLA_FRACN_CTRL_MASK (0x7FFU)
#define X2_SUP_DIG_MPLLA_ASIC_IN_2_MPLLA_FRACN_CTRL_SHIFT (0U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_2_MPLLA_FRACN_CTRL_WIDTH (11U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_2_MPLLA_FRACN_CTRL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_2_MPLLA_FRACN_CTRL_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_2_MPLLA_FRACN_CTRL_MASK)

#define X2_SUP_DIG_MPLLA_ASIC_IN_2_RESERVED_15_11_MASK (0xF800U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_2_RESERVED_15_11_SHIFT (11U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_2_RESERVED_15_11_WIDTH (5U)
#define X2_SUP_DIG_MPLLA_ASIC_IN_2_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_ASIC_IN_2_RESERVED_15_11_SHIFT)) & X2_SUP_DIG_MPLLA_ASIC_IN_2_RESERVED_15_11_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLA_DIV_CLK_ASIC_IN - Current values for incoming MPLLA_DIV_CLK controls from ASIC */
/*! @{ */

#define X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_CLK_EN_MASK (0x1U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_CLK_EN_SHIFT (0U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_CLK_EN_SHIFT)) & X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_CLK_EN_MASK)

#define X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_MULTIPLIER_MASK (0x1FEU)
#define X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_MULTIPLIER_SHIFT (1U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_MULTIPLIER_WIDTH (8U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_MULTIPLIER(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_MULTIPLIER_SHIFT)) & X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_MULTIPLIER_MASK)

#define X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_RESERVED_15_9_MASK (0xFE00U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_RESERVED_15_9_SHIFT (9U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_RESERVED_15_9_WIDTH (7U)
#define X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_RESERVED_15_9_SHIFT)) & X2_SUP_DIG_MPLLA_DIV_CLK_ASIC_IN_RESERVED_15_9_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLA_BANDWIDTH_ASIC_IN - Current values for incoming MPLLA bandwidth controls from ASIC */
/*! @{ */

#define X2_SUP_DIG_MPLLA_BANDWIDTH_ASIC_IN_MPLLA_BANDWIDTH_MASK (0xFFFFU)
#define X2_SUP_DIG_MPLLA_BANDWIDTH_ASIC_IN_MPLLA_BANDWIDTH_SHIFT (0U)
#define X2_SUP_DIG_MPLLA_BANDWIDTH_ASIC_IN_MPLLA_BANDWIDTH_WIDTH (16U)
#define X2_SUP_DIG_MPLLA_BANDWIDTH_ASIC_IN_MPLLA_BANDWIDTH(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_BANDWIDTH_ASIC_IN_MPLLA_BANDWIDTH_SHIFT)) & X2_SUP_DIG_MPLLA_BANDWIDTH_ASIC_IN_MPLLA_BANDWIDTH_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL - MPLL Calibration controls */
/*! @{ */

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_MASK (0xFU)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_SHIFT (0U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_WIDTH (4U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_MASK (0x10U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_SHIFT (4U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_MASK (0x20U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_SHIFT (5U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CHKFRQ_EN_MASK (0x40U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CHKFRQ_EN_SHIFT (6U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CHKFRQ_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CHKFRQ_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CHKFRQ_EN_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CHKFRQ_EN_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_COARSE_TUNE_MASK (0x7F80U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_COARSE_TUNE_SHIFT (7U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_COARSE_TUNE_WIDTH (8U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_COARSE_TUNE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_COARSE_TUNE_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_COARSE_TUNE_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CAL_DONE_MASK (0x8000U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CAL_DONE_SHIFT (15U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CAL_DONE_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CAL_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CAL_DONE_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CAL_DONE_MASK)
/*! @} */

