zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD - MPLL override controls */
/*! @{ */

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_OVRD_SEL_MASK (0x1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_OVRD_SEL_SHIFT (0U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_OVRD_SEL_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_OVRD_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_OVRD_SEL_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_OVRD_SEL_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_FBDIGCLK_EN_MASK (0x2U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_FBDIGCLK_EN_SHIFT (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_FBDIGCLK_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_FBDIGCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_FBDIGCLK_EN_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_FBDIGCLK_EN_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_PCLK_EN_MASK (0x4U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_PCLK_EN_SHIFT (2U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_PCLK_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_PCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_PCLK_EN_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_PCLK_EN_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_PWRUP_MASK (0x8U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_PWRUP_SHIFT (3U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_PWRUP_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_PWRUP(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_PWRUP_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_PWRUP_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_LOCK_MASK (0x10U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_LOCK_SHIFT (4U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_LOCK_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_LOCK(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_LOCK_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_LOCK_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_DTB_SEL_MASK (0x3E0U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_DTB_SEL_SHIFT (5U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_DTB_SEL_WIDTH (5U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_DTB_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_DTB_SEL_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_DTB_SEL_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_SHIFT (10U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_WIDTH (6U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT - MPLL status register */
/*! @{ */

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_FSM_STATE_MASK (0xFU)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_FSM_STATE_SHIFT (0U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_FSM_STATE_WIDTH (4U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_FSM_STATE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_FSM_STATE_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_FSM_STATE_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_TOOSLOW_MASK (0x10U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_TOOSLOW_SHIFT (4U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_TOOSLOW_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_TOOSLOW(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_TOOSLOW_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_TOOSLOW_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_CHKFRQ_DONE_MASK (0x20U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_CHKFRQ_DONE_SHIFT (5U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_CHKFRQ_DONE_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_CHKFRQ_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_CHKFRQ_DONE_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_CHKFRQ_DONE_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_CAL_RDY_MASK (0x40U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_CAL_RDY_SHIFT (6U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_CAL_RDY_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_CAL_RDY(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_CAL_RDY_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_CAL_RDY_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_R_LANES_MASK (0x80U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_R_LANES_SHIFT (7U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_R_LANES_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_R_LANES(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_R_LANES_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_R_LANES_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_L_LANES_MASK (0x100U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_L_LANES_SHIFT (8U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_L_LANES_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_L_LANES(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_L_LANES_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_L_LANES_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_MASK (0x200U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_SHIFT (9U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_MASK)

#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_MASK (0x400U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_SHIFT (10U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_SHIFT)) & X2_SUP_DIG_MPLLA_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_MASK)

