zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUP_ANA_MPLLA_OVRD_ovrd_reset_MASK    (0x40U)
#define X2_SUP_ANA_MPLLA_OVRD_ovrd_reset_SHIFT   (6U)
#define X2_SUP_ANA_MPLLA_OVRD_ovrd_reset_WIDTH   (1U)
#define X2_SUP_ANA_MPLLA_OVRD_ovrd_reset(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_OVRD_ovrd_reset_SHIFT)) & X2_SUP_ANA_MPLLA_OVRD_ovrd_reset_MASK)

#define X2_SUP_ANA_MPLLA_OVRD_reset_reg_MASK     (0x80U)
#define X2_SUP_ANA_MPLLA_OVRD_reset_reg_SHIFT    (7U)
#define X2_SUP_ANA_MPLLA_OVRD_reset_reg_WIDTH    (1U)
#define X2_SUP_ANA_MPLLA_OVRD_reset_reg(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_OVRD_reset_reg_SHIFT)) & X2_SUP_ANA_MPLLA_OVRD_reset_reg_MASK)

#define X2_SUP_ANA_MPLLA_OVRD_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUP_ANA_MPLLA_OVRD_RESERVED_15_8_SHIFT (8U)
#define X2_SUP_ANA_MPLLA_OVRD_RESERVED_15_8_WIDTH (8U)
#define X2_SUP_ANA_MPLLA_OVRD_RESERVED_15_8(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_OVRD_RESERVED_15_8_SHIFT)) & X2_SUP_ANA_MPLLA_OVRD_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUP_ANA_MPLLA_ATB1 - MPLLA_ATB1 */
/*! @{ */

#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_vco_MASK (0x1U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_vco_SHIFT (0U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_vco_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_vco(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB1_override_vreg_vco_SHIFT)) & X2_SUP_ANA_MPLLA_ATB1_override_vreg_vco_MASK)

#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_right_MASK (0x2U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_right_SHIFT (1U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_right_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_right(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB1_override_vreg_right_SHIFT)) & X2_SUP_ANA_MPLLA_ATB1_override_vreg_right_MASK)

#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_left_MASK (0x4U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_left_SHIFT (2U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_left_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_left(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB1_override_vreg_left_SHIFT)) & X2_SUP_ANA_MPLLA_ATB1_override_vreg_left_MASK)

#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_vp_MASK (0x8U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_vp_SHIFT (3U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_vp_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_vp(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB1_override_vreg_vp_SHIFT)) & X2_SUP_ANA_MPLLA_ATB1_override_vreg_vp_MASK)

#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_cp_MASK (0x10U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_cp_SHIFT (4U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_cp_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB1_override_vreg_cp(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB1_override_vreg_cp_SHIFT)) & X2_SUP_ANA_MPLLA_ATB1_override_vreg_cp_MASK)

#define X2_SUP_ANA_MPLLA_ATB1_meas_vreg_vco_MASK (0x20U)
#define X2_SUP_ANA_MPLLA_ATB1_meas_vreg_vco_SHIFT (5U)
#define X2_SUP_ANA_MPLLA_ATB1_meas_vreg_vco_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB1_meas_vreg_vco(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB1_meas_vreg_vco_SHIFT)) & X2_SUP_ANA_MPLLA_ATB1_meas_vreg_vco_MASK)

#define X2_SUP_ANA_MPLLA_ATB1_meas_vreg_s_MASK   (0x40U)
#define X2_SUP_ANA_MPLLA_ATB1_meas_vreg_s_SHIFT  (6U)
#define X2_SUP_ANA_MPLLA_ATB1_meas_vreg_s_WIDTH  (1U)
#define X2_SUP_ANA_MPLLA_ATB1_meas_vreg_s(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB1_meas_vreg_s_SHIFT)) & X2_SUP_ANA_MPLLA_ATB1_meas_vreg_s_MASK)

#define X2_SUP_ANA_MPLLA_ATB1_meas_vreg_l_MASK   (0x80U)
#define X2_SUP_ANA_MPLLA_ATB1_meas_vreg_l_SHIFT  (7U)
#define X2_SUP_ANA_MPLLA_ATB1_meas_vreg_l_WIDTH  (1U)
#define X2_SUP_ANA_MPLLA_ATB1_meas_vreg_l(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB1_meas_vreg_l_SHIFT)) & X2_SUP_ANA_MPLLA_ATB1_meas_vreg_l_MASK)

#define X2_SUP_ANA_MPLLA_ATB1_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUP_ANA_MPLLA_ATB1_RESERVED_15_8_SHIFT (8U)
#define X2_SUP_ANA_MPLLA_ATB1_RESERVED_15_8_WIDTH (8U)
#define X2_SUP_ANA_MPLLA_ATB1_RESERVED_15_8(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB1_RESERVED_15_8_SHIFT)) & X2_SUP_ANA_MPLLA_ATB1_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUP_ANA_MPLLA_ATB2 - MPLLA_ATB2 */
/*! @{ */

#define X2_SUP_ANA_MPLLA_ATB2_meas_vreg_r_MASK   (0x1U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_vreg_r_SHIFT  (0U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_vreg_r_WIDTH  (1U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_vreg_r(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB2_meas_vreg_r_SHIFT)) & X2_SUP_ANA_MPLLA_ATB2_meas_vreg_r_MASK)

#define X2_SUP_ANA_MPLLA_ATB2_meas_vreg_vp_MASK  (0x2U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_vreg_vp_SHIFT (1U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_vreg_vp_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_vreg_vp(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB2_meas_vreg_vp_SHIFT)) & X2_SUP_ANA_MPLLA_ATB2_meas_vreg_vp_MASK)

#define X2_SUP_ANA_MPLLA_ATB2_meas_vreg_cp_MASK  (0x4U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_vreg_cp_SHIFT (2U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_vreg_cp_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_vreg_cp(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB2_meas_vreg_cp_SHIFT)) & X2_SUP_ANA_MPLLA_ATB2_meas_vreg_cp_MASK)

#define X2_SUP_ANA_MPLLA_ATB2_meas_vp_MASK       (0x8U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_vp_SHIFT      (3U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_vp_WIDTH      (1U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_vp(x)         (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB2_meas_vp_SHIFT)) & X2_SUP_ANA_MPLLA_ATB2_meas_vp_MASK)

#define X2_SUP_ANA_MPLLA_ATB2_meas_gd_MASK       (0x10U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_gd_SHIFT      (4U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_gd_WIDTH      (1U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_gd(x)         (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB2_meas_gd_SHIFT)) & X2_SUP_ANA_MPLLA_ATB2_meas_gd_MASK)

#define X2_SUP_ANA_MPLLA_ATB2_meas_ctl_fine_MASK (0x20U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_ctl_fine_SHIFT (5U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_ctl_fine_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_ctl_fine(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB2_meas_ctl_fine_SHIFT)) & X2_SUP_ANA_MPLLA_ATB2_meas_ctl_fine_MASK)

