zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUP_ANA_MPLLA_ATB2_meas_mag_ctrl_MASK (0x40U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_mag_ctrl_SHIFT (6U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_mag_ctrl_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_mag_ctrl(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB2_meas_mag_ctrl_SHIFT)) & X2_SUP_ANA_MPLLA_ATB2_meas_mag_ctrl_MASK)

#define X2_SUP_ANA_MPLLA_ATB2_meas_mag_ref_MASK  (0x80U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_mag_ref_SHIFT (7U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_mag_ref_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB2_meas_mag_ref(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB2_meas_mag_ref_SHIFT)) & X2_SUP_ANA_MPLLA_ATB2_meas_mag_ref_MASK)

#define X2_SUP_ANA_MPLLA_ATB2_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUP_ANA_MPLLA_ATB2_RESERVED_15_8_SHIFT (8U)
#define X2_SUP_ANA_MPLLA_ATB2_RESERVED_15_8_WIDTH (8U)
#define X2_SUP_ANA_MPLLA_ATB2_RESERVED_15_8(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB2_RESERVED_15_8_SHIFT)) & X2_SUP_ANA_MPLLA_ATB2_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUP_ANA_MPLLA_ATB3 - MPLLA_ATB3 */
/*! @{ */

#define X2_SUP_ANA_MPLLA_ATB3_force_fine_high_MASK (0x1U)
#define X2_SUP_ANA_MPLLA_ATB3_force_fine_high_SHIFT (0U)
#define X2_SUP_ANA_MPLLA_ATB3_force_fine_high_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB3_force_fine_high(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB3_force_fine_high_SHIFT)) & X2_SUP_ANA_MPLLA_ATB3_force_fine_high_MASK)

#define X2_SUP_ANA_MPLLA_ATB3_force_fine_low_MASK (0x2U)
#define X2_SUP_ANA_MPLLA_ATB3_force_fine_low_SHIFT (1U)
#define X2_SUP_ANA_MPLLA_ATB3_force_fine_low_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB3_force_fine_low(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB3_force_fine_low_SHIFT)) & X2_SUP_ANA_MPLLA_ATB3_force_fine_low_MASK)

#define X2_SUP_ANA_MPLLA_ATB3_override_amp_atb_MASK (0x4U)
#define X2_SUP_ANA_MPLLA_ATB3_override_amp_atb_SHIFT (2U)
#define X2_SUP_ANA_MPLLA_ATB3_override_amp_atb_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB3_override_amp_atb(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB3_override_amp_atb_SHIFT)) & X2_SUP_ANA_MPLLA_ATB3_override_amp_atb_MASK)

#define X2_SUP_ANA_MPLLA_ATB3_override_amp_high_MASK (0x8U)
#define X2_SUP_ANA_MPLLA_ATB3_override_amp_high_SHIFT (3U)
#define X2_SUP_ANA_MPLLA_ATB3_override_amp_high_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB3_override_amp_high(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB3_override_amp_high_SHIFT)) & X2_SUP_ANA_MPLLA_ATB3_override_amp_high_MASK)

#define X2_SUP_ANA_MPLLA_ATB3_override_amp_low_MASK (0x10U)
#define X2_SUP_ANA_MPLLA_ATB3_override_amp_low_SHIFT (4U)
#define X2_SUP_ANA_MPLLA_ATB3_override_amp_low_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB3_override_amp_low(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB3_override_amp_low_SHIFT)) & X2_SUP_ANA_MPLLA_ATB3_override_amp_low_MASK)

#define X2_SUP_ANA_MPLLA_ATB3_meas_atb_dll_bias_MASK (0x20U)
#define X2_SUP_ANA_MPLLA_ATB3_meas_atb_dll_bias_SHIFT (5U)
#define X2_SUP_ANA_MPLLA_ATB3_meas_atb_dll_bias_WIDTH (1U)
#define X2_SUP_ANA_MPLLA_ATB3_meas_atb_dll_bias(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB3_meas_atb_dll_bias_SHIFT)) & X2_SUP_ANA_MPLLA_ATB3_meas_atb_dll_bias_MASK)

#define X2_SUP_ANA_MPLLA_ATB3_atb_select_MASK    (0x40U)
#define X2_SUP_ANA_MPLLA_ATB3_atb_select_SHIFT   (6U)
#define X2_SUP_ANA_MPLLA_ATB3_atb_select_WIDTH   (1U)
#define X2_SUP_ANA_MPLLA_ATB3_atb_select(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB3_atb_select_SHIFT)) & X2_SUP_ANA_MPLLA_ATB3_atb_select_MASK)

#define X2_SUP_ANA_MPLLA_ATB3_NC7_MASK           (0x80U)
#define X2_SUP_ANA_MPLLA_ATB3_NC7_SHIFT          (7U)
#define X2_SUP_ANA_MPLLA_ATB3_NC7_WIDTH          (1U)
#define X2_SUP_ANA_MPLLA_ATB3_NC7(x)             (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB3_NC7_SHIFT)) & X2_SUP_ANA_MPLLA_ATB3_NC7_MASK)

#define X2_SUP_ANA_MPLLA_ATB3_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUP_ANA_MPLLA_ATB3_RESERVED_15_8_SHIFT (8U)
#define X2_SUP_ANA_MPLLA_ATB3_RESERVED_15_8_WIDTH (8U)
#define X2_SUP_ANA_MPLLA_ATB3_RESERVED_15_8(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUP_ANA_MPLLA_ATB3_RESERVED_15_8_SHIFT)) & X2_SUP_ANA_MPLLA_ATB3_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUP_DIG_ANA_MPLLA_OVRD_OUT - Override value for mplla signals going to ANA */
/*! @{ */

#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_ANA_EN_MASK (0x1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_ANA_EN_SHIFT (0U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_ANA_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_ANA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_ANA_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_ANA_EN_MASK)

#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_RST_MASK (0x2U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_RST_SHIFT (1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_RST_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_RST_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_RST_MASK)

#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_CAL_MASK (0x4U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_CAL_SHIFT (2U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_CAL_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_CAL_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_CAL_MASK)

#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_EN_MASK (0x8U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_EN_SHIFT (3U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_EN_MASK)

#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_L_EN_MASK (0x10U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_L_EN_SHIFT (4U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_L_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_L_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_L_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_L_EN_MASK)

#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_R_EN_MASK (0x20U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_R_EN_SHIFT (5U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_R_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_R_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_R_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_R_EN_MASK)

#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV8_CLK_EN_MASK (0x40U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV8_CLK_EN_SHIFT (6U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV8_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV8_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV8_CLK_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV8_CLK_EN_MASK)

#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV10_CLK_EN_MASK (0x80U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV10_CLK_EN_SHIFT (7U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV10_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV10_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV10_CLK_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV10_CLK_EN_MASK)

