zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_FBCLK_EN_MASK (0x100U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_FBCLK_EN_SHIFT (8U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_FBCLK_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_FBCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_FBCLK_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_FBCLK_EN_MASK)

#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_MASK (0x1E00U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_SHIFT (9U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_WIDTH (4U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_MASK)

#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV_CLK_EN_MASK (0x2000U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV_CLK_EN_SHIFT (13U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV_CLK_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV_CLK_EN_MASK)

#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_OVRD_SEL_MASK (0x4000U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_OVRD_SEL_SHIFT (14U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_OVRD_SEL_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_OVRD_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_OVRD_SEL_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_OVRD_SEL_MASK)

#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_15_15_MASK (0x8000U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_15_15_SHIFT (15U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_15_15_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_15_15_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_15_15_MASK)
/*! @} */

/*! @name SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT - Override value for mplla pmix signals going to ANA */
/*! @{ */

#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_MASK (0xFFU)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_SHIFT (0U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_WIDTH (8U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_MASK)

#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_MASK (0x100U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_SHIFT (8U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_MASK)

#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_OVRD_EN_MASK (0x200U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_OVRD_EN_SHIFT (9U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_OVRD_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_OVRD_EN_MASK)

#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_OVRD_EN_MASK (0x400U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_OVRD_EN_SHIFT (10U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_OVRD_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_OVRD_EN_MASK)

#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_RESERVED_15_11_MASK (0xF800U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_RESERVED_15_11_SHIFT (11U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_RESERVED_15_11_WIDTH (5U)
#define X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_RESERVED_15_11_SHIFT)) & X2_SUP_DIG_ANA_MPLLA_PMIX_OVRD_OUT_RESERVED_15_11_MASK)
/*! @} */

/*! @name RAWCMN_DIG_MPLLA_OVRD_IN - Override values for incoming MPLLA signals */
/*! @{ */

#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_WORD_DIV2_EN_OVRD_VAL_MASK (0x1U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_WORD_DIV2_EN_OVRD_VAL_SHIFT (0U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_WORD_DIV2_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_WORD_DIV2_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_WORD_DIV2_EN_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_WORD_DIV2_EN_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_WORD_DIV2_EN_OVRD_EN_MASK (0x2U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_WORD_DIV2_EN_OVRD_EN_SHIFT (1U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_WORD_DIV2_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_WORD_DIV2_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_WORD_DIV2_EN_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_WORD_DIV2_EN_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_TX_CLK_DIV_OVRD_VAL_MASK (0x1CU)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_TX_CLK_DIV_OVRD_VAL_SHIFT (2U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_TX_CLK_DIV_OVRD_VAL_WIDTH (3U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_TX_CLK_DIV_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_TX_CLK_DIV_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_TX_CLK_DIV_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_TX_CLK_DIV_OVRD_EN_MASK (0x20U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_TX_CLK_DIV_OVRD_EN_SHIFT (5U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_TX_CLK_DIV_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_TX_CLK_DIV_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_TX_CLK_DIV_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_TX_CLK_DIV_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV10_CLK_EN_OVRD_VAL_MASK (0x40U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV10_CLK_EN_OVRD_VAL_SHIFT (6U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV10_CLK_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV10_CLK_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV10_CLK_EN_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV10_CLK_EN_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV10_CLK_EN_OVRD_EN_MASK (0x80U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV10_CLK_EN_OVRD_EN_SHIFT (7U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV10_CLK_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV10_CLK_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV10_CLK_EN_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV10_CLK_EN_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV8_CLK_EN_OVRD_VAL_MASK (0x100U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV8_CLK_EN_OVRD_VAL_SHIFT (8U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV8_CLK_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV8_CLK_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV8_CLK_EN_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV8_CLK_EN_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV8_CLK_EN_OVRD_EN_MASK (0x200U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV8_CLK_EN_OVRD_EN_SHIFT (9U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV8_CLK_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV8_CLK_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV8_CLK_EN_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV8_CLK_EN_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_BW_OVRD_EN_MASK (0x400U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_BW_OVRD_EN_SHIFT (10U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_BW_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_BW_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_BW_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_BW_OVRD_EN_MASK)

