zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV16P5_CLK_EN_OVRD_EN_MASK (0x800U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV16P5_CLK_EN_OVRD_EN_SHIFT (11U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV16P5_CLK_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV16P5_CLK_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV16P5_CLK_EN_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV16P5_CLK_EN_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV16P5_CLK_EN_OVRD_VAL_MASK (0x1000U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV16P5_CLK_EN_OVRD_VAL_SHIFT (12U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV16P5_CLK_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV16P5_CLK_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV16P5_CLK_EN_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLA_OVRD_IN_MPLLA_DIV16P5_CLK_EN_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_RESERVED_15_13_MASK (0xE000U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_RESERVED_15_13_SHIFT (13U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_RESERVED_15_13_WIDTH (3U)
#define X2_RAWCMN_DIG_MPLLA_OVRD_IN_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_OVRD_IN_RESERVED_15_13_SHIFT)) & X2_RAWCMN_DIG_MPLLA_OVRD_IN_RESERVED_15_13_MASK)
/*! @} */

/*! @name RAWCMN_DIG_MPLLA_BW_OVRD_IN - Override values for incoming MPLLA bandwidth */
/*! @{ */

#define X2_RAWCMN_DIG_MPLLA_BW_OVRD_IN_MPLLA_BW_OVRD_VAL_MASK (0xFFFFU)
#define X2_RAWCMN_DIG_MPLLA_BW_OVRD_IN_MPLLA_BW_OVRD_VAL_SHIFT (0U)
#define X2_RAWCMN_DIG_MPLLA_BW_OVRD_IN_MPLLA_BW_OVRD_VAL_WIDTH (16U)
#define X2_RAWCMN_DIG_MPLLA_BW_OVRD_IN_MPLLA_BW_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_BW_OVRD_IN_MPLLA_BW_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLA_BW_OVRD_IN_MPLLA_BW_OVRD_VAL_MASK)
/*! @} */

/*! @name RAWCMN_DIG_LANE_FSM_OP_XTND - Lane FSM OP XTND control register */
/*! @{ */

#define X2_RAWCMN_DIG_LANE_FSM_OP_XTND_data_MASK (0x1U)
#define X2_RAWCMN_DIG_LANE_FSM_OP_XTND_data_SHIFT (0U)
#define X2_RAWCMN_DIG_LANE_FSM_OP_XTND_data_WIDTH (1U)
#define X2_RAWCMN_DIG_LANE_FSM_OP_XTND_data(x)   (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_LANE_FSM_OP_XTND_data_SHIFT)) & X2_RAWCMN_DIG_LANE_FSM_OP_XTND_data_MASK)

#define X2_RAWCMN_DIG_LANE_FSM_OP_XTND_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWCMN_DIG_LANE_FSM_OP_XTND_RESERVED_15_1_SHIFT (1U)
#define X2_RAWCMN_DIG_LANE_FSM_OP_XTND_RESERVED_15_1_WIDTH (15U)
#define X2_RAWCMN_DIG_LANE_FSM_OP_XTND_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_LANE_FSM_OP_XTND_RESERVED_15_1_SHIFT)) & X2_RAWCMN_DIG_LANE_FSM_OP_XTND_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1 - Override values for incoming MPLLA SSC control settings */
/*! @{ */

#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_MPLLA_FRACN_CTRL_OVRD_VAL_MASK (0x7FFU)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_MPLLA_FRACN_CTRL_OVRD_VAL_SHIFT (0U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_MPLLA_FRACN_CTRL_OVRD_VAL_WIDTH (11U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_MPLLA_FRACN_CTRL_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_MPLLA_FRACN_CTRL_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_MPLLA_FRACN_CTRL_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_MPLLA_FRACN_CTRL_OVRD_EN_MASK (0x800U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_MPLLA_FRACN_CTRL_OVRD_EN_SHIFT (11U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_MPLLA_FRACN_CTRL_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_MPLLA_FRACN_CTRL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_MPLLA_FRACN_CTRL_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_MPLLA_FRACN_CTRL_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_RESERVED_15_12_MASK (0xF000U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_RESERVED_15_12_SHIFT (12U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_RESERVED_15_12_WIDTH (4U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_RESERVED_15_12_SHIFT)) & X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_1_RESERVED_15_12_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLB_DIV_CLK_OVRD_IN - Override values for incoming MPLLB_DIV_CLK controls from ASIC */
/*! @{ */

#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_CLK_EN_MASK (0x1U)
#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_CLK_EN_SHIFT (0U)
#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_CLK_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_CLK_EN_SHIFT)) & X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_CLK_EN_MASK)

#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_MULTIPLIER_MASK (0x1FEU)
#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_MULTIPLIER_SHIFT (1U)
#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_MULTIPLIER_WIDTH (8U)
#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_MULTIPLIER(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_MULTIPLIER_SHIFT)) & X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_MULTIPLIER_MASK)

#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_OVRD_EN_MASK (0x200U)
#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_OVRD_EN_SHIFT (9U)
#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_OVRD_EN_SHIFT)) & X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_OVRD_EN_MASK)

#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_RESERVED_15_10_SHIFT (10U)
#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_RESERVED_15_10_WIDTH (6U)
#define X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_RESERVED_15_10_SHIFT)) & X2_SUP_DIG_MPLLB_DIV_CLK_OVRD_IN_RESERVED_15_10_MASK)
/*! @} */

