zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_SHIFT (10U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_WIDTH (6U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT - MPLL status register */
/*! @{ */

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_FSM_STATE_MASK (0xFU)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_FSM_STATE_SHIFT (0U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_FSM_STATE_WIDTH (4U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_FSM_STATE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_FSM_STATE_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_FSM_STATE_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_TOOSLOW_MASK (0x10U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_TOOSLOW_SHIFT (4U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_TOOSLOW_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_TOOSLOW(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_TOOSLOW_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_TOOSLOW_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_CHKFRQ_DONE_MASK (0x20U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_CHKFRQ_DONE_SHIFT (5U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_CHKFRQ_DONE_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_CHKFRQ_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_CHKFRQ_DONE_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_CHKFRQ_DONE_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_RDY_MASK (0x40U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_RDY_SHIFT (6U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_RDY_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_RDY(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_RDY_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_RDY_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_R_LANES_MASK (0x80U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_R_LANES_SHIFT (7U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_R_LANES_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_R_LANES(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_R_LANES_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_R_LANES_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_L_LANES_MASK (0x100U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_L_LANES_SHIFT (8U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_L_LANES_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_L_LANES(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_L_LANES_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_L_LANES_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_MASK (0x200U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_SHIFT (9U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_MASK (0x400U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_SHIFT (10U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_FBCLK_EN_MASK (0x800U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_FBCLK_EN_SHIFT (11U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_FBCLK_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_FBCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_FBCLK_EN_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_FBCLK_EN_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_MASK (0x1000U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_SHIFT (12U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_RST_MASK (0x2000U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_RST_SHIFT (13U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_RST_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_RST_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_RST_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_ANA_EN_MASK (0x4000U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_ANA_EN_SHIFT (14U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_ANA_EN_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_ANA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_ANA_EN_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_ANA_EN_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_RESERVED_15_15_MASK (0x8000U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_RESERVED_15_15_SHIFT (15U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_RESERVED_15_15_WIDTH (1U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_RESERVED_15_15_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_STAT_RESERVED_15_15_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD - Thresholds for MPLL CAL Update timer and MPLL VCO Stabilization timer */
/*! @{ */

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_VCO_STABILIZATION_TIME_THRESHOLD_MASK (0x1FFU)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_VCO_STABILIZATION_TIME_THRESHOLD_SHIFT (0U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_VCO_STABILIZATION_TIME_THRESHOLD_WIDTH (9U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_VCO_STABILIZATION_TIME_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_VCO_STABILIZATION_TIME_THRESHOLD_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_VCO_STABILIZATION_TIME_THRESHOLD_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_MPLL_CAL_UPDATE_TIME_THRESHOLD_MASK (0x1E00U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_MPLL_CAL_UPDATE_TIME_THRESHOLD_SHIFT (9U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_MPLL_CAL_UPDATE_TIME_THRESHOLD_WIDTH (4U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_MPLL_CAL_UPDATE_TIME_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_MPLL_CAL_UPDATE_TIME_THRESHOLD_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_MPLL_CAL_UPDATE_TIME_THRESHOLD_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_RESERVED_15_13_MASK (0xE000U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_RESERVED_15_13_SHIFT (13U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_RESERVED_15_13_WIDTH (3U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_RESERVED_15_13_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_RESERVED_15_13_MASK)
/*! @} */

/*! @name SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD - Thresholds for PCLK enable and MPLL VCO Clock Stabilization timer */
/*! @{ */

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_VCO_CLK_STABILIZATION_TIME_THRESHOLD_MASK (0x7FFU)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_VCO_CLK_STABILIZATION_TIME_THRESHOLD_SHIFT (0U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_VCO_CLK_STABILIZATION_TIME_THRESHOLD_WIDTH (11U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_VCO_CLK_STABILIZATION_TIME_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_VCO_CLK_STABILIZATION_TIME_THRESHOLD_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_VCO_CLK_STABILIZATION_TIME_THRESHOLD_MASK)

#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_PCLK_EN_TIME_THRESHOLD_MASK (0xF800U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_PCLK_EN_TIME_THRESHOLD_SHIFT (11U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_PCLK_EN_TIME_THRESHOLD_WIDTH (5U)
#define X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_PCLK_EN_TIME_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_PCLK_EN_TIME_THRESHOLD_SHIFT)) & X2_SUP_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_PCLK_EN_TIME_THRESHOLD_MASK)
/*! @} */

