zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT - Override value for mpllb pmix signals going to ANA */
/*! @{ */

#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_MASK (0xFFU)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_SHIFT (0U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_WIDTH (8U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_SHIFT)) & X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_MASK)

#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_MASK (0x100U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_SHIFT (8U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_MASK)

#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_OVRD_EN_MASK (0x200U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_OVRD_EN_SHIFT (9U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_OVRD_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_OVRD_EN_MASK)

#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_OVRD_EN_MASK (0x400U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_OVRD_EN_SHIFT (10U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_OVRD_EN_WIDTH (1U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_OVRD_EN_SHIFT)) & X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_OVRD_EN_MASK)

#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_RESERVED_15_11_MASK (0xF800U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_RESERVED_15_11_SHIFT (11U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_RESERVED_15_11_WIDTH (5U)
#define X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_RESERVED_15_11_SHIFT)) & X2_SUP_DIG_ANA_MPLLB_PMIX_OVRD_OUT_RESERVED_15_11_MASK)
/*! @} */

/*! @name RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0 - Override values for incoming MPLLA SSC control settings */
/*! @{ */

#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_RANGE_OVRD_VAL_MASK (0x7U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_RANGE_OVRD_VAL_SHIFT (0U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_RANGE_OVRD_VAL_WIDTH (3U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_RANGE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_RANGE_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_RANGE_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_RANGE_OVRD_EN_MASK (0x8U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_RANGE_OVRD_EN_SHIFT (3U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_RANGE_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_RANGE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_RANGE_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_RANGE_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_CLK_SEL_OVRD_VAL_MASK (0x70U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_CLK_SEL_OVRD_VAL_SHIFT (4U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_CLK_SEL_OVRD_VAL_WIDTH (3U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_CLK_SEL_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_CLK_SEL_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_CLK_SEL_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_CLK_SEL_OVRD_EN_MASK (0x80U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_CLK_SEL_OVRD_EN_SHIFT (7U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_CLK_SEL_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_CLK_SEL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_CLK_SEL_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_CLK_SEL_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_EN_OVRD_VAL_MASK (0x100U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_EN_OVRD_VAL_SHIFT (8U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_EN_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_EN_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_EN_OVRD_EN_MASK (0x200U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_EN_OVRD_EN_SHIFT (9U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_EN_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_MPLLA_SSC_EN_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_RESERVED_15_10_SHIFT (10U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_RESERVED_15_10_WIDTH (6U)
#define X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_RESERVED_15_10_SHIFT)) & X2_RAWCMN_DIG_MPLLA_SSC_CTL_OVRD_IN_0_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWCMN_DIG_MPLLB_OVRD_IN - Override values for incoming MPLLB signals */
/*! @{ */

#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_WORD_DIV2_EN_OVRD_VAL_MASK (0x1U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_WORD_DIV2_EN_OVRD_VAL_SHIFT (0U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_WORD_DIV2_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_WORD_DIV2_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_WORD_DIV2_EN_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_WORD_DIV2_EN_OVRD_VAL_MASK)

