zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_WORD_DIV2_EN_OVRD_EN_MASK (0x2U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_WORD_DIV2_EN_OVRD_EN_SHIFT (1U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_WORD_DIV2_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_WORD_DIV2_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_WORD_DIV2_EN_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_WORD_DIV2_EN_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_TX_CLK_DIV_OVRD_VAL_MASK (0x1CU)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_TX_CLK_DIV_OVRD_VAL_SHIFT (2U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_TX_CLK_DIV_OVRD_VAL_WIDTH (3U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_TX_CLK_DIV_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_TX_CLK_DIV_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_TX_CLK_DIV_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_TX_CLK_DIV_OVRD_EN_MASK (0x20U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_TX_CLK_DIV_OVRD_EN_SHIFT (5U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_TX_CLK_DIV_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_TX_CLK_DIV_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_TX_CLK_DIV_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_TX_CLK_DIV_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV10_CLK_EN_OVRD_VAL_MASK (0x40U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV10_CLK_EN_OVRD_VAL_SHIFT (6U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV10_CLK_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV10_CLK_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV10_CLK_EN_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV10_CLK_EN_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV10_CLK_EN_OVRD_EN_MASK (0x80U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV10_CLK_EN_OVRD_EN_SHIFT (7U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV10_CLK_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV10_CLK_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV10_CLK_EN_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV10_CLK_EN_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV8_CLK_EN_OVRD_VAL_MASK (0x100U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV8_CLK_EN_OVRD_VAL_SHIFT (8U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV8_CLK_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV8_CLK_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV8_CLK_EN_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV8_CLK_EN_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV8_CLK_EN_OVRD_EN_MASK (0x200U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV8_CLK_EN_OVRD_EN_SHIFT (9U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV8_CLK_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV8_CLK_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV8_CLK_EN_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_DIV8_CLK_EN_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_BW_OVRD_EN_MASK (0x400U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_BW_OVRD_EN_SHIFT (10U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_BW_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_BW_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_BW_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLB_OVRD_IN_MPLLB_BW_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_RESERVED_15_11_MASK (0xF800U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_RESERVED_15_11_SHIFT (11U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_RESERVED_15_11_WIDTH (5U)
#define X2_RAWCMN_DIG_MPLLB_OVRD_IN_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_OVRD_IN_RESERVED_15_11_SHIFT)) & X2_RAWCMN_DIG_MPLLB_OVRD_IN_RESERVED_15_11_MASK)
/*! @} */

/*! @name RAWCMN_DIG_MPLLB_BW_OVRD_IN - Override values for incoming MPLLB bandwidth */
/*! @{ */

#define X2_RAWCMN_DIG_MPLLB_BW_OVRD_IN_MPLLB_BW_OVRD_VAL_MASK (0xFFFFU)
#define X2_RAWCMN_DIG_MPLLB_BW_OVRD_IN_MPLLB_BW_OVRD_VAL_SHIFT (0U)
#define X2_RAWCMN_DIG_MPLLB_BW_OVRD_IN_MPLLB_BW_OVRD_VAL_WIDTH (16U)
#define X2_RAWCMN_DIG_MPLLB_BW_OVRD_IN_MPLLB_BW_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_BW_OVRD_IN_MPLLB_BW_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLB_BW_OVRD_IN_MPLLB_BW_OVRD_VAL_MASK)
/*! @} */

/*! @name RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1 - Override values for incoming MPLLB SSC control settings */
/*! @{ */

#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_MPLLB_FRACN_CTRL_OVRD_VAL_MASK (0x7FFU)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_MPLLB_FRACN_CTRL_OVRD_VAL_SHIFT (0U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_MPLLB_FRACN_CTRL_OVRD_VAL_WIDTH (11U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_MPLLB_FRACN_CTRL_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_MPLLB_FRACN_CTRL_OVRD_VAL_SHIFT)) & X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_MPLLB_FRACN_CTRL_OVRD_VAL_MASK)

#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_MPLLB_FRACN_CTRL_OVRD_EN_MASK (0x800U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_MPLLB_FRACN_CTRL_OVRD_EN_SHIFT (11U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_MPLLB_FRACN_CTRL_OVRD_EN_WIDTH (1U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_MPLLB_FRACN_CTRL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_MPLLB_FRACN_CTRL_OVRD_EN_SHIFT)) & X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_MPLLB_FRACN_CTRL_OVRD_EN_MASK)

#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_RESERVED_15_12_MASK (0xF000U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_RESERVED_15_12_SHIFT (12U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_RESERVED_15_12_WIDTH (4U)
#define X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_RESERVED_15_12_SHIFT)) & X2_RAWCMN_DIG_MPLLB_SSC_CTL_OVRD_IN_1_RESERVED_15_12_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_LANE_OVRD_IN - Override values for incoming LANE controls from ASIC */
/*! @{ */

#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_LANE_TX2RX_SER_LB_MASK (0x1U)
#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_LANE_TX2RX_SER_LB_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_LANE_TX2RX_SER_LB_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_LANE_TX2RX_SER_LB(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_LANE_OVRD_IN_LANE_TX2RX_SER_LB_SHIFT)) & X2_LANE0_DIG_ASIC_LANE_OVRD_IN_LANE_TX2RX_SER_LB_MASK)

