zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_LANE_RX2TX_PAR_LB_MASK (0x2U)
#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_LANE_RX2TX_PAR_LB_SHIFT (1U)
#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_LANE_RX2TX_PAR_LB_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_LANE_RX2TX_PAR_LB(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_LANE_OVRD_IN_LANE_RX2TX_PAR_LB_SHIFT)) & X2_LANE0_DIG_ASIC_LANE_OVRD_IN_LANE_RX2TX_PAR_LB_MASK)

#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_EN_MASK   (0x4U)
#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_EN_SHIFT  (2U)
#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_EN_WIDTH  (1U)
#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_EN(x)     (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_LANE_OVRD_IN_EN_SHIFT)) & X2_LANE0_DIG_ASIC_LANE_OVRD_IN_EN_MASK)

#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_RESERVED_15_3_MASK (0xFFF8U)
#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_RESERVED_15_3_SHIFT (3U)
#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_RESERVED_15_3_WIDTH (13U)
#define X2_LANE0_DIG_ASIC_LANE_OVRD_IN_RESERVED_15_3(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_LANE_OVRD_IN_RESERVED_15_3_SHIFT)) & X2_LANE0_DIG_ASIC_LANE_OVRD_IN_RESERVED_15_3_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_TX_OVRD_IN_0 - Override values for incoming TX controls from ASIC, register #0 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_REQ_MASK  (0x1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_REQ_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_REQ_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_REQ(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_REQ_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_REQ_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_REQ_OVRD_EN_MASK (0x2U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_REQ_OVRD_EN_SHIFT (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_REQ_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_REQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_REQ_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_REQ_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_PSTATE_MASK (0xCU)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_PSTATE_SHIFT (2U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_PSTATE_WIDTH (2U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_PSTATE_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_PSTATE_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_PSTATE_OVRD_EN_MASK (0x10U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_PSTATE_OVRD_EN_SHIFT (4U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_PSTATE_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_PSTATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_PSTATE_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_PSTATE_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_RATE_MASK (0xE0U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_RATE_SHIFT (5U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_RATE_WIDTH (3U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_RATE(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_RATE_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_RATE_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_RATE_OVRD_EN_MASK (0x100U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_RATE_OVRD_EN_SHIFT (8U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_RATE_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_RATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_RATE_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_RATE_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_WIDTH_MASK (0x600U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_WIDTH_SHIFT (9U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_WIDTH_WIDTH (2U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_WIDTH(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_WIDTH_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_WIDTH_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_WIDTH_OVRD_EN_MASK (0x800U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_WIDTH_OVRD_EN_SHIFT (11U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_WIDTH_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_WIDTH_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_WIDTH_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_WIDTH_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_MASK (0x1000U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_SHIFT (12U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_OVRD_EN_MASK (0x2000U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_OVRD_EN_SHIFT (13U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_MASK (0x4000U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_SHIFT (14U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_DATA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_OVRD_EN_MASK (0x8000U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_OVRD_EN_SHIFT (15U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_OVRD_EN_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_TX_OVRD_IN_1 - Override values for incoming TX drive controls from ASIC, register #1 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_NYQUIST_DATA_MASK (0x1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_NYQUIST_DATA_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_NYQUIST_DATA_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_NYQUIST_DATA(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_NYQUIST_DATA_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_NYQUIST_DATA_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_DISABLE_MASK (0x2U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_DISABLE_SHIFT (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_DISABLE_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_DISABLE_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_DISABLE_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_BEACON_EN_MASK (0x4U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_BEACON_EN_SHIFT (2U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_BEACON_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_BEACON_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_BEACON_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_BEACON_EN_MASK)

