zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_IBOOST_LVL_MASK (0x78U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_IBOOST_LVL_SHIFT (3U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_IBOOST_LVL_WIDTH (4U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_IBOOST_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_IBOOST_LVL_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_IBOOST_LVL_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_VBOOST_EN_MASK (0x80U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_VBOOST_EN_SHIFT (7U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_VBOOST_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_VBOOST_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_VBOOST_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_VBOOST_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_EN_MASK   (0x100U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_EN_SHIFT  (8U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_EN_WIDTH  (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_EN(x)     (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_TX_MAIN_CURSOR_MASK (0x7E00U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_TX_MAIN_CURSOR_SHIFT (9U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_TX_MAIN_CURSOR_WIDTH (6U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_TX_MAIN_CURSOR(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_TX_MAIN_CURSOR_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_TX_MAIN_CURSOR_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_MAIN_OVRD_EN_MASK (0x8000U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_MAIN_OVRD_EN_SHIFT (15U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_MAIN_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_MAIN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_MAIN_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_1_MAIN_OVRD_EN_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_TX_OVRD_IN_2 - Override values for incoming TX drive controls from ASIC, register #2 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_TX_PRE_CURSOR_MASK (0x3FU)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_TX_PRE_CURSOR_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_TX_PRE_CURSOR_WIDTH (6U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_TX_PRE_CURSOR(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_TX_PRE_CURSOR_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_TX_PRE_CURSOR_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_PRE_OVRD_EN_MASK (0x40U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_PRE_OVRD_EN_SHIFT (6U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_PRE_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_PRE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_PRE_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_PRE_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_TX_POST_CURSOR_MASK (0x1F80U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_TX_POST_CURSOR_SHIFT (7U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_TX_POST_CURSOR_WIDTH (6U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_TX_POST_CURSOR(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_TX_POST_CURSOR_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_TX_POST_CURSOR_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_POST_OVRD_EN_MASK (0x2000U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_POST_OVRD_EN_SHIFT (13U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_POST_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_POST_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_POST_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_POST_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_RESERVED_15_14_MASK (0xC000U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_RESERVED_15_14_SHIFT (14U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_RESERVED_15_14_WIDTH (2U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_RESERVED_15_14_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_2_RESERVED_15_14_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_TX_OVRD_IN_3 - Override values for incoming TX drive controls from ASIC, register #3 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_MASK (0x1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_OVRD_EN_MASK (0x2U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_OVRD_EN_SHIFT (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_MASK (0x4U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_SHIFT (2U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_OVRD_EN_MASK (0x8U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_OVRD_EN_SHIFT (3U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_INVERT_MASK (0x10U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_INVERT_SHIFT (4U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_INVERT_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_INVERT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_INVERT_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_INVERT_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_INVERT_OVRD_EN_MASK (0x20U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_INVERT_OVRD_EN_SHIFT (5U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_INVERT_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_INVERT_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_INVERT_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_INVERT_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_LPD_MASK  (0x40U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_LPD_SHIFT (6U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_LPD_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_LPD(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_LPD_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_LPD_MASK)

