zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_LPD_OVRD_EN_MASK (0x80U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_LPD_OVRD_EN_SHIFT (7U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_LPD_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_LPD_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_LPD_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_LPD_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_RESERVED_15_8_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_3_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_TX_OVRD_IN_4 - Override values for incoming TX drive controls from ASIC, register #4 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESET_MASK (0x1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESET_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESET_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESET(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESET_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESET_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESET_OVRD_EN_MASK (0x2U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESET_OVRD_EN_SHIFT (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESET_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESET_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESET_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESET_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESERVED_15_2_MASK (0xFFFCU)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESERVED_15_2_SHIFT (2U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESERVED_15_2_WIDTH (14U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESERVED_15_2_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_IN_4_RESERVED_15_2_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_TX_OVRD_OUT - Override values for outgoing TX controls to ASIC */
/*! @{ */

#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_TX_ACK_MASK (0x1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_TX_ACK_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_TX_ACK_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_TX_ACK(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_OUT_TX_ACK_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_OUT_TX_ACK_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_EN_TX_ACK_MASK (0x2U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_EN_TX_ACK_SHIFT (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_EN_TX_ACK_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_EN_TX_ACK(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_OUT_EN_TX_ACK_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_OUT_EN_TX_ACK_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_DETRX_RESULT_MASK (0x4U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_DETRX_RESULT_SHIFT (2U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_DETRX_RESULT_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_DETRX_RESULT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_OUT_DETRX_RESULT_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_OUT_DETRX_RESULT_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_EN_DETRX_RESULT_MASK (0x8U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_EN_DETRX_RESULT_SHIFT (3U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_EN_DETRX_RESULT_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_EN_DETRX_RESULT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_OUT_EN_DETRX_RESULT_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_OUT_EN_DETRX_RESULT_MASK)

#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_RESERVED_15_4_MASK (0xFFF0U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_RESERVED_15_4_SHIFT (4U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_RESERVED_15_4_WIDTH (12U)
#define X2_LANE0_DIG_ASIC_TX_OVRD_OUT_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_TX_OVRD_OUT_RESERVED_15_4_SHIFT)) & X2_LANE0_DIG_ASIC_TX_OVRD_OUT_RESERVED_15_4_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_RX_OVRD_IN_0 - Override values for incoming RX controls from ASIC, register #0 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_REQ_MASK  (0x1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_REQ_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_REQ_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_REQ(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_REQ_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_REQ_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_REQ_OVRD_EN_MASK (0x2U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_REQ_OVRD_EN_SHIFT (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_REQ_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_REQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_REQ_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_REQ_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_DATA_EN_MASK (0x4U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_DATA_EN_SHIFT (2U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_DATA_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_DATA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_DATA_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_DATA_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_DATA_EN_OVRD_EN_MASK (0x8U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_DATA_EN_OVRD_EN_SHIFT (3U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_DATA_EN_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_DATA_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_DATA_EN_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_DATA_EN_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_PSTATE_MASK (0x30U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_PSTATE_SHIFT (4U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_PSTATE_WIDTH (2U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_PSTATE_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_PSTATE_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_PSTATE_OVRD_EN_MASK (0x40U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_PSTATE_OVRD_EN_SHIFT (6U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_PSTATE_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_PSTATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_PSTATE_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_PSTATE_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RATE_MASK (0x180U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RATE_SHIFT (7U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RATE_WIDTH (2U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RATE(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RATE_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RATE_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RATE_OVRD_EN_MASK (0x200U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RATE_OVRD_EN_SHIFT (9U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RATE_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RATE_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RATE_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_WIDTH_MASK (0xC00U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_WIDTH_SHIFT (10U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_WIDTH_WIDTH (2U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_WIDTH(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_WIDTH_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_WIDTH_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_WIDTH_OVRD_EN_MASK (0x1000U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_WIDTH_OVRD_EN_SHIFT (12U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_WIDTH_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_WIDTH_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_WIDTH_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_WIDTH_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RESERVED_15_13_MASK (0xE000U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RESERVED_15_13_SHIFT (13U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RESERVED_15_13_WIDTH (3U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RESERVED_15_13_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_IN_0_RESERVED_15_13_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_RX_OVRD_IN_1 - Override values for incoming RX controls from ASIC, register #1 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_1_RX_REF_LD_VAL_5_0_MASK (0x3FU)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_1_RX_REF_LD_VAL_5_0_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_1_RX_REF_LD_VAL_5_0_WIDTH (6U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_1_RX_REF_LD_VAL_5_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_IN_1_RX_REF_LD_VAL_5_0_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_IN_1_RX_REF_LD_VAL_5_0_MASK)

