zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_5_RESERVED_15_2_MASK (0xFFFCU)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_5_RESERVED_15_2_SHIFT (2U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_5_RESERVED_15_2_WIDTH (14U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_IN_5_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_IN_5_RESERVED_15_2_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_IN_5_RESERVED_15_2_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0 - Override values for incoming RX EQ controls from ASIC, register #0 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_ATT_LVL_MASK (0x7U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_ATT_LVL_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_ATT_LVL_WIDTH (3U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_ATT_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_ATT_LVL_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_ATT_LVL_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_AFE_GAIN_MASK (0x78U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_AFE_GAIN_SHIFT (3U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_AFE_GAIN_WIDTH (4U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_AFE_GAIN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_AFE_GAIN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_AFE_GAIN_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_RESERVED_MASK (0x780U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_RESERVED_SHIFT (7U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_RESERVED_WIDTH (4U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_RESERVED_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_RESERVED_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_CTLE_BOOST_MASK (0xF800U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_CTLE_BOOST_SHIFT (11U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_CTLE_BOOST_WIDTH (5U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_CTLE_BOOST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_CTLE_BOOST_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_0_EQ_CTLE_BOOST_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1 - Override values for incoming RX EQ controls from ASIC, register #1 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_DFE_TAP2_MASK (0x7FU)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_DFE_TAP2_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_DFE_TAP2_WIDTH (7U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_DFE_TAP2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_DFE_TAP2_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_DFE_TAP2_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_DFE_TAP1_MASK (0x7F80U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_DFE_TAP1_SHIFT (7U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_DFE_TAP1_WIDTH (8U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_DFE_TAP1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_DFE_TAP1_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_DFE_TAP1_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_OVRD_EN_MASK (0x8000U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_OVRD_EN_SHIFT (15U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_EQ_IN_1_EQ_OVRD_EN_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_RX_OVRD_OUT_0 - Override values for outgoing RX controls to ASIC, register #0 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ACK_MASK (0x1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ACK_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ACK_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ACK(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ACK_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ACK_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ACK_OVRD_EN_MASK (0x2U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ACK_OVRD_EN_SHIFT (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ACK_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ACK_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ACK_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ACK_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_LOS_MASK (0x4U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_LOS_SHIFT (2U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_LOS_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_LOS(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_LOS_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_LOS_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_LOS_OUT_OVRD_EN_MASK (0x8U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_LOS_OUT_OVRD_EN_SHIFT (3U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_LOS_OUT_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_LOS_OUT_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_LOS_OUT_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_LOS_OUT_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ADAPT_STS_MASK (0x30U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ADAPT_STS_SHIFT (4U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ADAPT_STS_WIDTH (2U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ADAPT_STS(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ADAPT_STS_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ADAPT_STS_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ADAPT_STS_OVRD_EN_MASK (0x40U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ADAPT_STS_OVRD_EN_SHIFT (6U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ADAPT_STS_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ADAPT_STS_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ADAPT_STS_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_ADAPT_STS_OVRD_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_RESERVED_15_7_MASK (0xFF80U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_RESERVED_15_7_SHIFT (7U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_RESERVED_15_7_WIDTH (9U)
#define X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_RESERVED_15_7(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_RESERVED_15_7_SHIFT)) & X2_LANE0_DIG_ASIC_RX_OVRD_OUT_0_RESERVED_15_7_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_LANE_ASIC_IN - Current values for incoming LANE controls from ASIC */
/*! @{ */

#define X2_LANE0_DIG_ASIC_LANE_ASIC_IN_LANE_TX2RX_SER_LB_MASK (0x1U)
#define X2_LANE0_DIG_ASIC_LANE_ASIC_IN_LANE_TX2RX_SER_LB_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_LANE_ASIC_IN_LANE_TX2RX_SER_LB_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_LANE_ASIC_IN_LANE_TX2RX_SER_LB(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_LANE_ASIC_IN_LANE_TX2RX_SER_LB_SHIFT)) & X2_LANE0_DIG_ASIC_LANE_ASIC_IN_LANE_TX2RX_SER_LB_MASK)

#define X2_LANE0_DIG_ASIC_LANE_ASIC_IN_LANE_RX2TX_PAR_LB_MASK (0x2U)
#define X2_LANE0_DIG_ASIC_LANE_ASIC_IN_LANE_RX2TX_PAR_LB_SHIFT (1U)
#define X2_LANE0_DIG_ASIC_LANE_ASIC_IN_LANE_RX2TX_PAR_LB_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_LANE_ASIC_IN_LANE_RX2TX_PAR_LB(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_LANE_ASIC_IN_LANE_RX2TX_PAR_LB_SHIFT)) & X2_LANE0_DIG_ASIC_LANE_ASIC_IN_LANE_RX2TX_PAR_LB_MASK)

#define X2_LANE0_DIG_ASIC_LANE_ASIC_IN_RESERVED_15_2_MASK (0xFFFCU)
#define X2_LANE0_DIG_ASIC_LANE_ASIC_IN_RESERVED_15_2_SHIFT (2U)
#define X2_LANE0_DIG_ASIC_LANE_ASIC_IN_RESERVED_15_2_WIDTH (14U)
#define X2_LANE0_DIG_ASIC_LANE_ASIC_IN_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_LANE_ASIC_IN_RESERVED_15_2_SHIFT)) & X2_LANE0_DIG_ASIC_LANE_ASIC_IN_RESERVED_15_2_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_TX_ASIC_IN_0 - Current values for incoming TX controls from ASIC, register #0 */
/*! @{ */

