zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESET_MASK (0x1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESET_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESET_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESET(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESET_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESET_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_INVERT_MASK (0x2U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_INVERT_SHIFT (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_INVERT_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_INVERT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_INVERT_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_INVERT_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_DATA_EN_MASK (0x4U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_DATA_EN_SHIFT (2U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_DATA_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_DATA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_DATA_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_DATA_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_REQ_MASK  (0x8U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_REQ_SHIFT (3U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_REQ_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_REQ(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_REQ_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_REQ_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_LPD_MASK  (0x10U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_LPD_SHIFT (4U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_LPD_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_LPD(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_LPD_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_LPD_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_PSTATE_MASK (0x60U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_PSTATE_SHIFT (5U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_PSTATE_WIDTH (2U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_PSTATE_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_PSTATE_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RATE_MASK (0x180U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RATE_SHIFT (7U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RATE_WIDTH (2U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RATE(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RATE_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RATE_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_WIDTH_MASK (0x600U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_WIDTH_SHIFT (9U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_WIDTH_WIDTH (2U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_WIDTH(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_WIDTH_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_WIDTH_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESERVED_MASK (0x800U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESERVED_SHIFT (11U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESERVED_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESERVED_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESERVED_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_ADAPT_AFE_EN_MASK (0x1000U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_ADAPT_AFE_EN_SHIFT (12U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_ADAPT_AFE_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_ADAPT_AFE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_ADAPT_AFE_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_ADAPT_AFE_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_ADAPT_DFE_EN_MASK (0x2000U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_ADAPT_DFE_EN_SHIFT (13U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_ADAPT_DFE_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_ADAPT_DFE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_ADAPT_DFE_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_ADAPT_DFE_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_CDR_TRACK_EN_MASK (0x4000U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_CDR_TRACK_EN_SHIFT (14U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_CDR_TRACK_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_CDR_TRACK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_CDR_TRACK_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_CDR_TRACK_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESERVED_15_15_MASK (0x8000U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESERVED_15_15_SHIFT (15U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESERVED_15_15_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESERVED_15_15_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_0_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_RX_ASIC_IN_1 - Current values for incoming RX controls from ASIC, register #1 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_CDR_SSC_EN_MASK (0x1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_CDR_SSC_EN_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_CDR_SSC_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_CDR_SSC_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_CDR_SSC_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_CDR_SSC_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_ALIGN_EN_MASK (0x2U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_ALIGN_EN_SHIFT (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_ALIGN_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_ALIGN_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_ALIGN_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_ALIGN_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_CLK_SHIFT_MASK (0x4U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_CLK_SHIFT_SHIFT (2U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_CLK_SHIFT_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_CLK_SHIFT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_CLK_SHIFT_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_CLK_SHIFT_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_DISABLE_MASK (0x8U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_DISABLE_SHIFT (3U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_DISABLE_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_DISABLE_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_DISABLE_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_LOS_THRSHLD_MASK (0x70U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_LOS_THRSHLD_SHIFT (4U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_LOS_THRSHLD_WIDTH (3U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_LOS_THRSHLD(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_LOS_THRSHLD_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_LOS_THRSHLD_MASK)

