zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_LOS_LPFS_EN_MASK (0x80U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_LOS_LPFS_EN_SHIFT (7U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_LOS_LPFS_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_LOS_LPFS_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_LOS_LPFS_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_LOS_LPFS_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RX_TERM_EN_MASK (0x100U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RX_TERM_EN_SHIFT (8U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RX_TERM_EN_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RX_TERM_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RX_TERM_EN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RX_TERM_EN_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RX_TERM_ACDC_MASK (0x200U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RX_TERM_ACDC_SHIFT (9U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RX_TERM_ACDC_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RX_TERM_ACDC(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RX_TERM_ACDC_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RX_TERM_ACDC_MASK)

#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RESERVED_15_10_MASK (0xFC00U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RESERVED_15_10_SHIFT (10U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RESERVED_15_10_WIDTH (6U)
#define X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RESERVED_15_10_SHIFT)) & X2_LANE0_DIG_ASIC_RX_ASIC_IN_1_RESERVED_15_10_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0 - Current values for incoming RX EQ controls from ASIC, register #0 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_ATT_LVL_MASK (0x7U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_ATT_LVL_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_ATT_LVL_WIDTH (3U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_ATT_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_ATT_LVL_SHIFT)) & X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_ATT_LVL_MASK)

#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_AFE_GAIN_MASK (0x78U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_AFE_GAIN_SHIFT (3U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_AFE_GAIN_WIDTH (4U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_AFE_GAIN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_AFE_GAIN_SHIFT)) & X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_AFE_GAIN_MASK)

#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_RESERVED_MASK (0x780U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_RESERVED_SHIFT (7U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_RESERVED_WIDTH (4U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_RESERVED_SHIFT)) & X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_RESERVED_MASK)

#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_CTLE_BOOST_MASK (0xF800U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_CTLE_BOOST_SHIFT (11U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_CTLE_BOOST_WIDTH (5U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_CTLE_BOOST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_CTLE_BOOST_SHIFT)) & X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_0_EQ_CTLE_BOOST_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1 - Current values for incoming RX EQ controls from ASIC, register #1 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_EQ_DFE_TAP2_MASK (0x7FU)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_EQ_DFE_TAP2_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_EQ_DFE_TAP2_WIDTH (7U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_EQ_DFE_TAP2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_EQ_DFE_TAP2_SHIFT)) & X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_EQ_DFE_TAP2_MASK)

#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_EQ_DFE_TAP1_MASK (0x7F80U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_EQ_DFE_TAP1_SHIFT (7U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_EQ_DFE_TAP1_WIDTH (8U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_EQ_DFE_TAP1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_EQ_DFE_TAP1_SHIFT)) & X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_EQ_DFE_TAP1_MASK)

#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_RESERVED_15_15_MASK (0x8000U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_RESERVED_15_15_SHIFT (15U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_RESERVED_15_15_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_RESERVED_15_15_SHIFT)) & X2_LANE0_DIG_ASIC_RX_EQ_ASIC_IN_1_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0 - Current values for incoming RX CDR VCO controls from ASIC, register #0 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RX_CDR_VCO_LOWFREQ_MASK (0x1U)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RX_CDR_VCO_LOWFREQ_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RX_CDR_VCO_LOWFREQ_WIDTH (1U)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RX_CDR_VCO_LOWFREQ(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RX_CDR_VCO_LOWFREQ_SHIFT)) & X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RX_CDR_VCO_LOWFREQ_MASK)

#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RX_REF_LD_VAL_MASK (0xFEU)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RX_REF_LD_VAL_SHIFT (1U)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RX_REF_LD_VAL_WIDTH (7U)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RX_REF_LD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RX_REF_LD_VAL_SHIFT)) & X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RX_REF_LD_VAL_MASK)

#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RESERVED_15_8_SHIFT)) & X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_0_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1 - Current values for incoming RX CDR VCO controls from ASIC, register #1 */
/*! @{ */

#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1_RX_VCO_LD_VAL_MASK (0x1FFFU)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1_RX_VCO_LD_VAL_SHIFT (0U)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1_RX_VCO_LD_VAL_WIDTH (13U)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1_RX_VCO_LD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1_RX_VCO_LD_VAL_SHIFT)) & X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1_RX_VCO_LD_VAL_MASK)

#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1_RESERVED_15_13_MASK (0xE000U)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1_RESERVED_15_13_SHIFT (13U)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1_RESERVED_15_13_WIDTH (3U)
#define X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1_RESERVED_15_13_SHIFT)) & X2_LANE0_DIG_ASIC_RX_CDR_VCO_ASIC_IN_1_RESERVED_15_13_MASK)
/*! @} */

