zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ANA_RESET_MASK (0x10U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ANA_RESET_SHIFT (4U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ANA_RESET_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ANA_RESET(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ANA_RESET_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ANA_RESET_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ANA_SERIAL_EN_MASK (0x20U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ANA_SERIAL_EN_SHIFT (5U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ANA_SERIAL_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ANA_SERIAL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ANA_SERIAL_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ANA_SERIAL_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_DIG_CLK_EN_MASK (0x40U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_DIG_CLK_EN_SHIFT (6U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_DIG_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_DIG_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_DIG_CLK_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_DIG_CLK_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_DATA_EN_MASK (0x80U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_DATA_EN_SHIFT (7U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_DATA_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_DATA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_DATA_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_DATA_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ALLOW_RXDET_MASK (0x100U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ALLOW_RXDET_SHIFT (8U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ALLOW_RXDET_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ALLOW_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ALLOW_RXDET_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_TX_P0S_ALLOW_RXDET_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_RESERVED_15_9_MASK (0xFE00U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_RESERVED_15_9_SHIFT (9U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_RESERVED_15_9_WIDTH (7U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_RESERVED_15_9_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P0S_RESERVED_15_9_MASK)
/*! @} */

/*! @name LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1 - TX Power State Control Register for P1 */
/*! @{ */

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_REFGEN_EN_MASK (0x1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_REFGEN_EN_SHIFT (0U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_REFGEN_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_REFGEN_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_REFGEN_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_REFGEN_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_VCM_HOLD_MASK (0x2U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_VCM_HOLD_SHIFT (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_VCM_HOLD_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_VCM_HOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_VCM_HOLD_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_VCM_HOLD_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_CLK_EN_MASK (0x4U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_CLK_EN_SHIFT (2U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_CLK_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_CLK_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_WORD_CLK_EN_MASK (0x8U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_WORD_CLK_EN_SHIFT (3U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_WORD_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_WORD_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_WORD_CLK_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_WORD_CLK_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_RESET_MASK (0x10U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_RESET_SHIFT (4U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_RESET_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_RESET(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_RESET_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_RESET_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_SERIAL_EN_MASK (0x20U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_SERIAL_EN_SHIFT (5U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_SERIAL_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_SERIAL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_SERIAL_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ANA_SERIAL_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_DIG_CLK_EN_MASK (0x40U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_DIG_CLK_EN_SHIFT (6U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_DIG_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_DIG_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_DIG_CLK_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_DIG_CLK_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_DATA_EN_MASK (0x80U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_DATA_EN_SHIFT (7U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_DATA_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_DATA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_DATA_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_DATA_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ALLOW_RXDET_MASK (0x100U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ALLOW_RXDET_SHIFT (8U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ALLOW_RXDET_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ALLOW_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ALLOW_RXDET_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_TX_P1_ALLOW_RXDET_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_RESERVED_15_9_MASK (0xFE00U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_RESERVED_15_9_SHIFT (9U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_RESERVED_15_9_WIDTH (7U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_RESERVED_15_9_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P1_RESERVED_15_9_MASK)
/*! @} */

/*! @name LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2 - TX Power State Control Register for P2 */
/*! @{ */

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_REFGEN_EN_MASK (0x1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_REFGEN_EN_SHIFT (0U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_REFGEN_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_REFGEN_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_REFGEN_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_REFGEN_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_VCM_HOLD_MASK (0x2U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_VCM_HOLD_SHIFT (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_VCM_HOLD_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_VCM_HOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_VCM_HOLD_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_VCM_HOLD_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_CLK_EN_MASK (0x4U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_CLK_EN_SHIFT (2U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_CLK_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_CLK_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_WORD_CLK_EN_MASK (0x8U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_WORD_CLK_EN_SHIFT (3U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_WORD_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_WORD_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_WORD_CLK_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_WORD_CLK_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_RESET_MASK (0x10U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_RESET_SHIFT (4U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_RESET_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_RESET(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_RESET_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_RESET_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_SERIAL_EN_MASK (0x20U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_SERIAL_EN_SHIFT (5U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_SERIAL_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_SERIAL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_SERIAL_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ANA_SERIAL_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_DIG_CLK_EN_MASK (0x40U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_DIG_CLK_EN_SHIFT (6U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_DIG_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_DIG_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_DIG_CLK_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_DIG_CLK_EN_MASK)

