zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_DATA_EN_MASK (0x80U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_DATA_EN_SHIFT (7U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_DATA_EN_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_DATA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_DATA_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_DATA_EN_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ALLOW_RXDET_MASK (0x100U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ALLOW_RXDET_SHIFT (8U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ALLOW_RXDET_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ALLOW_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ALLOW_RXDET_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ALLOW_RXDET_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ALLOW_VBOOST_MASK (0x200U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ALLOW_VBOOST_SHIFT (9U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ALLOW_VBOOST_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ALLOW_VBOOST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ALLOW_VBOOST_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_TX_P2_ALLOW_VBOOST_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_RESERVED_15_10_MASK (0xFC00U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_RESERVED_15_10_SHIFT (10U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_RESERVED_15_10_WIDTH (6U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_RESERVED_15_10_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PSTATE_P2_RESERVED_15_10_MASK)
/*! @} */

/*! @name LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0 - TX Power UP Time Register #0 */
/*! @{ */

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0_TX_REFGEN_EN_TIME_MASK (0xFFU)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0_TX_REFGEN_EN_TIME_SHIFT (0U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0_TX_REFGEN_EN_TIME_WIDTH (8U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0_TX_REFGEN_EN_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0_TX_REFGEN_EN_TIME_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0_TX_REFGEN_EN_TIME_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0_TX_CLK_EN_MASK (0xFF00U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0_TX_CLK_EN_SHIFT (8U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0_TX_CLK_EN_WIDTH (8U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0_TX_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0_TX_CLK_EN_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_0_TX_CLK_EN_MASK)
/*! @} */

/*! @name LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1 - TX Power UP Time Register #1 */
/*! @{ */

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1_TX_VCM_HOLD_TIME_14_0_MASK (0x7FFFU)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1_TX_VCM_HOLD_TIME_14_0_SHIFT (0U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1_TX_VCM_HOLD_TIME_14_0_WIDTH (15U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1_TX_VCM_HOLD_TIME_14_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1_TX_VCM_HOLD_TIME_14_0_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1_TX_VCM_HOLD_TIME_14_0_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1_SKIP_TX_VCM_HOLD_WAIT_MASK (0x8000U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1_SKIP_TX_VCM_HOLD_WAIT_SHIFT (15U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1_SKIP_TX_VCM_HOLD_WAIT_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1_SKIP_TX_VCM_HOLD_WAIT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1_SKIP_TX_VCM_HOLD_WAIT_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_1_SKIP_TX_VCM_HOLD_WAIT_MASK)
/*! @} */

/*! @name LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2 - TX Power UP Time Register #2 */
/*! @{ */

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2_TX_VBOOST_DIS_TIME_12_0_MASK (0x1FFFU)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2_TX_VBOOST_DIS_TIME_12_0_SHIFT (0U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2_TX_VBOOST_DIS_TIME_12_0_WIDTH (13U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2_TX_VBOOST_DIS_TIME_12_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2_TX_VBOOST_DIS_TIME_12_0_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2_TX_VBOOST_DIS_TIME_12_0_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2_DTB_SEL_MASK (0xE000U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2_DTB_SEL_SHIFT (13U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2_DTB_SEL_WIDTH (3U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2_DTB_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2_DTB_SEL_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_2_DTB_SEL_MASK)
/*! @} */

/*! @name LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3 - TX Power UP Time Register #3 */
/*! @{ */

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_TX_VCM_HOLD_TIME_17_15_MASK (0x7U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_TX_VCM_HOLD_TIME_17_15_SHIFT (0U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_TX_VCM_HOLD_TIME_17_15_WIDTH (3U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_TX_VCM_HOLD_TIME_17_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_TX_VCM_HOLD_TIME_17_15_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_TX_VCM_HOLD_TIME_17_15_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_TX_VBOOST_DIS_TIME_13_MASK (0x8U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_TX_VBOOST_DIS_TIME_13_SHIFT (3U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_TX_VBOOST_DIS_TIME_13_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_TX_VBOOST_DIS_TIME_13(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_TX_VBOOST_DIS_TIME_13_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_TX_VBOOST_DIS_TIME_13_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_RESERVED_15_4_MASK (0xFFF0U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_RESERVED_15_4_SHIFT (4U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_RESERVED_15_4_WIDTH (12U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_RESERVED_15_4_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_3_RESERVED_15_4_MASK)
/*! @} */

/*! @name LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4 - TX Power UP Time Register #4 */
/*! @{ */

