zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4_TX_VCM_HOLD_GS_TIME_MASK (0x7FFFU)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4_TX_VCM_HOLD_GS_TIME_SHIFT (0U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4_TX_VCM_HOLD_GS_TIME_WIDTH (15U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4_TX_VCM_HOLD_GS_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4_TX_VCM_HOLD_GS_TIME_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4_TX_VCM_HOLD_GS_TIME_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4_RESERVED_15_15_MASK (0x8000U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4_RESERVED_15_15_SHIFT (15U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4_RESERVED_15_15_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4_RESERVED_15_15_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_4_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5 - TX Power UP Time Register #5 */
/*! @{ */

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_RXDET_TIME_MASK (0x3FFU)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_RXDET_TIME_SHIFT (0U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_RXDET_TIME_WIDTH (10U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_RXDET_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_RXDET_TIME_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_RXDET_TIME_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_FAST_TX_RXDET_MASK (0x400U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_FAST_TX_RXDET_SHIFT (10U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_FAST_TX_RXDET_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_FAST_TX_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_FAST_TX_RXDET_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_FAST_TX_RXDET_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_RESET_TIME_MASK (0x1800U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_RESET_TIME_SHIFT (11U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_RESET_TIME_WIDTH (2U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_RESET_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_RESET_TIME_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_RESET_TIME_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_SERIAL_EN_TIME_MASK (0x6000U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_SERIAL_EN_TIME_SHIFT (13U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_SERIAL_EN_TIME_WIDTH (2U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_SERIAL_EN_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_SERIAL_EN_TIME_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_TX_SERIAL_EN_TIME_MASK)

#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_RESERVED_15_15_MASK (0x8000U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_RESERVED_15_15_SHIFT (15U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_RESERVED_15_15_WIDTH (1U)
#define X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_RESERVED_15_15_SHIFT)) & X2_LANE0_DIG_TX_PWRCTL_TX_PWRUP_TIME_5_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANE0_DIG_TX_LBERT_CTL - Pattern Generator controls */
/*! @{ */

#define X2_LANE0_DIG_TX_LBERT_CTL_MODE_MASK      (0xFU)
#define X2_LANE0_DIG_TX_LBERT_CTL_MODE_SHIFT     (0U)
#define X2_LANE0_DIG_TX_LBERT_CTL_MODE_WIDTH     (4U)
#define X2_LANE0_DIG_TX_LBERT_CTL_MODE(x)        (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_LBERT_CTL_MODE_SHIFT)) & X2_LANE0_DIG_TX_LBERT_CTL_MODE_MASK)

#define X2_LANE0_DIG_TX_LBERT_CTL_TRIGGER_ERR_MASK (0x10U)
#define X2_LANE0_DIG_TX_LBERT_CTL_TRIGGER_ERR_SHIFT (4U)
#define X2_LANE0_DIG_TX_LBERT_CTL_TRIGGER_ERR_WIDTH (1U)
#define X2_LANE0_DIG_TX_LBERT_CTL_TRIGGER_ERR(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_LBERT_CTL_TRIGGER_ERR_SHIFT)) & X2_LANE0_DIG_TX_LBERT_CTL_TRIGGER_ERR_MASK)

#define X2_LANE0_DIG_TX_LBERT_CTL_PAT0_MASK      (0x7FE0U)
#define X2_LANE0_DIG_TX_LBERT_CTL_PAT0_SHIFT     (5U)
#define X2_LANE0_DIG_TX_LBERT_CTL_PAT0_WIDTH     (10U)
#define X2_LANE0_DIG_TX_LBERT_CTL_PAT0(x)        (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_LBERT_CTL_PAT0_SHIFT)) & X2_LANE0_DIG_TX_LBERT_CTL_PAT0_MASK)

#define X2_LANE0_DIG_TX_LBERT_CTL_RESERVED_15_15_MASK (0x8000U)
#define X2_LANE0_DIG_TX_LBERT_CTL_RESERVED_15_15_SHIFT (15U)
#define X2_LANE0_DIG_TX_LBERT_CTL_RESERVED_15_15_WIDTH (1U)
#define X2_LANE0_DIG_TX_LBERT_CTL_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_LBERT_CTL_RESERVED_15_15_SHIFT)) & X2_LANE0_DIG_TX_LBERT_CTL_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0 - TX Clock Alignment Control Register #0 */
/*! @{ */

#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_NUM_2UI_SHIFTS_16B_MODE_MASK (0xFU)
#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_NUM_2UI_SHIFTS_16B_MODE_SHIFT (0U)
#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_NUM_2UI_SHIFTS_16B_MODE_WIDTH (4U)
#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_NUM_2UI_SHIFTS_16B_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_NUM_2UI_SHIFTS_16B_MODE_SHIFT)) & X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_NUM_2UI_SHIFTS_16B_MODE_MASK)

#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_NUM_2UI_SHIFTS_20B_MODE_MASK (0xF0U)
#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_NUM_2UI_SHIFTS_20B_MODE_SHIFT (4U)
#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_NUM_2UI_SHIFTS_20B_MODE_WIDTH (4U)
#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_NUM_2UI_SHIFTS_20B_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_NUM_2UI_SHIFTS_20B_MODE_SHIFT)) & X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_NUM_2UI_SHIFTS_20B_MODE_MASK)

#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_FIFO_BYPASS_MASK (0x100U)
#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_FIFO_BYPASS_SHIFT (8U)
#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_FIFO_BYPASS_WIDTH (1U)
#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_FIFO_BYPASS(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_FIFO_BYPASS_SHIFT)) & X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_TX_FIFO_BYPASS_MASK)

#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_RESERVED_15_9_MASK (0xFE00U)
#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_RESERVED_15_9_SHIFT (9U)
#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_RESERVED_15_9_WIDTH (7U)
#define X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_RESERVED_15_9_SHIFT)) & X2_LANE0_DIG_TX_CLK_ALIGN_TX_CTL_0_RESERVED_15_9_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0 - RX Power State Control Register for P0 */
/*! @{ */

