zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_AFE_EN_MASK (0x2U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_AFE_EN_SHIFT (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_AFE_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_AFE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_AFE_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_AFE_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_VREG_EN_MASK (0x4U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_VREG_EN_SHIFT (2U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_VREG_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_VREG_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_VREG_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_VREG_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RESERVED_MASK (0x8U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RESERVED_SHIFT (3U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RESERVED_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RESERVED_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RESERVED_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_EN_MASK (0x10U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_EN_SHIFT (4U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_DCC_EN_MASK (0x20U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_DCC_EN_SHIFT (5U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_DCC_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_DCC_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_DCC_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CLK_DCC_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_DESER_EN_MASK (0x40U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_DESER_EN_SHIFT (6U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_DESER_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_DESER_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_DESER_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_DESER_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CDR_EN_MASK (0x80U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CDR_EN_SHIFT (7U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CDR_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CDR_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CDR_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_ANA_CDR_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_FREQ_RST_MASK (0x100U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_FREQ_RST_SHIFT (8U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_FREQ_RST_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_FREQ_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_FREQ_RST_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_FREQ_RST_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_CAL_RST_MASK (0x200U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_CAL_RST_SHIFT (9U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_CAL_RST_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_CAL_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_CAL_RST_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_CAL_RST_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_CONTCAL_EN_MASK (0x400U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_CONTCAL_EN_SHIFT (10U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_CONTCAL_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_CONTCAL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_CONTCAL_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_VCO_CONTCAL_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_DIG_CLK_EN_MASK (0x800U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_DIG_CLK_EN_SHIFT (11U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_DIG_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_DIG_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_DIG_CLK_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RX_P0S_DIG_CLK_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RESERVED_15_12_MASK (0xF000U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RESERVED_15_12_SHIFT (12U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RESERVED_15_12_WIDTH (4U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RESERVED_15_12_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P0S_RESERVED_15_12_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1 - RX Power State Control Register for P1 */
/*! @{ */

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_LOS_EN_MASK (0x1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_LOS_EN_SHIFT (0U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_LOS_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_LOS_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_LOS_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_LOS_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_AFE_EN_MASK (0x2U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_AFE_EN_SHIFT (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_AFE_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_AFE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_AFE_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_AFE_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_VREG_EN_MASK (0x4U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_VREG_EN_SHIFT (2U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_VREG_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_VREG_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_VREG_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_VREG_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RESERVED_MASK (0x8U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RESERVED_SHIFT (3U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RESERVED_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RESERVED_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RESERVED_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_EN_MASK (0x10U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_EN_SHIFT (4U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_DCC_EN_MASK (0x20U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_DCC_EN_SHIFT (5U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_DCC_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_DCC_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_DCC_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CLK_DCC_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_DESER_EN_MASK (0x40U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_DESER_EN_SHIFT (6U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_DESER_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_DESER_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_DESER_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_DESER_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CDR_EN_MASK (0x80U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CDR_EN_SHIFT (7U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CDR_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CDR_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CDR_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_ANA_CDR_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_VCO_FREQ_RST_MASK (0x100U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_VCO_FREQ_RST_SHIFT (8U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_VCO_FREQ_RST_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_VCO_FREQ_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_VCO_FREQ_RST_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P1_RX_P1_VCO_FREQ_RST_MASK)

