zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P2_RX_P2_DIG_CLK_EN_MASK (0x800U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P2_RX_P2_DIG_CLK_EN_SHIFT (11U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P2_RX_P2_DIG_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P2_RX_P2_DIG_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P2_RX_P2_DIG_CLK_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P2_RX_P2_DIG_CLK_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P2_RESERVED_15_12_MASK (0xF000U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P2_RESERVED_15_12_SHIFT (12U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P2_RESERVED_15_12_WIDTH (4U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P2_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P2_RESERVED_15_12_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PSTATE_P2_RESERVED_15_12_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0 - RX Power UP Time Register #0 */
/*! @{ */

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_RX_LOS_EN_TIME_MASK (0x1FFU)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_RX_LOS_EN_TIME_SHIFT (0U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_RX_LOS_EN_TIME_WIDTH (9U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_RX_LOS_EN_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_RX_LOS_EN_TIME_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_RX_LOS_EN_TIME_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_SKIP_RX_LOS_EN_WAIT_MASK (0x200U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_SKIP_RX_LOS_EN_WAIT_SHIFT (9U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_SKIP_RX_LOS_EN_WAIT_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_SKIP_RX_LOS_EN_WAIT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_SKIP_RX_LOS_EN_WAIT_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_SKIP_RX_LOS_EN_WAIT_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_RESERVED_15_10_MASK (0xFC00U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_RESERVED_15_10_SHIFT (10U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_RESERVED_15_10_WIDTH (6U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_RESERVED_15_10_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_0_RESERVED_15_10_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1 - RX Power UP Time Register #1 */
/*! @{ */

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RX_AFE_EN_TIME_MASK (0x3FU)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RX_AFE_EN_TIME_SHIFT (0U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RX_AFE_EN_TIME_WIDTH (6U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RX_AFE_EN_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RX_AFE_EN_TIME_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RX_AFE_EN_TIME_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_FAST_RX_AFE_EN_MASK (0x40U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_FAST_RX_AFE_EN_SHIFT (6U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_FAST_RX_AFE_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_FAST_RX_AFE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_FAST_RX_AFE_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_FAST_RX_AFE_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RX_VREG_EN_TIME_MASK (0x1F80U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RX_VREG_EN_TIME_SHIFT (7U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RX_VREG_EN_TIME_WIDTH (6U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RX_VREG_EN_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RX_VREG_EN_TIME_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RX_VREG_EN_TIME_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_FAST_RX_VREG_EN_MASK (0x2000U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_FAST_RX_VREG_EN_SHIFT (13U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_FAST_RX_VREG_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_FAST_RX_VREG_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_FAST_RX_VREG_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_FAST_RX_VREG_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RESERVED_15_14_MASK (0xC000U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RESERVED_15_14_SHIFT (14U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RESERVED_15_14_WIDTH (2U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RESERVED_15_14_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_1_RESERVED_15_14_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2 - RX Power UP Time Register #2 */
/*! @{ */

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_RX_CLK_EN_TIME_MASK (0x3FU)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_RX_CLK_EN_TIME_SHIFT (0U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_RX_CLK_EN_TIME_WIDTH (6U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_RX_CLK_EN_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_RX_CLK_EN_TIME_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_RX_CLK_EN_TIME_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_FAST_RX_CLK_EN_MASK (0x40U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_FAST_RX_CLK_EN_SHIFT (6U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_FAST_RX_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_FAST_RX_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_FAST_RX_CLK_EN_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_FAST_RX_CLK_EN_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_RESERVED_15_7_MASK (0xFF80U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_RESERVED_15_7_SHIFT (7U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_RESERVED_15_7_WIDTH (9U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_RESERVED_15_7(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_RESERVED_15_7_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_2_RESERVED_15_7_MASK)
/*! @} */

