zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3 - RX Power UP Time Register #3 */
/*! @{ */

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_RATE_TIME_MASK (0x3U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_RATE_TIME_SHIFT (0U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_RATE_TIME_WIDTH (2U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_RATE_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_RATE_TIME_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_RATE_TIME_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RSVD_3_7_2_MASK (0xFCU)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RSVD_3_7_2_SHIFT (2U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RSVD_3_7_2_WIDTH (6U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RSVD_3_7_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RSVD_3_7_2_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RSVD_3_7_2_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_CDR_EN_TIME_MASK (0xF00U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_CDR_EN_TIME_SHIFT (8U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_CDR_EN_TIME_WIDTH (4U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_CDR_EN_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_CDR_EN_TIME_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_CDR_EN_TIME_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_DESER_EN_TIME_MASK (0x3000U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_DESER_EN_TIME_SHIFT (12U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_DESER_EN_TIME_WIDTH (2U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_DESER_EN_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_DESER_EN_TIME_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_DESER_EN_TIME_MASK)

#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_DESER_DIS_TIME_MASK (0xC000U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_DESER_DIS_TIME_SHIFT (14U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_DESER_DIS_TIME_WIDTH (2U)
#define X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_DESER_DIS_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_DESER_DIS_TIME_SHIFT)) & X2_LANE0_DIG_RX_PWRCTL_RX_PWRUP_TIME_3_RX_DESER_DIS_TIME_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0 - RX VCO calibration controls register #0 */
/*! @{ */

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_FIXED_CNT_MASK (0x1FU)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_FIXED_CNT_SHIFT (0U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_FIXED_CNT_WIDTH (5U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_FIXED_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_FIXED_CNT_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_FIXED_CNT_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_FIXED_CNT_EN_MASK (0x20U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_FIXED_CNT_EN_SHIFT (5U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_FIXED_CNT_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_FIXED_CNT_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_FIXED_CNT_EN_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_FIXED_CNT_EN_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_CNT_SHIFT_MASK (0x1C0U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_CNT_SHIFT_SHIFT (6U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_CNT_SHIFT_WIDTH (3U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_CNT_SHIFT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_CNT_SHIFT_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_CNT_SHIFT_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_BOUNCE_CNT_MASK (0xE00U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_BOUNCE_CNT_SHIFT (9U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_BOUNCE_CNT_WIDTH (3U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_BOUNCE_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_BOUNCE_CNT_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_INT_GAIN_CAL_BOUNCE_CNT_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_RESERVED_15_12_MASK (0xF000U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_RESERVED_15_12_SHIFT (12U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_RESERVED_15_12_WIDTH (4U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_RESERVED_15_12_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_0_RESERVED_15_12_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1 - RX VCO calibration controls register #1 */
/*! @{ */

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_OVRD_SEL_MASK (0x1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_OVRD_SEL_SHIFT (0U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_OVRD_SEL_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_OVRD_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_OVRD_SEL_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_OVRD_SEL_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_FREQ_RST_MASK (0x2U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_FREQ_RST_SHIFT (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_FREQ_RST_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_FREQ_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_FREQ_RST_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_FREQ_RST_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CAL_RST_MASK (0x4U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CAL_RST_SHIFT (2U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CAL_RST_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CAL_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CAL_RST_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CAL_RST_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CONTCAL_EN_MASK (0x8U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CONTCAL_EN_SHIFT (3U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CONTCAL_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CONTCAL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CONTCAL_EN_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CONTCAL_EN_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DISABLE_INT_CAL_MODE_MASK (0x10U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DISABLE_INT_CAL_MODE_SHIFT (4U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DISABLE_INT_CAL_MODE_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DISABLE_INT_CAL_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DISABLE_INT_CAL_MODE_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DISABLE_INT_CAL_MODE_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DPLL_CAL_UG_MASK (0x1E0U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DPLL_CAL_UG_SHIFT (5U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DPLL_CAL_UG_WIDTH (4U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DPLL_CAL_UG(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DPLL_CAL_UG_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DPLL_CAL_UG_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DTB_SEL_MASK (0xFE00U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DTB_SEL_SHIFT (9U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DTB_SEL_WIDTH (7U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DTB_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DTB_SEL_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DTB_SEL_MASK)
/*! @} */

