zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2 - RX VCO calibration controls register #2 */
/*! @{ */

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_START_VAL_MASK (0x3FFU)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_START_VAL_SHIFT (0U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_START_VAL_WIDTH (10U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_START_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_START_VAL_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_START_VAL_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_CAL_STEPS_MASK (0x3C00U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_CAL_STEPS_SHIFT (10U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_CAL_STEPS_WIDTH (4U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_CAL_STEPS(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_CAL_STEPS_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_CAL_STEPS_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_FREQ_TUNE_CAL_MASK (0x4000U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_FREQ_TUNE_CAL_SHIFT (14U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_FREQ_TUNE_CAL_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_FREQ_TUNE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_FREQ_TUNE_CAL_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_FREQ_TUNE_CAL_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_CAL_MASK (0x8000U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_CAL_SHIFT (15U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_CAL_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_CAL_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_CAL_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0 - RX Power UP Time Register #0 */
/*! @{ */

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_STARTUP_TIME_MASK (0x7FU)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_STARTUP_TIME_SHIFT (0U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_STARTUP_TIME_WIDTH (7U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_STARTUP_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_STARTUP_TIME_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_STARTUP_TIME_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_UPDATE_TIME_MASK (0x780U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_UPDATE_TIME_SHIFT (7U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_UPDATE_TIME_WIDTH (4U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_UPDATE_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_UPDATE_TIME_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_UPDATE_TIME_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_CNTR_PWRUP_TIME_MASK (0x7800U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_CNTR_PWRUP_TIME_SHIFT (11U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_CNTR_PWRUP_TIME_WIDTH (4U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_CNTR_PWRUP_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_CNTR_PWRUP_TIME_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_CNTR_PWRUP_TIME_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_FAST_RX_VCO_WAIT_MASK (0x8000U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_FAST_RX_VCO_WAIT_SHIFT (15U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_FAST_RX_VCO_WAIT_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_FAST_RX_VCO_WAIT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_FAST_RX_VCO_WAIT_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_FAST_RX_VCO_WAIT_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1 - RX Power UP Time Register #1 */
/*! @{ */

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RX_VCO_CNTR_SETTLE_TIME_MASK (0x7U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RX_VCO_CNTR_SETTLE_TIME_SHIFT (0U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RX_VCO_CNTR_SETTLE_TIME_WIDTH (3U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RX_VCO_CNTR_SETTLE_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RX_VCO_CNTR_SETTLE_TIME_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RX_VCO_CNTR_SETTLE_TIME_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RESERVED_15_3_MASK (0xFFF8U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RESERVED_15_3_SHIFT (3U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RESERVED_15_3_WIDTH (13U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RESERVED_15_3(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RESERVED_15_3_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RESERVED_15_3_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0 - RX VCO status register #0 */
/*! @{ */

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_FREQ_TUNE_MASK (0x3FFU)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_FREQ_TUNE_SHIFT (0U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_FREQ_TUNE_WIDTH (10U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_FREQ_TUNE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_FREQ_TUNE_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_FREQ_TUNE_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_PD_MASK (0x400U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_PD_SHIFT (10U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_PD_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_PD(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_PD_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_PD_MASK)

