zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_EN_MASK (0x800U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_EN_SHIFT (11U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_EN_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_EN_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_STARTUP_MASK (0x1000U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_STARTUP_SHIFT (12U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_STARTUP_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_STARTUP(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_STARTUP_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_STARTUP_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_VCO_EN_MASK (0x2000U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_VCO_EN_SHIFT (13U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_VCO_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_VCO_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_VCO_EN_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_VCO_EN_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RESERVED_15_14_MASK (0xC000U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RESERVED_15_14_SHIFT (14U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RESERVED_15_14_WIDTH (2U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RESERVED_15_14_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_0_RESERVED_15_14_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1 - RX VCO status register #1 */
/*! @{ */

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FSM_STATE_MASK (0xFU)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FSM_STATE_SHIFT (0U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FSM_STATE_WIDTH (4U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FSM_STATE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FSM_STATE_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FSM_STATE_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FREQ_RST_MASK (0x10U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FREQ_RST_SHIFT (4U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FREQ_RST_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FREQ_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FREQ_RST_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FREQ_RST_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_RST_MASK (0x20U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_RST_SHIFT (5U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_RST_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_RST_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_RST_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CONTCAL_EN_MASK (0x40U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CONTCAL_EN_SHIFT (6U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CONTCAL_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CONTCAL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CONTCAL_EN_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CONTCAL_EN_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_DONE_MASK (0x80U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_DONE_SHIFT (7U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_DONE_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_DONE_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_DONE_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_DPLL_FREQ_RST_MASK (0x100U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_DPLL_FREQ_RST_SHIFT (8U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_DPLL_FREQ_RST_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_DPLL_FREQ_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_DPLL_FREQ_RST_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_DPLL_FREQ_RST_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RESERVED_15_9_MASK (0xFE00U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RESERVED_15_9_SHIFT (9U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RESERVED_15_9_WIDTH (7U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RESERVED_15_9_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_1_RESERVED_15_9_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2 - RX VCO status register #2 */
/*! @{ */

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCO_CNTR_FINAL_MASK (0x1FFFU)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCO_CNTR_FINAL_SHIFT (0U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCO_CNTR_FINAL_WIDTH (13U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCO_CNTR_FINAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCO_CNTR_FINAL_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCO_CNTR_FINAL_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCOCLK_TOO_FAST_MASK (0x2000U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCOCLK_TOO_FAST_SHIFT (13U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCOCLK_TOO_FAST_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCOCLK_TOO_FAST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCOCLK_TOO_FAST_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCOCLK_TOO_FAST_MASK)

#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_CORRECT_MASK (0x4000U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_CORRECT_SHIFT (14U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_CORRECT_WIDTH (1U)
#define X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_CORRECT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_CORRECT_SHIFT)) & X2_LANE0_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_CORRECT_MASK)

