zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name LANE0_DIG_RX_CDR_STAT - Current output values to dpll (phug, frug) */
/*! @{ */

#define X2_LANE0_DIG_RX_CDR_STAT_PHUG_VALUE_MASK (0x7U)
#define X2_LANE0_DIG_RX_CDR_STAT_PHUG_VALUE_SHIFT (0U)
#define X2_LANE0_DIG_RX_CDR_STAT_PHUG_VALUE_WIDTH (3U)
#define X2_LANE0_DIG_RX_CDR_STAT_PHUG_VALUE(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_CDR_STAT_PHUG_VALUE_SHIFT)) & X2_LANE0_DIG_RX_CDR_STAT_PHUG_VALUE_MASK)

#define X2_LANE0_DIG_RX_CDR_STAT_FRUG_VALUE_MASK (0x38U)
#define X2_LANE0_DIG_RX_CDR_STAT_FRUG_VALUE_SHIFT (3U)
#define X2_LANE0_DIG_RX_CDR_STAT_FRUG_VALUE_WIDTH (3U)
#define X2_LANE0_DIG_RX_CDR_STAT_FRUG_VALUE(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_CDR_STAT_FRUG_VALUE_SHIFT)) & X2_LANE0_DIG_RX_CDR_STAT_FRUG_VALUE_MASK)

#define X2_LANE0_DIG_RX_CDR_STAT_RESERVED_15_6_MASK (0xFFC0U)
#define X2_LANE0_DIG_RX_CDR_STAT_RESERVED_15_6_SHIFT (6U)
#define X2_LANE0_DIG_RX_CDR_STAT_RESERVED_15_6_WIDTH (10U)
#define X2_LANE0_DIG_RX_CDR_STAT_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_CDR_STAT_RESERVED_15_6_SHIFT)) & X2_LANE0_DIG_RX_CDR_STAT_RESERVED_15_6_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_DPLL_FREQ - Current frequency integrator value. */
/*! @{ */

#define X2_LANE0_DIG_RX_DPLL_FREQ_VAL_MASK       (0x3FFFU)
#define X2_LANE0_DIG_RX_DPLL_FREQ_VAL_SHIFT      (0U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_VAL_WIDTH      (14U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_VAL(x)         (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_DPLL_FREQ_VAL_SHIFT)) & X2_LANE0_DIG_RX_DPLL_FREQ_VAL_MASK)

#define X2_LANE0_DIG_RX_DPLL_FREQ_RESERVED_15_14_MASK (0xC000U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_RESERVED_15_14_SHIFT (14U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_RESERVED_15_14_WIDTH (2U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_DPLL_FREQ_RESERVED_15_14_SHIFT)) & X2_LANE0_DIG_RX_DPLL_FREQ_RESERVED_15_14_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_DPLL_FREQ_BOUND_0 - Frequency Bounds for incoming data stream #0 */
/*! @{ */

#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_FREQ_BOUND_EN_MASK (0x1U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_FREQ_BOUND_EN_SHIFT (0U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_FREQ_BOUND_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_FREQ_BOUND_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_FREQ_BOUND_EN_SHIFT)) & X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_FREQ_BOUND_EN_MASK)

#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_UPPER_FREQ_BOUND_MASK (0x7FEU)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_UPPER_FREQ_BOUND_SHIFT (1U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_UPPER_FREQ_BOUND_WIDTH (10U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_UPPER_FREQ_BOUND(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_UPPER_FREQ_BOUND_SHIFT)) & X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_UPPER_FREQ_BOUND_MASK)

#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_RESERVED_15_11_MASK (0xF800U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_RESERVED_15_11_SHIFT (11U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_RESERVED_15_11_WIDTH (5U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_RESERVED_15_11_SHIFT)) & X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_0_RESERVED_15_11_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_DPLL_FREQ_BOUND_1 - Frequency Bounds for incoming data stream #1 */
/*! @{ */

#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_1_LOWER_FREQ_BOUND_MASK (0x3FFU)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_1_LOWER_FREQ_BOUND_SHIFT (0U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_1_LOWER_FREQ_BOUND_WIDTH (10U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_1_LOWER_FREQ_BOUND(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_1_LOWER_FREQ_BOUND_SHIFT)) & X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_1_LOWER_FREQ_BOUND_MASK)

#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_1_RESERVED_15_10_MASK (0xFC00U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_1_RESERVED_15_10_SHIFT (10U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_1_RESERVED_15_10_WIDTH (6U)
#define X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_1_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_1_RESERVED_15_10_SHIFT)) & X2_LANE0_DIG_RX_DPLL_FREQ_BOUND_1_RESERVED_15_10_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0 - Adaptation Configuration Register #0 */
/*! @{ */

#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TOP_ASM1_MASK (0x3FFU)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TOP_ASM1_SHIFT (0U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TOP_ASM1_WIDTH (10U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TOP_ASM1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TOP_ASM1_SHIFT)) & X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TOP_ASM1_MASK)

#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TGG_ASM1_MASK (0x3C00U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TGG_ASM1_SHIFT (10U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TGG_ASM1_WIDTH (4U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TGG_ASM1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TGG_ASM1_SHIFT)) & X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TGG_ASM1_MASK)

#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_START_ASM1_MASK (0x4000U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_START_ASM1_SHIFT (14U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_START_ASM1_WIDTH (1U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_START_ASM1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_START_ASM1_SHIFT)) & X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_START_ASM1_MASK)

#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_ADPT_CLK_DIV4_EN_MASK (0x8000U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_ADPT_CLK_DIV4_EN_SHIFT (15U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_ADPT_CLK_DIV4_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_ADPT_CLK_DIV4_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_ADPT_CLK_DIV4_EN_SHIFT)) & X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_0_ADPT_CLK_DIV4_EN_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1 - Adaptation Configuration Register #1 */
/*! @{ */

#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_N_WAIT_ASM1_MASK (0x7FU)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_N_WAIT_ASM1_SHIFT (0U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_N_WAIT_ASM1_WIDTH (7U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_N_WAIT_ASM1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_N_WAIT_ASM1_SHIFT)) & X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_N_WAIT_ASM1_MASK)

#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_FAST_AFE_DFE_SETTLE_MASK (0x80U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_FAST_AFE_DFE_SETTLE_SHIFT (7U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_FAST_AFE_DFE_SETTLE_WIDTH (1U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_FAST_AFE_DFE_SETTLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_FAST_AFE_DFE_SETTLE_SHIFT)) & X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_FAST_AFE_DFE_SETTLE_MASK)

#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_VAL_MASK (0x700U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_VAL_SHIFT (8U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_VAL_WIDTH (3U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_VAL_SHIFT)) & X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_VAL_MASK)

#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_EN_MASK (0x800U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_EN_SHIFT (11U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_EN_SHIFT)) & X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_EN_MASK)

#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_RESERVED_15_12_MASK (0xF000U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_RESERVED_15_12_SHIFT (12U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_RESERVED_15_12_WIDTH (4U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_RESERVED_15_12_SHIFT)) & X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_1_RESERVED_15_12_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_ADPTCTL_ADPT_CFG_2 - Adaptation Configuration Register #2 */
/*! @{ */

#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_0_MASK (0x1FU)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_0_SHIFT (0U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_0_WIDTH (5U)
#define X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_0_SHIFT)) & X2_LANE0_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_0_MASK)

