zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_SHFT_SEL_MASK (0x3C0U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_SHFT_SEL_SHIFT (6U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_SHFT_SEL_WIDTH (4U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_SHFT_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_SHFT_SEL_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_SHFT_SEL_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_SRC_SEL_MASK (0x1C00U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_SRC_SEL_SHIFT (10U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_SRC_SEL_WIDTH (3U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_SRC_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_SRC_SEL_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_SRC_SEL_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_RXCLK_SEL_MASK (0x2000U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_RXCLK_SEL_SHIFT (13U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_RXCLK_SEL_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_RXCLK_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_RXCLK_SEL_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL0_STAT_RXCLK_SEL_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_SC_TIMER_MODE_MASK (0x4000U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_SC_TIMER_MODE_SHIFT (14U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_SC_TIMER_MODE_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_SC_TIMER_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL0_SC_TIMER_MODE_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL0_SC_TIMER_MODE_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_SKIP_EN_MASK (0x8000U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_SKIP_EN_SHIFT (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_SKIP_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL0_SKIP_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL0_SKIP_EN_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL0_SKIP_EN_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_STAT_CTL1 - Stat controls register #1 */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_0_EN_MASK (0x1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_0_EN_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_0_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_0_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_0_EN_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_0_EN_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_1_EN_MASK (0x2U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_1_EN_SHIFT (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_1_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_1_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_1_EN_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_1_EN_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_2_EN_MASK (0x4U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_2_EN_SHIFT (2U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_2_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_2_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_2_EN_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_2_EN_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_3_EN_MASK (0x8U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_3_EN_SHIFT (3U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_3_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_3_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_3_EN_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_3_EN_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_4_EN_MASK (0x10U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_4_EN_SHIFT (4U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_4_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_4_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_4_EN_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_4_EN_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_5_EN_MASK (0x20U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_5_EN_SHIFT (5U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_5_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_5_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_5_EN_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_5_EN_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_6_EN_MASK (0x40U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_6_EN_SHIFT (6U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_6_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_6_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_6_EN_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CNT_6_EN_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_RESERVED_8_7_MASK (0x180U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_RESERVED_8_7_SHIFT (7U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_RESERVED_8_7_WIDTH (2U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_RESERVED_8_7(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL1_RESERVED_8_7_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL1_RESERVED_8_7_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_SC_PAUSE_MASK (0x200U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_SC_PAUSE_SHIFT (9U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_SC_PAUSE_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_SC_PAUSE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL1_SC_PAUSE_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL1_SC_PAUSE_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CLK_EN_MASK (0x400U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CLK_EN_SHIFT (10U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CLK_EN_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL1_STAT_CLK_EN_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_DATA_DLY_SEL_MASK (0x1800U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_DATA_DLY_SEL_SHIFT (11U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_DATA_DLY_SEL_WIDTH (2U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_DATA_DLY_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL1_DATA_DLY_SEL_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL1_DATA_DLY_SEL_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_VLD_LOSS_CLR_MASK (0x2000U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_VLD_LOSS_CLR_SHIFT (13U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_VLD_LOSS_CLR_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_VLD_LOSS_CLR(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL1_VLD_LOSS_CLR_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL1_VLD_LOSS_CLR_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_VLD_CTL_MASK (0xC000U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_VLD_CTL_SHIFT (14U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_VLD_CTL_WIDTH (2U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL1_VLD_CTL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL1_VLD_CTL_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL1_VLD_CTL_MASK)
/*! @} */

