zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name LANE0_DIG_RX_STAT_SMPL_CNT1 - Sample Counter #1 Status */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_SMPL_CNT1_SMPL_CNT1_MASK (0x7FFFU)
#define X2_LANE0_DIG_RX_STAT_SMPL_CNT1_SMPL_CNT1_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_SMPL_CNT1_SMPL_CNT1_WIDTH (15U)
#define X2_LANE0_DIG_RX_STAT_SMPL_CNT1_SMPL_CNT1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_SMPL_CNT1_SMPL_CNT1_SHIFT)) & X2_LANE0_DIG_RX_STAT_SMPL_CNT1_SMPL_CNT1_MASK)

#define X2_LANE0_DIG_RX_STAT_SMPL_CNT1_SMPL_CNT1_DONE_MASK (0x8000U)
#define X2_LANE0_DIG_RX_STAT_SMPL_CNT1_SMPL_CNT1_DONE_SHIFT (15U)
#define X2_LANE0_DIG_RX_STAT_SMPL_CNT1_SMPL_CNT1_DONE_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_SMPL_CNT1_SMPL_CNT1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_SMPL_CNT1_SMPL_CNT1_DONE_SHIFT)) & X2_LANE0_DIG_RX_STAT_SMPL_CNT1_SMPL_CNT1_DONE_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_STAT_CNT_0 - Stat Counter 0 Status */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_0_STAT_CNT_0_MASK (0x7FFFU)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_0_STAT_CNT_0_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_0_STAT_CNT_0_WIDTH (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_0_STAT_CNT_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_0_STAT_CNT_0_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_0_STAT_CNT_0_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_0_SMPL_CNT1_DONE_MASK (0x8000U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_0_SMPL_CNT1_DONE_SHIFT (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_0_SMPL_CNT1_DONE_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_0_SMPL_CNT1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_0_SMPL_CNT1_DONE_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_0_SMPL_CNT1_DONE_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_STAT_CNT_1 - Stat Counter 1 Status */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_1_STAT_CNT_1_MASK (0x7FFFU)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_1_STAT_CNT_1_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_1_STAT_CNT_1_WIDTH (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_1_STAT_CNT_1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_1_STAT_CNT_1_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_1_STAT_CNT_1_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_1_SMPL_CNT1_DONE_MASK (0x8000U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_1_SMPL_CNT1_DONE_SHIFT (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_1_SMPL_CNT1_DONE_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_1_SMPL_CNT1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_1_SMPL_CNT1_DONE_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_1_SMPL_CNT1_DONE_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_STAT_CNT_2 - Stat Counter 2 Status */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_2_STAT_CNT_2_MASK (0x7FFFU)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_2_STAT_CNT_2_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_2_STAT_CNT_2_WIDTH (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_2_STAT_CNT_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_2_STAT_CNT_2_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_2_STAT_CNT_2_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_2_SMPL_CNT1_DONE_MASK (0x8000U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_2_SMPL_CNT1_DONE_SHIFT (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_2_SMPL_CNT1_DONE_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_2_SMPL_CNT1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_2_SMPL_CNT1_DONE_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_2_SMPL_CNT1_DONE_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_STAT_CNT_3 - Stat Counter 3 Status */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_3_STAT_CNT_3_MASK (0x7FFFU)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_3_STAT_CNT_3_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_3_STAT_CNT_3_WIDTH (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_3_STAT_CNT_3(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_3_STAT_CNT_3_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_3_STAT_CNT_3_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_3_SMPL_CNT1_DONE_MASK (0x8000U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_3_SMPL_CNT1_DONE_SHIFT (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_3_SMPL_CNT1_DONE_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_3_SMPL_CNT1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_3_SMPL_CNT1_DONE_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_3_SMPL_CNT1_DONE_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_STAT_CNT_4 - Stat Counter 4 Status */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_4_STAT_CNT_4_MASK (0x7FFFU)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_4_STAT_CNT_4_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_4_STAT_CNT_4_WIDTH (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_4_STAT_CNT_4(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_4_STAT_CNT_4_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_4_STAT_CNT_4_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_4_SMPL_CNT1_DONE_MASK (0x8000U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_4_SMPL_CNT1_DONE_SHIFT (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_4_SMPL_CNT1_DONE_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_4_SMPL_CNT1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_4_SMPL_CNT1_DONE_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_4_SMPL_CNT1_DONE_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_STAT_CNT_5 - Stat Counter 5 Status */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_5_STAT_CNT_5_MASK (0x7FFFU)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_5_STAT_CNT_5_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_5_STAT_CNT_5_WIDTH (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_5_STAT_CNT_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_5_STAT_CNT_5_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_5_STAT_CNT_5_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_5_SMPL_CNT1_DONE_MASK (0x8000U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_5_SMPL_CNT1_DONE_SHIFT (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_5_SMPL_CNT1_DONE_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_5_SMPL_CNT1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_5_SMPL_CNT1_DONE_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_5_SMPL_CNT1_DONE_MASK)
/*! @} */

