zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name LANE0_DIG_RX_STAT_STAT_CNT_6 - Stat Counter 6 Status */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_6_STAT_CNT_6_MASK (0x7FFFU)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_6_STAT_CNT_6_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_6_STAT_CNT_6_WIDTH (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_6_STAT_CNT_6(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_6_STAT_CNT_6_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_6_STAT_CNT_6_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CNT_6_SMPL_CNT1_DONE_MASK (0x8000U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_6_SMPL_CNT1_DONE_SHIFT (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_6_SMPL_CNT1_DONE_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CNT_6_SMPL_CNT1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CNT_6_SMPL_CNT1_DONE_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CNT_6_SMPL_CNT1_DONE_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL - Calibration Comparator Control */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_PRECHRGE_CNT_MASK (0x7U)
#define X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_PRECHRGE_CNT_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_PRECHRGE_CNT_WIDTH (3U)
#define X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_PRECHRGE_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_PRECHRGE_CNT_SHIFT)) & X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_PRECHRGE_CNT_MASK)

#define X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_REF_DIV_CNT_MASK (0x38U)
#define X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_REF_DIV_CNT_SHIFT (3U)
#define X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_REF_DIV_CNT_WIDTH (3U)
#define X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_REF_DIV_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_REF_DIV_CNT_SHIFT)) & X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_REF_DIV_CNT_MASK)

#define X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_RESERVED_15_6_MASK (0xFFC0U)
#define X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_RESERVED_15_6_SHIFT (6U)
#define X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_RESERVED_15_6_WIDTH (10U)
#define X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_RESERVED_15_6_SHIFT)) & X2_LANE0_DIG_RX_STAT_CAL_COMP_CLK_CTL_RESERVED_15_6_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_MATCH_CTL2 - Stat match controls register #2 */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_MATCH_CTL2_PTTRN_CR1A_19_5_MASK (0x7FFFU)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL2_PTTRN_CR1A_19_5_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL2_PTTRN_CR1A_19_5_WIDTH (15U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL2_PTTRN_CR1A_19_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_MATCH_CTL2_PTTRN_CR1A_19_5_SHIFT)) & X2_LANE0_DIG_RX_STAT_MATCH_CTL2_PTTRN_CR1A_19_5_MASK)

#define X2_LANE0_DIG_RX_STAT_MATCH_CTL2_RESERVED_15_15_MASK (0x8000U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL2_RESERVED_15_15_SHIFT (15U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL2_RESERVED_15_15_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL2_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_MATCH_CTL2_RESERVED_15_15_SHIFT)) & X2_LANE0_DIG_RX_STAT_MATCH_CTL2_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_MATCH_CTL3 - Stat match controls register #3 */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_MATCH_CTL3_PTTRN_MSK_CR1A_19_5_MASK (0x7FFFU)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL3_PTTRN_MSK_CR1A_19_5_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL3_PTTRN_MSK_CR1A_19_5_WIDTH (15U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL3_PTTRN_MSK_CR1A_19_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_MATCH_CTL3_PTTRN_MSK_CR1A_19_5_SHIFT)) & X2_LANE0_DIG_RX_STAT_MATCH_CTL3_PTTRN_MSK_CR1A_19_5_MASK)

#define X2_LANE0_DIG_RX_STAT_MATCH_CTL3_RESERVED_15_15_MASK (0x8000U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL3_RESERVED_15_15_SHIFT (15U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL3_RESERVED_15_15_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL3_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_MATCH_CTL3_RESERVED_15_15_SHIFT)) & X2_LANE0_DIG_RX_STAT_MATCH_CTL3_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_MATCH_CTL4 - Stat match controls register #4 */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_MATCH_CTL4_PTTRN_CR1B_19_5_MASK (0x7FFFU)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL4_PTTRN_CR1B_19_5_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL4_PTTRN_CR1B_19_5_WIDTH (15U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL4_PTTRN_CR1B_19_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_MATCH_CTL4_PTTRN_CR1B_19_5_SHIFT)) & X2_LANE0_DIG_RX_STAT_MATCH_CTL4_PTTRN_CR1B_19_5_MASK)

#define X2_LANE0_DIG_RX_STAT_MATCH_CTL4_RESERVED_15_15_MASK (0x8000U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL4_RESERVED_15_15_SHIFT (15U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL4_RESERVED_15_15_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL4_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_MATCH_CTL4_RESERVED_15_15_SHIFT)) & X2_LANE0_DIG_RX_STAT_MATCH_CTL4_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_MATCH_CTL5 - Stat match controls register #5 */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_MATCH_CTL5_PTTRN_MSK_CR1B_19_5_MASK (0x7FFFU)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL5_PTTRN_MSK_CR1B_19_5_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL5_PTTRN_MSK_CR1B_19_5_WIDTH (15U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL5_PTTRN_MSK_CR1B_19_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_MATCH_CTL5_PTTRN_MSK_CR1B_19_5_SHIFT)) & X2_LANE0_DIG_RX_STAT_MATCH_CTL5_PTTRN_MSK_CR1B_19_5_MASK)

#define X2_LANE0_DIG_RX_STAT_MATCH_CTL5_RESERVED_15_15_MASK (0x8000U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL5_RESERVED_15_15_SHIFT (15U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL5_RESERVED_15_15_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_MATCH_CTL5_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_MATCH_CTL5_RESERVED_15_15_SHIFT)) & X2_LANE0_DIG_RX_STAT_MATCH_CTL5_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_STAT_CTL2 - Stat controls register #2 */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_STAT_CTL2_DATA_DLY_SEL_2_MASK (0x1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL2_DATA_DLY_SEL_2_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL2_DATA_DLY_SEL_2_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL2_DATA_DLY_SEL_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL2_DATA_DLY_SEL_2_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL2_DATA_DLY_SEL_2_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL2_SCOPE_DLY_2_MASK (0x2U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL2_SCOPE_DLY_2_SHIFT (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL2_SCOPE_DLY_2_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL2_SCOPE_DLY_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL2_SCOPE_DLY_2_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL2_SCOPE_DLY_2_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_CTL2_RESERVED_15_2_MASK (0xFFFCU)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL2_RESERVED_15_2_SHIFT (2U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL2_RESERVED_15_2_WIDTH (14U)
#define X2_LANE0_DIG_RX_STAT_STAT_CTL2_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_CTL2_RESERVED_15_2_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_CTL2_RESERVED_15_2_MASK)
/*! @} */

/*! @name LANE0_DIG_RX_STAT_STAT_STOP - Stat stop register */
/*! @{ */

#define X2_LANE0_DIG_RX_STAT_STAT_STOP_SC1_STOP_MASK (0x1U)
#define X2_LANE0_DIG_RX_STAT_STAT_STOP_SC1_STOP_SHIFT (0U)
#define X2_LANE0_DIG_RX_STAT_STAT_STOP_SC1_STOP_WIDTH (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_STOP_SC1_STOP(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_STOP_SC1_STOP_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_STOP_SC1_STOP_MASK)

#define X2_LANE0_DIG_RX_STAT_STAT_STOP_RESERVED_15_1_MASK (0xFFFEU)
#define X2_LANE0_DIG_RX_STAT_STAT_STOP_RESERVED_15_1_SHIFT (1U)
#define X2_LANE0_DIG_RX_STAT_STAT_STOP_RESERVED_15_1_WIDTH (15U)
#define X2_LANE0_DIG_RX_STAT_STAT_STOP_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_RX_STAT_STAT_STOP_RESERVED_15_1_SHIFT)) & X2_LANE0_DIG_RX_STAT_STAT_STOP_RESERVED_15_1_MASK)
/*! @} */

