zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DFE_TAPS_EN_MASK (0x20U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DFE_TAPS_EN_SHIFT (5U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DFE_TAPS_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DFE_TAPS_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DFE_TAPS_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DFE_TAPS_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_ADAPTATION_EN_MASK (0x40U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_ADAPTATION_EN_SHIFT (6U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_ADAPTATION_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_ADAPTATION_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_ADAPTATION_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_ADAPTATION_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_LBK_CLK_EN_MASK (0x80U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_LBK_CLK_EN_SHIFT (7U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_LBK_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_LBK_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_LBK_CLK_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_LBK_CLK_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_CTL_OVRD_EN_MASK (0x100U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_CTL_OVRD_EN_SHIFT (8U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_CTL_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_CTL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_CTL_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RX_CTL_OVRD_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RESERVED_15_9_MASK (0xFE00U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RESERVED_15_9_SHIFT (9U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RESERVED_15_9_WIDTH (7U)
#define X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RESERVED_15_9_SHIFT)) & X2_LANE0_DIG_ANA_RX_CTL_OVRD_OUT_RESERVED_15_9_MASK)
/*! @} */

/*! @name LANE0_DIG_ANA_RX_PWR_OVRD_OUT - Override values for RX PWR UP/DN signals going to ANA */
/*! @{ */

#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_LOS_EN_MASK (0x1U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_LOS_EN_SHIFT (0U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_LOS_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_LOS_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_LOS_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_LOS_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_AFE_EN_MASK (0x2U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_AFE_EN_SHIFT (1U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_AFE_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_AFE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_AFE_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_AFE_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_VREG_EN_MASK (0x4U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_VREG_EN_SHIFT (2U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_VREG_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_VREG_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_VREG_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_VREG_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_DCC_EN_MASK (0x8U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_DCC_EN_SHIFT (3U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_DCC_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_DCC_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_DCC_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_DCC_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_EN_MASK (0x10U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_EN_SHIFT (4U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CLK_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CDR_EN_MASK (0x20U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CDR_EN_SHIFT (5U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CDR_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CDR_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CDR_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_CDR_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_DESERIAL_EN_MASK (0x40U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_DESERIAL_EN_SHIFT (6U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_DESERIAL_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_DESERIAL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_DESERIAL_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_ANA_DESERIAL_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_PWR_OVRD_EN_MASK (0x80U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_PWR_OVRD_EN_SHIFT (7U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_PWR_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_PWR_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_PWR_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RX_PWR_OVRD_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RESERVED_15_8_SHIFT)) & X2_LANE0_DIG_ANA_RX_PWR_OVRD_OUT_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0 - Override values for RX VCO signals going to ANA #0 */
/*! @{ */

#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_VCO_EN_MASK (0x1U)
#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_VCO_EN_SHIFT (0U)
#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_VCO_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_VCO_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_VCO_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_VCO_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_STARTUP_MASK (0x2U)
#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_STARTUP_SHIFT (1U)
#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_STARTUP_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_STARTUP(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_STARTUP_SHIFT)) & X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_STARTUP_MASK)

#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_VCO_CDR_OVRD_EN_MASK (0x4U)
#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_VCO_CDR_OVRD_EN_SHIFT (2U)
#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_VCO_CDR_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_VCO_CDR_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_VCO_CDR_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_VCO_CDR_OVRD_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_FREQ_TUNE_MASK (0x1FF8U)
#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_FREQ_TUNE_SHIFT (3U)
#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_FREQ_TUNE_WIDTH (10U)
#define X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_FREQ_TUNE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_FREQ_TUNE_SHIFT)) & X2_LANE0_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_CDR_FREQ_TUNE_MASK)

