zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_RX_ANA_CAL_DAC_CTRL_MASK (0xFFU)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_RX_ANA_CAL_DAC_CTRL_SHIFT (0U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_RX_ANA_CAL_DAC_CTRL_WIDTH (8U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_RX_ANA_CAL_DAC_CTRL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_DAC_CTRL_RX_ANA_CAL_DAC_CTRL_SHIFT)) & X2_LANE0_DIG_ANA_RX_DAC_CTRL_RX_ANA_CAL_DAC_CTRL_MASK)

#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_DAC_CTRL_RESERVED_15_8_SHIFT)) & X2_LANE0_DIG_ANA_RX_DAC_CTRL_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_DIG_ANA_RX_DAC_CTRL_OVRD - Overrides RX DAC CTRL bus (en/val/sel) going to ANA */
/*! @{ */

#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_OVRD_RX_CAL_DAC_CTRL_OVRD_MASK (0x1U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_OVRD_RX_CAL_DAC_CTRL_OVRD_SHIFT (0U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_OVRD_RX_CAL_DAC_CTRL_OVRD_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_OVRD_RX_CAL_DAC_CTRL_OVRD(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_DAC_CTRL_OVRD_RX_CAL_DAC_CTRL_OVRD_SHIFT)) & X2_LANE0_DIG_ANA_RX_DAC_CTRL_OVRD_RX_CAL_DAC_CTRL_OVRD_MASK)

#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_OVRD_RESERVED_15_1_MASK (0xFFFEU)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_OVRD_RESERVED_15_1_SHIFT (1U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_OVRD_RESERVED_15_1_WIDTH (15U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_OVRD_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_DAC_CTRL_OVRD_RESERVED_15_1_SHIFT)) & X2_LANE0_DIG_ANA_RX_DAC_CTRL_OVRD_RESERVED_15_1_MASK)
/*! @} */

/*! @name LANE0_DIG_ANA_RX_DAC_CTRL_SEL - Sets values for RX DAC CTRL Select signal going to ANA */
/*! @{ */

#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_SEL_RX_ANA_CAL_DAC_CTRL_SEL_MASK (0x1FU)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_SEL_RX_ANA_CAL_DAC_CTRL_SEL_SHIFT (0U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_SEL_RX_ANA_CAL_DAC_CTRL_SEL_WIDTH (5U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_SEL_RX_ANA_CAL_DAC_CTRL_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_DAC_CTRL_SEL_RX_ANA_CAL_DAC_CTRL_SEL_SHIFT)) & X2_LANE0_DIG_ANA_RX_DAC_CTRL_SEL_RX_ANA_CAL_DAC_CTRL_SEL_MASK)

#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_SEL_RESERVED_15_5_MASK (0xFFE0U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_SEL_RESERVED_15_5_SHIFT (5U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_SEL_RESERVED_15_5_WIDTH (11U)
#define X2_LANE0_DIG_ANA_RX_DAC_CTRL_SEL_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_DAC_CTRL_SEL_RESERVED_15_5_SHIFT)) & X2_LANE0_DIG_ANA_RX_DAC_CTRL_SEL_RESERVED_15_5_MASK)
/*! @} */

/*! @name LANE0_DIG_ANA_RX_AFE_ATT_VGA - Value for RX AFE ATT & VGA signals going to ANA */
/*! @{ */

#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_ANA_AFE_ATT_LVL_MASK (0x7U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_ANA_AFE_ATT_LVL_SHIFT (0U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_ANA_AFE_ATT_LVL_WIDTH (3U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_ANA_AFE_ATT_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_ANA_AFE_ATT_LVL_SHIFT)) & X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_ANA_AFE_ATT_LVL_MASK)

#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_ANA_AFE_GAIN_MASK (0x78U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_ANA_AFE_GAIN_SHIFT (3U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_ANA_AFE_GAIN_WIDTH (4U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_ANA_AFE_GAIN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_ANA_AFE_GAIN_SHIFT)) & X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_ANA_AFE_GAIN_MASK)

#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RESERVED_MASK (0x780U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RESERVED_SHIFT (7U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RESERVED_WIDTH (4U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RESERVED_SHIFT)) & X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RESERVED_MASK)

#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_AFE_OVRD_EN_MASK (0x800U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_AFE_OVRD_EN_SHIFT (11U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_AFE_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_AFE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_AFE_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RX_AFE_OVRD_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RESERVED_15_12_MASK (0xF000U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RESERVED_15_12_SHIFT (12U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RESERVED_15_12_WIDTH (4U)
#define X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RESERVED_15_12_SHIFT)) & X2_LANE0_DIG_ANA_RX_AFE_ATT_VGA_RESERVED_15_12_MASK)
/*! @} */

/*! @name LANE0_DIG_ANA_RX_AFE_CTLE - Values for RX AFE CTLE signals going to ANA */
/*! @{ */

#define X2_LANE0_DIG_ANA_RX_AFE_CTLE_RESERVED_MASK (0x7U)
#define X2_LANE0_DIG_ANA_RX_AFE_CTLE_RESERVED_SHIFT (0U)
#define X2_LANE0_DIG_ANA_RX_AFE_CTLE_RESERVED_WIDTH (3U)
#define X2_LANE0_DIG_ANA_RX_AFE_CTLE_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_AFE_CTLE_RESERVED_SHIFT)) & X2_LANE0_DIG_ANA_RX_AFE_CTLE_RESERVED_MASK)

#define X2_LANE0_DIG_ANA_RX_AFE_CTLE_RX_ANA_AFE_CTLE_BOOST_MASK (0xF8U)
#define X2_LANE0_DIG_ANA_RX_AFE_CTLE_RX_ANA_AFE_CTLE_BOOST_SHIFT (3U)
#define X2_LANE0_DIG_ANA_RX_AFE_CTLE_RX_ANA_AFE_CTLE_BOOST_WIDTH (5U)
#define X2_LANE0_DIG_ANA_RX_AFE_CTLE_RX_ANA_AFE_CTLE_BOOST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_AFE_CTLE_RX_ANA_AFE_CTLE_BOOST_SHIFT)) & X2_LANE0_DIG_ANA_RX_AFE_CTLE_RX_ANA_AFE_CTLE_BOOST_MASK)

#define X2_LANE0_DIG_ANA_RX_AFE_CTLE_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_DIG_ANA_RX_AFE_CTLE_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_DIG_ANA_RX_AFE_CTLE_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_DIG_ANA_RX_AFE_CTLE_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_AFE_CTLE_RESERVED_15_8_SHIFT)) & X2_LANE0_DIG_ANA_RX_AFE_CTLE_RESERVED_15_8_MASK)
/*! @} */

