zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name LANE0_DIG_ANA_RX_SCOPE - Values for RX SCOPE signals going to ANA */
/*! @{ */

#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_EN_MASK (0x1U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_EN_SHIFT (0U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_SEL_MASK (0x6U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_SEL_SHIFT (1U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_SEL_WIDTH (2U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_SEL_SHIFT)) & X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_SEL_MASK)

#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_PH_CLK_MASK (0x8U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_PH_CLK_SHIFT (3U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_PH_CLK_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_PH_CLK(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_PH_CLK_SHIFT)) & X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_PH_CLK_MASK)

#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_PHASE_MASK (0xFF0U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_PHASE_SHIFT (4U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_PHASE_WIDTH (8U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_PHASE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_PHASE_SHIFT)) & X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_PHASE_MASK)

#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_CLK_EN_MASK (0x1000U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_CLK_EN_SHIFT (12U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_CLK_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_CLK_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_SCOPE_RX_ANA_SCOPE_CLK_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_SCOPE_SELF_CLEAR_DISABLE_MASK (0x2000U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_SCOPE_SELF_CLEAR_DISABLE_SHIFT (13U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_SCOPE_SELF_CLEAR_DISABLE_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RX_SCOPE_SELF_CLEAR_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_SCOPE_RX_SCOPE_SELF_CLEAR_DISABLE_SHIFT)) & X2_LANE0_DIG_ANA_RX_SCOPE_RX_SCOPE_SELF_CLEAR_DISABLE_MASK)

#define X2_LANE0_DIG_ANA_RX_SCOPE_RESERVED_15_14_MASK (0xC000U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RESERVED_15_14_SHIFT (14U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RESERVED_15_14_WIDTH (2U)
#define X2_LANE0_DIG_ANA_RX_SCOPE_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_SCOPE_RESERVED_15_14_SHIFT)) & X2_LANE0_DIG_ANA_RX_SCOPE_RESERVED_15_14_MASK)
/*! @} */

/*! @name LANE0_DIG_ANA_RX_SLICER_CTRL - Sets values for RX Slicer Ctrl signals going to ANA register */
/*! @{ */

#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_E_MASK (0xFU)
#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_E_SHIFT (0U)
#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_E_WIDTH (4U)
#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_E(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_E_SHIFT)) & X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_E_MASK)

#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_O_MASK (0xF0U)
#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_O_SHIFT (4U)
#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_O_WIDTH (4U)
#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_O(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_O_SHIFT)) & X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_O_MASK)

#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_OVRD_EN_MASK (0x100U)
#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_OVRD_EN_SHIFT (8U)
#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_OVRD_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_OVRD_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RX_ANA_SLICER_CTRL_OVRD_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RESERVED_15_9_MASK (0xFE00U)
#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RESERVED_15_9_SHIFT (9U)
#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RESERVED_15_9_WIDTH (7U)
#define X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RESERVED_15_9_SHIFT)) & X2_LANE0_DIG_ANA_RX_SLICER_CTRL_RESERVED_15_9_MASK)
/*! @} */

/*! @name LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST - Sets values for RX ANA IQ PHASE Adjust signal going to ANA register */
/*! @{ */

#define X2_LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST_RX_ANA_IQ_PHASE_ADJUST_MASK (0x7FU)
#define X2_LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST_RX_ANA_IQ_PHASE_ADJUST_SHIFT (0U)
#define X2_LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST_RX_ANA_IQ_PHASE_ADJUST_WIDTH (7U)
#define X2_LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST_RX_ANA_IQ_PHASE_ADJUST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST_RX_ANA_IQ_PHASE_ADJUST_SHIFT)) & X2_LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST_RX_ANA_IQ_PHASE_ADJUST_MASK)

#define X2_LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST_RESERVED_15_7_MASK (0xFF80U)
#define X2_LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST_RESERVED_15_7_SHIFT (7U)
#define X2_LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST_RESERVED_15_7_WIDTH (9U)
#define X2_LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST_RESERVED_15_7(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST_RESERVED_15_7_SHIFT)) & X2_LANE0_DIG_ANA_RX_ANA_IQ_PHASE_ADJUST_RESERVED_15_7_MASK)
/*! @} */

/*! @name LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN - Sets values for RX ANA IQ SENSE signal */
/*! @{ */

#define X2_LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN_RX_ANA_IQ_SENSE_EN_MASK (0x1U)
#define X2_LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN_RX_ANA_IQ_SENSE_EN_SHIFT (0U)
#define X2_LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN_RX_ANA_IQ_SENSE_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN_RX_ANA_IQ_SENSE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN_RX_ANA_IQ_SENSE_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN_RX_ANA_IQ_SENSE_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN_RESERVED_15_1_MASK (0xFFFEU)
#define X2_LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN_RESERVED_15_1_SHIFT (1U)
#define X2_LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN_RESERVED_15_1_WIDTH (15U)
#define X2_LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN_RESERVED_15_1_SHIFT)) & X2_LANE0_DIG_ANA_RX_ANA_IQ_SENSE_EN_RESERVED_15_1_MASK)
/*! @} */

/*! @name LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN - DAC CTRL enable signal */
/*! @{ */

#define X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_RX_ANA_CAL_DAC_CTRL_EN_MASK (0x1U)
#define X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_RX_ANA_CAL_DAC_CTRL_EN_SHIFT (0U)
#define X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_RX_ANA_CAL_DAC_CTRL_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_RX_ANA_CAL_DAC_CTRL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_RX_ANA_CAL_DAC_CTRL_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_RX_ANA_CAL_DAC_CTRL_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_DAC_CTRL_SELF_CLEAR_DISABLE_MASK (0x2U)
#define X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_DAC_CTRL_SELF_CLEAR_DISABLE_SHIFT (1U)
#define X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_DAC_CTRL_SELF_CLEAR_DISABLE_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_DAC_CTRL_SELF_CLEAR_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_DAC_CTRL_SELF_CLEAR_DISABLE_SHIFT)) & X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_DAC_CTRL_SELF_CLEAR_DISABLE_MASK)

#define X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_RESERVED_15_2_MASK (0xFFFCU)
#define X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_RESERVED_15_2_SHIFT (2U)
#define X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_RESERVED_15_2_WIDTH (14U)
#define X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_RESERVED_15_2_SHIFT)) & X2_LANE0_DIG_ANA_RX_ANA_CAL_DAC_CTRL_EN_RESERVED_15_2_MASK)
/*! @} */

/*! @name LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE - Afe update enable signal */
/*! @{ */

#define X2_LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_RX_ANA_AFE_UPDATE_EN_MASK (0x1U)
#define X2_LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_RX_ANA_AFE_UPDATE_EN_SHIFT (0U)
#define X2_LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_RX_ANA_AFE_UPDATE_EN_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_RX_ANA_AFE_UPDATE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_RX_ANA_AFE_UPDATE_EN_SHIFT)) & X2_LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_RX_ANA_AFE_UPDATE_EN_MASK)

#define X2_LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_AFE_UPDATE_SELF_CLEAR_DISABLE_MASK (0x2U)
#define X2_LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_AFE_UPDATE_SELF_CLEAR_DISABLE_SHIFT (1U)
#define X2_LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_AFE_UPDATE_SELF_CLEAR_DISABLE_WIDTH (1U)
#define X2_LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_AFE_UPDATE_SELF_CLEAR_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_AFE_UPDATE_SELF_CLEAR_DISABLE_SHIFT)) & X2_LANE0_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_AFE_UPDATE_SELF_CLEAR_DISABLE_MASK)

