zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_ANA_TX_PWR_OVRD_clk_div_en_reg_MASK (0x8U)
#define X2_LANE0_ANA_TX_PWR_OVRD_clk_div_en_reg_SHIFT (3U)
#define X2_LANE0_ANA_TX_PWR_OVRD_clk_div_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_TX_PWR_OVRD_clk_div_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_PWR_OVRD_clk_div_en_reg_SHIFT)) & X2_LANE0_ANA_TX_PWR_OVRD_clk_div_en_reg_MASK)

#define X2_LANE0_ANA_TX_PWR_OVRD_data_en_reg_MASK (0x10U)
#define X2_LANE0_ANA_TX_PWR_OVRD_data_en_reg_SHIFT (4U)
#define X2_LANE0_ANA_TX_PWR_OVRD_data_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_TX_PWR_OVRD_data_en_reg(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_PWR_OVRD_data_en_reg_SHIFT)) & X2_LANE0_ANA_TX_PWR_OVRD_data_en_reg_MASK)

#define X2_LANE0_ANA_TX_PWR_OVRD_clk_en_reg_MASK (0x20U)
#define X2_LANE0_ANA_TX_PWR_OVRD_clk_en_reg_SHIFT (5U)
#define X2_LANE0_ANA_TX_PWR_OVRD_clk_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_TX_PWR_OVRD_clk_en_reg(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_PWR_OVRD_clk_en_reg_SHIFT)) & X2_LANE0_ANA_TX_PWR_OVRD_clk_en_reg_MASK)

#define X2_LANE0_ANA_TX_PWR_OVRD_serial_en_reg_MASK (0x40U)
#define X2_LANE0_ANA_TX_PWR_OVRD_serial_en_reg_SHIFT (6U)
#define X2_LANE0_ANA_TX_PWR_OVRD_serial_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_TX_PWR_OVRD_serial_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_PWR_OVRD_serial_en_reg_SHIFT)) & X2_LANE0_ANA_TX_PWR_OVRD_serial_en_reg_MASK)

#define X2_LANE0_ANA_TX_PWR_OVRD_ovrd_en_MASK    (0x80U)
#define X2_LANE0_ANA_TX_PWR_OVRD_ovrd_en_SHIFT   (7U)
#define X2_LANE0_ANA_TX_PWR_OVRD_ovrd_en_WIDTH   (1U)
#define X2_LANE0_ANA_TX_PWR_OVRD_ovrd_en(x)      (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_PWR_OVRD_ovrd_en_SHIFT)) & X2_LANE0_ANA_TX_PWR_OVRD_ovrd_en_MASK)

#define X2_LANE0_ANA_TX_PWR_OVRD_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_ANA_TX_PWR_OVRD_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_ANA_TX_PWR_OVRD_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_ANA_TX_PWR_OVRD_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_PWR_OVRD_RESERVED_15_8_SHIFT)) & X2_LANE0_ANA_TX_PWR_OVRD_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_ANA_TX_ALT_BUS - TX_ALT_BUS */
/*! @{ */

#define X2_LANE0_ANA_TX_ALT_BUS_drv_source_reg_MASK (0x3U)
#define X2_LANE0_ANA_TX_ALT_BUS_drv_source_reg_SHIFT (0U)
#define X2_LANE0_ANA_TX_ALT_BUS_drv_source_reg_WIDTH (2U)
#define X2_LANE0_ANA_TX_ALT_BUS_drv_source_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ALT_BUS_drv_source_reg_SHIFT)) & X2_LANE0_ANA_TX_ALT_BUS_drv_source_reg_MASK)

#define X2_LANE0_ANA_TX_ALT_BUS_ovrd_alt_bus_MASK (0x4U)
#define X2_LANE0_ANA_TX_ALT_BUS_ovrd_alt_bus_SHIFT (2U)
#define X2_LANE0_ANA_TX_ALT_BUS_ovrd_alt_bus_WIDTH (1U)
#define X2_LANE0_ANA_TX_ALT_BUS_ovrd_alt_bus(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ALT_BUS_ovrd_alt_bus_SHIFT)) & X2_LANE0_ANA_TX_ALT_BUS_ovrd_alt_bus_MASK)

#define X2_LANE0_ANA_TX_ALT_BUS_NC3_MASK         (0x8U)
#define X2_LANE0_ANA_TX_ALT_BUS_NC3_SHIFT        (3U)
#define X2_LANE0_ANA_TX_ALT_BUS_NC3_WIDTH        (1U)
#define X2_LANE0_ANA_TX_ALT_BUS_NC3(x)           (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ALT_BUS_NC3_SHIFT)) & X2_LANE0_ANA_TX_ALT_BUS_NC3_MASK)

#define X2_LANE0_ANA_TX_ALT_BUS_tx_alt_ringo_MASK (0x70U)
#define X2_LANE0_ANA_TX_ALT_BUS_tx_alt_ringo_SHIFT (4U)
#define X2_LANE0_ANA_TX_ALT_BUS_tx_alt_ringo_WIDTH (3U)
#define X2_LANE0_ANA_TX_ALT_BUS_tx_alt_ringo(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ALT_BUS_tx_alt_ringo_SHIFT)) & X2_LANE0_ANA_TX_ALT_BUS_tx_alt_ringo_MASK)

#define X2_LANE0_ANA_TX_ALT_BUS_jtag_data_reg_MASK (0x80U)
#define X2_LANE0_ANA_TX_ALT_BUS_jtag_data_reg_SHIFT (7U)
#define X2_LANE0_ANA_TX_ALT_BUS_jtag_data_reg_WIDTH (1U)
#define X2_LANE0_ANA_TX_ALT_BUS_jtag_data_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ALT_BUS_jtag_data_reg_SHIFT)) & X2_LANE0_ANA_TX_ALT_BUS_jtag_data_reg_MASK)

#define X2_LANE0_ANA_TX_ALT_BUS_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_ANA_TX_ALT_BUS_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_ANA_TX_ALT_BUS_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_ANA_TX_ALT_BUS_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ALT_BUS_RESERVED_15_8_SHIFT)) & X2_LANE0_ANA_TX_ALT_BUS_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_ANA_TX_ATB1 - TX_ATB1 */
/*! @{ */

#define X2_LANE0_ANA_TX_ATB1_atb_gd_MASK         (0x1U)
#define X2_LANE0_ANA_TX_ATB1_atb_gd_SHIFT        (0U)
#define X2_LANE0_ANA_TX_ATB1_atb_gd_WIDTH        (1U)
#define X2_LANE0_ANA_TX_ATB1_atb_gd(x)           (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ATB1_atb_gd_SHIFT)) & X2_LANE0_ANA_TX_ATB1_atb_gd_MASK)

#define X2_LANE0_ANA_TX_ATB1_atb_vdccm_MASK      (0x2U)
#define X2_LANE0_ANA_TX_ATB1_atb_vdccm_SHIFT     (1U)
#define X2_LANE0_ANA_TX_ATB1_atb_vdccm_WIDTH     (1U)
#define X2_LANE0_ANA_TX_ATB1_atb_vdccm(x)        (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ATB1_atb_vdccm_SHIFT)) & X2_LANE0_ANA_TX_ATB1_atb_vdccm_MASK)

#define X2_LANE0_ANA_TX_ATB1_atb_vdccp_MASK      (0x4U)
#define X2_LANE0_ANA_TX_ATB1_atb_vdccp_SHIFT     (2U)
#define X2_LANE0_ANA_TX_ATB1_atb_vdccp_WIDTH     (1U)
#define X2_LANE0_ANA_TX_ATB1_atb_vdccp(x)        (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ATB1_atb_vdccp_SHIFT)) & X2_LANE0_ANA_TX_ATB1_atb_vdccp_MASK)

#define X2_LANE0_ANA_TX_ATB1_atb_vptx_MASK       (0x8U)
#define X2_LANE0_ANA_TX_ATB1_atb_vptx_SHIFT      (3U)
#define X2_LANE0_ANA_TX_ATB1_atb_vptx_WIDTH      (1U)
#define X2_LANE0_ANA_TX_ATB1_atb_vptx(x)         (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ATB1_atb_vptx_SHIFT)) & X2_LANE0_ANA_TX_ATB1_atb_vptx_MASK)

#define X2_LANE0_ANA_TX_ATB1_override_regref_0_MASK (0x10U)
#define X2_LANE0_ANA_TX_ATB1_override_regref_0_SHIFT (4U)
#define X2_LANE0_ANA_TX_ATB1_override_regref_0_WIDTH (1U)
#define X2_LANE0_ANA_TX_ATB1_override_regref_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ATB1_override_regref_0_SHIFT)) & X2_LANE0_ANA_TX_ATB1_override_regref_0_MASK)

#define X2_LANE0_ANA_TX_ATB1_atb_vreg0_MASK      (0x20U)
#define X2_LANE0_ANA_TX_ATB1_atb_vreg0_SHIFT     (5U)
#define X2_LANE0_ANA_TX_ATB1_atb_vreg0_WIDTH     (1U)
#define X2_LANE0_ANA_TX_ATB1_atb_vreg0(x)        (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ATB1_atb_vreg0_SHIFT)) & X2_LANE0_ANA_TX_ATB1_atb_vreg0_MASK)

#define X2_LANE0_ANA_TX_ATB1_atb_vreg1_MASK      (0x40U)
#define X2_LANE0_ANA_TX_ATB1_atb_vreg1_SHIFT     (6U)
#define X2_LANE0_ANA_TX_ATB1_atb_vreg1_WIDTH     (1U)
#define X2_LANE0_ANA_TX_ATB1_atb_vreg1(x)        (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ATB1_atb_vreg1_SHIFT)) & X2_LANE0_ANA_TX_ATB1_atb_vreg1_MASK)

#define X2_LANE0_ANA_TX_ATB1_NC7_MASK            (0x80U)
#define X2_LANE0_ANA_TX_ATB1_NC7_SHIFT           (7U)
#define X2_LANE0_ANA_TX_ATB1_NC7_WIDTH           (1U)
#define X2_LANE0_ANA_TX_ATB1_NC7(x)              (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ATB1_NC7_SHIFT)) & X2_LANE0_ANA_TX_ATB1_NC7_MASK)

#define X2_LANE0_ANA_TX_ATB1_RESERVED_15_8_MASK  (0xFF00U)
#define X2_LANE0_ANA_TX_ATB1_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_ANA_TX_ATB1_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_ANA_TX_ATB1_RESERVED_15_8(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_ATB1_RESERVED_15_8_SHIFT)) & X2_LANE0_ANA_TX_ATB1_RESERVED_15_8_MASK)
/*! @} */

