zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_ANA_TX_TERM_CODE_term_code_ovrd_MASK (0x1U)
#define X2_LANE0_ANA_TX_TERM_CODE_term_code_ovrd_SHIFT (0U)
#define X2_LANE0_ANA_TX_TERM_CODE_term_code_ovrd_WIDTH (1U)
#define X2_LANE0_ANA_TX_TERM_CODE_term_code_ovrd(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_TERM_CODE_term_code_ovrd_SHIFT)) & X2_LANE0_ANA_TX_TERM_CODE_term_code_ovrd_MASK)

#define X2_LANE0_ANA_TX_TERM_CODE_term_code_reg_MASK (0xFEU)
#define X2_LANE0_ANA_TX_TERM_CODE_term_code_reg_SHIFT (1U)
#define X2_LANE0_ANA_TX_TERM_CODE_term_code_reg_WIDTH (7U)
#define X2_LANE0_ANA_TX_TERM_CODE_term_code_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_TERM_CODE_term_code_reg_SHIFT)) & X2_LANE0_ANA_TX_TERM_CODE_term_code_reg_MASK)

#define X2_LANE0_ANA_TX_TERM_CODE_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_ANA_TX_TERM_CODE_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_ANA_TX_TERM_CODE_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_ANA_TX_TERM_CODE_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_TERM_CODE_RESERVED_15_8_SHIFT)) & X2_LANE0_ANA_TX_TERM_CODE_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_ANA_TX_TERM_CODE_CTRL - TX_TERM_CODE_CTRL */
/*! @{ */

#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_ovrd_MASK (0x1U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_ovrd_SHIFT (0U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_ovrd_WIDTH (1U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_ovrd(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_ovrd_SHIFT)) & X2_LANE0_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_ovrd_MASK)

#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_reg_MASK (0x2U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_reg_SHIFT (1U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_reg_SHIFT)) & X2_LANE0_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_reg_MASK)

#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_dn_ovrd_MASK (0x4U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_dn_ovrd_SHIFT (2U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_dn_ovrd_WIDTH (1U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_dn_ovrd(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_dn_ovrd_SHIFT)) & X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_dn_ovrd_MASK)

#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_dn_reg_MASK (0x8U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_dn_reg_SHIFT (3U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_dn_reg_WIDTH (1U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_dn_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_dn_reg_SHIFT)) & X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_dn_reg_MASK)

#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_up_ovrd_MASK (0x10U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_up_ovrd_SHIFT (4U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_up_ovrd_WIDTH (1U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_up_ovrd(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_up_ovrd_SHIFT)) & X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_up_ovrd_MASK)

#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_up_reg_MASK (0x20U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_up_reg_SHIFT (5U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_up_reg_WIDTH (1U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_up_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_up_reg_SHIFT)) & X2_LANE0_ANA_TX_TERM_CODE_CTRL_update_term_up_reg_MASK)

#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_reset_term_ovrd_MASK (0x40U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_reset_term_ovrd_SHIFT (6U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_reset_term_ovrd_WIDTH (1U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_reset_term_ovrd(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_TERM_CODE_CTRL_reset_term_ovrd_SHIFT)) & X2_LANE0_ANA_TX_TERM_CODE_CTRL_reset_term_ovrd_MASK)

#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_reset_term_reg_MASK (0x80U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_reset_term_reg_SHIFT (7U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_reset_term_reg_WIDTH (1U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_reset_term_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_TERM_CODE_CTRL_reset_term_reg_SHIFT)) & X2_LANE0_ANA_TX_TERM_CODE_CTRL_reset_term_reg_MASK)

#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_ANA_TX_TERM_CODE_CTRL_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_TERM_CODE_CTRL_RESERVED_15_8_SHIFT)) & X2_LANE0_ANA_TX_TERM_CODE_CTRL_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_ANA_TX_IBOOST_CODE - TX_IBOOST_CODE */
/*! @{ */

#define X2_LANE0_ANA_TX_IBOOST_CODE_lfps_high_priority_MASK (0x1U)
#define X2_LANE0_ANA_TX_IBOOST_CODE_lfps_high_priority_SHIFT (0U)
#define X2_LANE0_ANA_TX_IBOOST_CODE_lfps_high_priority_WIDTH (1U)
#define X2_LANE0_ANA_TX_IBOOST_CODE_lfps_high_priority(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_IBOOST_CODE_lfps_high_priority_SHIFT)) & X2_LANE0_ANA_TX_IBOOST_CODE_lfps_high_priority_MASK)

#define X2_LANE0_ANA_TX_IBOOST_CODE_term_code_reg_MASK (0x6U)
#define X2_LANE0_ANA_TX_IBOOST_CODE_term_code_reg_SHIFT (1U)
#define X2_LANE0_ANA_TX_IBOOST_CODE_term_code_reg_WIDTH (2U)
#define X2_LANE0_ANA_TX_IBOOST_CODE_term_code_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_IBOOST_CODE_term_code_reg_SHIFT)) & X2_LANE0_ANA_TX_IBOOST_CODE_term_code_reg_MASK)

#define X2_LANE0_ANA_TX_IBOOST_CODE_iboost_code_ovrd_MASK (0x8U)
#define X2_LANE0_ANA_TX_IBOOST_CODE_iboost_code_ovrd_SHIFT (3U)
#define X2_LANE0_ANA_TX_IBOOST_CODE_iboost_code_ovrd_WIDTH (1U)
#define X2_LANE0_ANA_TX_IBOOST_CODE_iboost_code_ovrd(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_IBOOST_CODE_iboost_code_ovrd_SHIFT)) & X2_LANE0_ANA_TX_IBOOST_CODE_iboost_code_ovrd_MASK)

#define X2_LANE0_ANA_TX_IBOOST_CODE_iboost_code_reg_MASK (0xF0U)
#define X2_LANE0_ANA_TX_IBOOST_CODE_iboost_code_reg_SHIFT (4U)
#define X2_LANE0_ANA_TX_IBOOST_CODE_iboost_code_reg_WIDTH (4U)
#define X2_LANE0_ANA_TX_IBOOST_CODE_iboost_code_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_TX_IBOOST_CODE_iboost_code_reg_SHIFT)) & X2_LANE0_ANA_TX_IBOOST_CODE_iboost_code_reg_MASK)

