zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_ANA_RX_ATB_IQSKEW_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_ANA_RX_ATB_IQSKEW_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_ANA_RX_ATB_IQSKEW_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_ANA_RX_ATB_IQSKEW_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_ATB_IQSKEW_RESERVED_15_8_SHIFT)) & X2_LANE0_ANA_RX_ATB_IQSKEW_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_ANA_RX_DCC_OVRD - RX_DCC_OVRD */
/*! @{ */

#define X2_LANE0_ANA_RX_DCC_OVRD_NC1_0_MASK      (0x3U)
#define X2_LANE0_ANA_RX_DCC_OVRD_NC1_0_SHIFT     (0U)
#define X2_LANE0_ANA_RX_DCC_OVRD_NC1_0_WIDTH     (2U)
#define X2_LANE0_ANA_RX_DCC_OVRD_NC1_0(x)        (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_DCC_OVRD_NC1_0_SHIFT)) & X2_LANE0_ANA_RX_DCC_OVRD_NC1_0_MASK)

#define X2_LANE0_ANA_RX_DCC_OVRD_meas_atb_vdcc_MASK (0xCU)
#define X2_LANE0_ANA_RX_DCC_OVRD_meas_atb_vdcc_SHIFT (2U)
#define X2_LANE0_ANA_RX_DCC_OVRD_meas_atb_vdcc_WIDTH (2U)
#define X2_LANE0_ANA_RX_DCC_OVRD_meas_atb_vdcc(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_DCC_OVRD_meas_atb_vdcc_SHIFT)) & X2_LANE0_ANA_RX_DCC_OVRD_meas_atb_vdcc_MASK)

#define X2_LANE0_ANA_RX_DCC_OVRD_ovrd_rx_loopback_clk_MASK (0x10U)
#define X2_LANE0_ANA_RX_DCC_OVRD_ovrd_rx_loopback_clk_SHIFT (4U)
#define X2_LANE0_ANA_RX_DCC_OVRD_ovrd_rx_loopback_clk_WIDTH (1U)
#define X2_LANE0_ANA_RX_DCC_OVRD_ovrd_rx_loopback_clk(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_DCC_OVRD_ovrd_rx_loopback_clk_SHIFT)) & X2_LANE0_ANA_RX_DCC_OVRD_ovrd_rx_loopback_clk_MASK)

#define X2_LANE0_ANA_RX_DCC_OVRD_rx_loopback_clk_reg_MASK (0x20U)
#define X2_LANE0_ANA_RX_DCC_OVRD_rx_loopback_clk_reg_SHIFT (5U)
#define X2_LANE0_ANA_RX_DCC_OVRD_rx_loopback_clk_reg_WIDTH (1U)
#define X2_LANE0_ANA_RX_DCC_OVRD_rx_loopback_clk_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_DCC_OVRD_rx_loopback_clk_reg_SHIFT)) & X2_LANE0_ANA_RX_DCC_OVRD_rx_loopback_clk_reg_MASK)

#define X2_LANE0_ANA_RX_DCC_OVRD_ovrd_dccandafe_en_MASK (0x40U)
#define X2_LANE0_ANA_RX_DCC_OVRD_ovrd_dccandafe_en_SHIFT (6U)
#define X2_LANE0_ANA_RX_DCC_OVRD_ovrd_dccandafe_en_WIDTH (1U)
#define X2_LANE0_ANA_RX_DCC_OVRD_ovrd_dccandafe_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_DCC_OVRD_ovrd_dccandafe_en_SHIFT)) & X2_LANE0_ANA_RX_DCC_OVRD_ovrd_dccandafe_en_MASK)

#define X2_LANE0_ANA_RX_DCC_OVRD_dcc_en_reg_MASK (0x80U)
#define X2_LANE0_ANA_RX_DCC_OVRD_dcc_en_reg_SHIFT (7U)
#define X2_LANE0_ANA_RX_DCC_OVRD_dcc_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_RX_DCC_OVRD_dcc_en_reg(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_DCC_OVRD_dcc_en_reg_SHIFT)) & X2_LANE0_ANA_RX_DCC_OVRD_dcc_en_reg_MASK)

#define X2_LANE0_ANA_RX_DCC_OVRD_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_ANA_RX_DCC_OVRD_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_ANA_RX_DCC_OVRD_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_ANA_RX_DCC_OVRD_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_DCC_OVRD_RESERVED_15_8_SHIFT)) & X2_LANE0_ANA_RX_DCC_OVRD_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_ANA_RX_PWR_CTRL1 - RX_PWR_CTRL1 */
/*! @{ */

#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_acjt_en_MASK (0x1U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_acjt_en_SHIFT (0U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_acjt_en_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_acjt_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_acjt_en_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_acjt_en_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL1_acjt_en_reg_MASK (0x2U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_acjt_en_reg_SHIFT (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_acjt_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_acjt_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL1_acjt_en_reg_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL1_acjt_en_reg_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_clk_en_MASK (0x4U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_clk_en_SHIFT (2U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_clk_en_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_clk_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_clk_en_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_clk_en_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL1_clk_en_reg_MASK (0x8U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_clk_en_reg_SHIFT (3U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_clk_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_clk_en_reg(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL1_clk_en_reg_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL1_clk_en_reg_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_los_en_MASK (0x10U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_los_en_SHIFT (4U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_los_en_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_los_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_los_en_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_los_en_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL1_los_en_reg_MASK (0x20U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_los_en_reg_SHIFT (5U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_los_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_los_en_reg(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL1_los_en_reg_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL1_los_en_reg_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_afe_en_MASK (0x40U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_afe_en_SHIFT (6U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_afe_en_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_afe_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_afe_en_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL1_ovrd_afe_en_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL1_afe_en_reg_MASK (0x80U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_afe_en_reg_SHIFT (7U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_afe_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_afe_en_reg(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL1_afe_en_reg_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL1_afe_en_reg_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL1_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_ANA_RX_PWR_CTRL1_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL1_RESERVED_15_8_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL1_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_ANA_RX_ATB_REGREF - RX_ATB_REGREF */
/*! @{ */

#define X2_LANE0_ANA_RX_ATB_REGREF_meas_atb_samp_MASK (0x3U)
#define X2_LANE0_ANA_RX_ATB_REGREF_meas_atb_samp_SHIFT (0U)
#define X2_LANE0_ANA_RX_ATB_REGREF_meas_atb_samp_WIDTH (2U)
#define X2_LANE0_ANA_RX_ATB_REGREF_meas_atb_samp(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_ATB_REGREF_meas_atb_samp_SHIFT)) & X2_LANE0_ANA_RX_ATB_REGREF_meas_atb_samp_MASK)

#define X2_LANE0_ANA_RX_ATB_REGREF_NC2_MASK      (0x4U)
#define X2_LANE0_ANA_RX_ATB_REGREF_NC2_SHIFT     (2U)
#define X2_LANE0_ANA_RX_ATB_REGREF_NC2_WIDTH     (1U)
#define X2_LANE0_ANA_RX_ATB_REGREF_NC2(x)        (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_ATB_REGREF_NC2_SHIFT)) & X2_LANE0_ANA_RX_ATB_REGREF_NC2_MASK)

