zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANE0_ANA_RX_ATB_REGREF_override_regref_scope_MASK (0x8U)
#define X2_LANE0_ANA_RX_ATB_REGREF_override_regref_scope_SHIFT (3U)
#define X2_LANE0_ANA_RX_ATB_REGREF_override_regref_scope_WIDTH (1U)
#define X2_LANE0_ANA_RX_ATB_REGREF_override_regref_scope(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_ATB_REGREF_override_regref_scope_SHIFT)) & X2_LANE0_ANA_RX_ATB_REGREF_override_regref_scope_MASK)

#define X2_LANE0_ANA_RX_ATB_REGREF_override_regref_clk_MASK (0x10U)
#define X2_LANE0_ANA_RX_ATB_REGREF_override_regref_clk_SHIFT (4U)
#define X2_LANE0_ANA_RX_ATB_REGREF_override_regref_clk_WIDTH (1U)
#define X2_LANE0_ANA_RX_ATB_REGREF_override_regref_clk(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_ATB_REGREF_override_regref_clk_SHIFT)) & X2_LANE0_ANA_RX_ATB_REGREF_override_regref_clk_MASK)

#define X2_LANE0_ANA_RX_ATB_REGREF_meas_atb_cal_mux_MASK (0xE0U)
#define X2_LANE0_ANA_RX_ATB_REGREF_meas_atb_cal_mux_SHIFT (5U)
#define X2_LANE0_ANA_RX_ATB_REGREF_meas_atb_cal_mux_WIDTH (3U)
#define X2_LANE0_ANA_RX_ATB_REGREF_meas_atb_cal_mux(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_ATB_REGREF_meas_atb_cal_mux_SHIFT)) & X2_LANE0_ANA_RX_ATB_REGREF_meas_atb_cal_mux_MASK)

#define X2_LANE0_ANA_RX_ATB_REGREF_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_ANA_RX_ATB_REGREF_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_ANA_RX_ATB_REGREF_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_ANA_RX_ATB_REGREF_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_ATB_REGREF_RESERVED_15_8_SHIFT)) & X2_LANE0_ANA_RX_ATB_REGREF_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_ANA_RX_CDR_AFE - RX_CDR_AFE */
/*! @{ */

#define X2_LANE0_ANA_RX_CDR_AFE_meas_atb_rx_MASK (0xFU)
#define X2_LANE0_ANA_RX_CDR_AFE_meas_atb_rx_SHIFT (0U)
#define X2_LANE0_ANA_RX_CDR_AFE_meas_atb_rx_WIDTH (4U)
#define X2_LANE0_ANA_RX_CDR_AFE_meas_atb_rx(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_CDR_AFE_meas_atb_rx_SHIFT)) & X2_LANE0_ANA_RX_CDR_AFE_meas_atb_rx_MASK)

#define X2_LANE0_ANA_RX_CDR_AFE_phdet_odd_reg_MASK (0x10U)
#define X2_LANE0_ANA_RX_CDR_AFE_phdet_odd_reg_SHIFT (4U)
#define X2_LANE0_ANA_RX_CDR_AFE_phdet_odd_reg_WIDTH (1U)
#define X2_LANE0_ANA_RX_CDR_AFE_phdet_odd_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_CDR_AFE_phdet_odd_reg_SHIFT)) & X2_LANE0_ANA_RX_CDR_AFE_phdet_odd_reg_MASK)

#define X2_LANE0_ANA_RX_CDR_AFE_phdet_even_reg_MASK (0x20U)
#define X2_LANE0_ANA_RX_CDR_AFE_phdet_even_reg_SHIFT (5U)
#define X2_LANE0_ANA_RX_CDR_AFE_phdet_even_reg_WIDTH (1U)
#define X2_LANE0_ANA_RX_CDR_AFE_phdet_even_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_CDR_AFE_phdet_even_reg_SHIFT)) & X2_LANE0_ANA_RX_CDR_AFE_phdet_even_reg_MASK)

#define X2_LANE0_ANA_RX_CDR_AFE_NC7_6_MASK       (0xC0U)
#define X2_LANE0_ANA_RX_CDR_AFE_NC7_6_SHIFT      (6U)
#define X2_LANE0_ANA_RX_CDR_AFE_NC7_6_WIDTH      (2U)
#define X2_LANE0_ANA_RX_CDR_AFE_NC7_6(x)         (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_CDR_AFE_NC7_6_SHIFT)) & X2_LANE0_ANA_RX_CDR_AFE_NC7_6_MASK)

#define X2_LANE0_ANA_RX_CDR_AFE_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_ANA_RX_CDR_AFE_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_ANA_RX_CDR_AFE_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_ANA_RX_CDR_AFE_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_CDR_AFE_RESERVED_15_8_SHIFT)) & X2_LANE0_ANA_RX_CDR_AFE_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_ANA_RX_PWR_CTRL2 - RX_PWR_CTRL2 */
/*! @{ */

#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_rx_pwr_en_MASK (0x1U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_rx_pwr_en_SHIFT (0U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_rx_pwr_en_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_rx_pwr_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_rx_pwr_en_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_rx_pwr_en_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL2_rx_pwr_en_reg_MASK (0x2U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_rx_pwr_en_reg_SHIFT (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_rx_pwr_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_rx_pwr_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL2_rx_pwr_en_reg_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL2_rx_pwr_en_reg_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_dfe_en_MASK (0x4U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_dfe_en_SHIFT (2U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_dfe_en_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_dfe_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_dfe_en_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_dfe_en_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL2_dfe_en_reg_MASK (0x8U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_dfe_en_reg_SHIFT (3U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_dfe_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_dfe_en_reg(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL2_dfe_en_reg_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL2_dfe_en_reg_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_deserial_en_MASK (0x10U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_deserial_en_SHIFT (4U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_deserial_en_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_deserial_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_deserial_en_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_deserial_en_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL2_deserial_en_reg_MASK (0x20U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_deserial_en_reg_SHIFT (5U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_deserial_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_deserial_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL2_deserial_en_reg_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL2_deserial_en_reg_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_loopback_en_MASK (0x40U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_loopback_en_SHIFT (6U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_loopback_en_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_loopback_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_loopback_en_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL2_ovrd_loopback_en_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL2_loopback_en_reg_MASK (0x80U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_loopback_en_reg_SHIFT (7U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_loopback_en_reg_WIDTH (1U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_loopback_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL2_loopback_en_reg_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL2_loopback_en_reg_MASK)

#define X2_LANE0_ANA_RX_PWR_CTRL2_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_RESERVED_15_8_SHIFT (8U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_RESERVED_15_8_WIDTH (8U)
#define X2_LANE0_ANA_RX_PWR_CTRL2_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_PWR_CTRL2_RESERVED_15_8_SHIFT)) & X2_LANE0_ANA_RX_PWR_CTRL2_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANE0_ANA_RX_MISC_OVRD - RX_MISC_OVRD */
/*! @{ */

#define X2_LANE0_ANA_RX_MISC_OVRD_ovrd_word_clk_en_MASK (0x1U)
#define X2_LANE0_ANA_RX_MISC_OVRD_ovrd_word_clk_en_SHIFT (0U)
#define X2_LANE0_ANA_RX_MISC_OVRD_ovrd_word_clk_en_WIDTH (1U)
#define X2_LANE0_ANA_RX_MISC_OVRD_ovrd_word_clk_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANE0_ANA_RX_MISC_OVRD_ovrd_word_clk_en_SHIFT)) & X2_LANE0_ANA_RX_MISC_OVRD_ovrd_word_clk_en_MASK)

