zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_EN_MASK (0x2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_EN_SHIFT (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_REQ_OVRD_VAL_MASK (0x4U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_REQ_OVRD_VAL_SHIFT (2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_REQ_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_REQ_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_REQ_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_REQ_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_REQ_OVRD_EN_MASK (0x8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_REQ_OVRD_EN_SHIFT (3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_REQ_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_REQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_REQ_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_REQ_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_RESERVED_15_4_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_1_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2 - Override values for incoming RX controls from PCS, register #2 */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LD_VAL_OVRD_MASK (0x1FFFU)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LD_VAL_OVRD_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LD_VAL_OVRD_WIDTH (13U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LD_VAL_OVRD(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LD_VAL_OVRD_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LD_VAL_OVRD_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LD_VAL_OVRD_EN_MASK (0x2000U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LD_VAL_OVRD_EN_SHIFT (13U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LD_VAL_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LD_VAL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LD_VAL_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LD_VAL_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LOWFREQ_VAL_OVRD_MASK (0x4000U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LOWFREQ_VAL_OVRD_SHIFT (14U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LOWFREQ_VAL_OVRD_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LOWFREQ_VAL_OVRD(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LOWFREQ_VAL_OVRD_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LOWFREQ_VAL_OVRD_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LOWFREQ_VAL_OVRD_EN_MASK (0x8000U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LOWFREQ_VAL_OVRD_EN_SHIFT (15U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LOWFREQ_VAL_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LOWFREQ_VAL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LOWFREQ_VAL_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_2_VCO_LOWFREQ_VAL_OVRD_EN_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3 - Override values for incoming RX controls from PCS, register #3 */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_RX_LOS_THRSHLD_OVRD_VAL_MASK (0x7U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_RX_LOS_THRSHLD_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_RX_LOS_THRSHLD_OVRD_VAL_WIDTH (3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_RX_LOS_THRSHLD_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_RX_LOS_THRSHLD_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_RX_LOS_THRSHLD_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_RX_LOS_THRSHLD_OVRD_EN_MASK (0x8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_RX_LOS_THRSHLD_OVRD_EN_SHIFT (3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_RX_LOS_THRSHLD_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_RX_LOS_THRSHLD_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_RX_LOS_THRSHLD_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_RX_LOS_THRSHLD_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_REF_LD_VAL_OVRD_MASK (0x3F0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_REF_LD_VAL_OVRD_SHIFT (4U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_REF_LD_VAL_OVRD_WIDTH (6U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_REF_LD_VAL_OVRD(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_REF_LD_VAL_OVRD_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_REF_LD_VAL_OVRD_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_REF_LD_VAL_OVRD_EN_MASK (0x400U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_REF_LD_VAL_OVRD_EN_SHIFT (10U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_REF_LD_VAL_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_REF_LD_VAL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_REF_LD_VAL_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_REF_LD_VAL_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_REQ_MASK (0x800U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_REQ_SHIFT (11U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_REQ_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_REQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_REQ_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_REQ_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_REQ_OVRD_EN_MASK (0x1000U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_REQ_OVRD_EN_SHIFT (12U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_REQ_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_REQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_REQ_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_REQ_OVRD_EN_MASK)

