zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_CONT_MASK (0x2000U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_CONT_SHIFT (13U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_CONT_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_CONT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_CONT_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_ADAPT_CONT_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_OFFCAN_CONT_MASK (0x4000U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_OFFCAN_CONT_SHIFT (14U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_OFFCAN_CONT_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_OFFCAN_CONT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_OFFCAN_CONT_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_OFFCAN_CONT_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_CONT_OVRD_EN_MASK (0x8000U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_CONT_OVRD_EN_SHIFT (15U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_CONT_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_CONT_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_CONT_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_IN_3_CONT_OVRD_EN_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_PCS_IN - Current values for incoming RX controls from PCS */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_REQ_MASK (0x1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_REQ_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_REQ_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_REQ(x)  (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_REQ_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_REQ_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RATE_MASK (0x6U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RATE_SHIFT (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RATE_WIDTH (2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RATE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RATE_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RATE_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_WIDTH_MASK (0x18U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_WIDTH_SHIFT (3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_WIDTH_WIDTH (2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_WIDTH(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_WIDTH_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_WIDTH_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_PSTATE_MASK (0x60U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_PSTATE_SHIFT (5U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_PSTATE_WIDTH (2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_PSTATE_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_PSTATE_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_LPD_MASK (0x80U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_LPD_SHIFT (7U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_LPD_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_LPD(x)  (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_LPD_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_LPD_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_CDR_VCO_LOWFREQ_MASK (0x100U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_CDR_VCO_LOWFREQ_SHIFT (8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_CDR_VCO_LOWFREQ_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_CDR_VCO_LOWFREQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_CDR_VCO_LOWFREQ_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_CDR_VCO_LOWFREQ_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_AFE_EN_MASK (0x200U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_AFE_EN_SHIFT (9U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_AFE_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_AFE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_AFE_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_AFE_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_DFE_EN_MASK (0x400U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_DFE_EN_SHIFT (10U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_DFE_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_DFE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_DFE_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_DFE_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_REQ_MASK (0x800U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_REQ_SHIFT (11U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_REQ_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_REQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_REQ_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_REQ_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_CONT_MASK (0x1000U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_CONT_SHIFT (12U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_CONT_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_CONT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_CONT_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_ADAPT_CONT_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_OFFCAN_CONT_MASK (0x2000U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_OFFCAN_CONT_SHIFT (13U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_OFFCAN_CONT_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_OFFCAN_CONT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_OFFCAN_CONT_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_OFFCAN_CONT_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RESET_MASK (0x4000U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RESET_SHIFT (14U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RESET_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RESET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RESET_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RESET_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RESERVED_15_15_MASK (0x8000U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RESERVED_15_15_SHIFT (15U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RESERVED_15_15_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RESERVED_15_15_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_RESERVED_15_15_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1 - Current values for incoming RX controls from PCS, register #1 */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1_REF_LD_VAL_MASK (0x3FU)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1_REF_LD_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1_REF_LD_VAL_WIDTH (6U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1_REF_LD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1_REF_LD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1_REF_LD_VAL_MASK)

