zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1_RESERVED_15_6_SHIFT (6U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1_RESERVED_15_6_WIDTH (10U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1_RESERVED_15_6_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_1_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2 - Current values for incoming RX controls from PCS, register #2 */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2_VCO_LD_VAL_MASK (0x1FFFU)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2_VCO_LD_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2_VCO_LD_VAL_WIDTH (13U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2_VCO_LD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2_VCO_LD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2_VCO_LD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2_RESERVED_15_13_MASK (0xE000U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2_RESERVED_15_13_SHIFT (13U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2_RESERVED_15_13_WIDTH (3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2_RESERVED_15_13_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_2_RESERVED_15_13_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3 - Current values for incoming RX controls from PCS, register #3 */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_ATT_LVL_MASK (0x7U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_ATT_LVL_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_ATT_LVL_WIDTH (3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_ATT_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_ATT_LVL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_ATT_LVL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_VGA1_GAIN_MASK (0x78U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_VGA1_GAIN_SHIFT (3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_VGA1_GAIN_WIDTH (4U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_VGA1_GAIN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_VGA1_GAIN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_VGA1_GAIN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_VGA2_GAIN_MASK (0x780U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_VGA2_GAIN_SHIFT (7U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_VGA2_GAIN_WIDTH (4U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_VGA2_GAIN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_VGA2_GAIN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_VGA2_GAIN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_CTLE_BOOST_MASK (0xF800U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_CTLE_BOOST_SHIFT (11U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_CTLE_BOOST_WIDTH (5U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_CTLE_BOOST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_CTLE_BOOST_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_3_EQ_CTLE_BOOST_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4 - Current values for incoming RX controls from PCS, register #4 */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_EQ_CTLE_POLE_MASK (0x7U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_EQ_CTLE_POLE_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_EQ_CTLE_POLE_WIDTH (3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_EQ_CTLE_POLE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_EQ_CTLE_POLE_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_EQ_CTLE_POLE_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_EQ_DFE_TAP1_MASK (0x7F8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_EQ_DFE_TAP1_SHIFT (3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_EQ_DFE_TAP1_WIDTH (8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_EQ_DFE_TAP1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_EQ_DFE_TAP1_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_EQ_DFE_TAP1_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_RESERVED_15_11_MASK (0xF800U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_RESERVED_15_11_SHIFT (11U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_RESERVED_15_11_WIDTH (5U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_RESERVED_15_11_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_IN_4_RESERVED_15_11_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT - Override values for outgoing RX controls to PCS */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_ACK_MASK (0x1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_ACK_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_ACK_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_ACK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_ACK_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_ACK_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_EN_CTL_MASK (0x2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_EN_CTL_SHIFT (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_EN_CTL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_EN_CTL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_EN_CTL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_EN_CTL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_RESERVED_15_2_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_PCS_OUT - Current values for outgoing RX status controls from Raw PCS */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_OUT_ACK_MASK (0x1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_OUT_ACK_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_OUT_ACK_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_OUT_ACK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_OUT_ACK_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_OUT_ACK_MASK)

