zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_OUT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_OUT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_OUT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_PCS_OUT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_PCS_OUT_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_PCS_OUT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK - RX Adaptation Acknowledge */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK_RX_ADAPT_ACK_MASK (0x1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK_RX_ADAPT_ACK_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK_RX_ADAPT_ACK_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK_RX_ADAPT_ACK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK_RX_ADAPT_ACK_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK_RX_ADAPT_ACK_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_ACK_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM - RX Adaptation Figure of Merit */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM_RX_ADAPT_FOM_MASK (0xFFU)
#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM_RX_ADAPT_FOM_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM_RX_ADAPT_FOM_WIDTH (8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM_RX_ADAPT_FOM(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM_RX_ADAPT_FOM_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM_RX_ADAPT_FOM_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_ADAPT_FOM_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR - RX calculated direction for TX-pre */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR_RX_TXPRE_DIR_MASK (0x3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR_RX_TXPRE_DIR_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR_RX_TXPRE_DIR_WIDTH (2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR_RX_TXPRE_DIR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR_RX_TXPRE_DIR_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR_RX_TXPRE_DIR_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR_RESERVED_15_2_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_TXPRE_DIR_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR - RX calculated direction for TX-Main */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR_RX_TXMAIN_DIR_MASK (0x3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR_RX_TXMAIN_DIR_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR_RX_TXMAIN_DIR_WIDTH (2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR_RX_TXMAIN_DIR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR_RX_TXMAIN_DIR_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR_RX_TXMAIN_DIR_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR_RESERVED_15_2_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_TXMAIN_DIR_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR - RX calculated direction for TX-Post */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR_RX_TXPOST_DIR_MASK (0x3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR_RX_TXPOST_DIR_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR_RX_TXPOST_DIR_WIDTH (2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR_RX_TXPOST_DIR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR_RX_TXPOST_DIR_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR_RX_TXPOST_DIR_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR_RESERVED_15_2_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_TXPOST_DIR_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_LANE_NUMBER - Current lane number */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_LANE_NUMBER_LANE_NUMBER_MASK (0xFU)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_NUMBER_LANE_NUMBER_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_NUMBER_LANE_NUMBER_WIDTH (4U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_NUMBER_LANE_NUMBER(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_LANE_NUMBER_LANE_NUMBER_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_LANE_NUMBER_LANE_NUMBER_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_LANE_NUMBER_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_NUMBER_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_NUMBER_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_NUMBER_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_LANE_NUMBER_RESERVED_15_4_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_LANE_NUMBER_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN - Override incoming values for lane_xcvr_mode */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_VAL_MASK (0x3U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_VAL_WIDTH (2U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_VAL_MASK)

