zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_EN_MASK (0x4U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_EN_SHIFT (2U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_RESERVED_15_3_MASK (0xFFF8U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_RESERVED_15_3_SHIFT (3U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_RESERVED_15_3_WIDTH (13U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_RESERVED_15_3(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_RESERVED_15_3_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_RESERVED_15_3_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN - Lane transceiver mode status */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN_LANE_XCVR_MODE_MASK (0x3U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN_LANE_XCVR_MODE_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN_LANE_XCVR_MODE_WIDTH (2U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN_LANE_XCVR_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN_LANE_XCVR_MODE_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN_LANE_XCVR_MODE_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN_RESERVED_15_2_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_LANE_XCVR_MODE_IN_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN - ATE Override input to control top-level inputs */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_VAL_MASK (0x1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_EN_MASK (0x2U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_EN_SHIFT (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_VAL_MASK (0x4U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_VAL_SHIFT (2U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_EN_MASK (0x8U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_EN_SHIFT (3U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_VAL_MASK (0x10U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_VAL_SHIFT (4U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_EN_MASK (0x20U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_EN_SHIFT (5U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_VAL_MASK (0x40U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_VAL_SHIFT (6U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_EN_MASK (0x80U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_EN_SHIFT (7U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_VAL_MASK (0x100U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_VAL_SHIFT (8U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_EN_MASK (0x200U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_EN_SHIFT (9U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_VAL_MASK (0x400U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_VAL_SHIFT (10U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_EN_MASK (0x800U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_EN_SHIFT (11U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_VALUE_MASK (0x7000U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_VALUE_SHIFT (12U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_VALUE_WIDTH (3U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_VALUE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_VALUE_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_VALUE_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_EN_MASK (0x8000U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_EN_SHIFT (15U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_EN_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN - Override incoming values for rx_eq_delta_iq */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_VAL_MASK (0xFU)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_VAL_WIDTH (4U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_VAL_MASK)

