zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_EN_MASK (0x10U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_EN_SHIFT (4U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RESERVED_15_5_MASK (0xFFE0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RESERVED_15_5_SHIFT (5U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RESERVED_15_5_WIDTH (11U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RESERVED_15_5_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RESERVED_15_5_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN - Override incoming values for tx/rx_term_ctrl */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_VAL_MASK (0x7U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_VAL_WIDTH (3U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_EN_MASK (0x8U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_EN_SHIFT (3U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_VAL_MASK (0x70U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_VAL_SHIFT (4U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_VAL_WIDTH (3U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_EN_MASK (0x80U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_EN_SHIFT (7U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN - tx/rx_term_ctrl status */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_RX_TERM_CTRL_MASK (0x7U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_RX_TERM_CTRL_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_RX_TERM_CTRL_WIDTH (3U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_RX_TERM_CTRL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_RX_TERM_CTRL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_RX_TERM_CTRL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_TX_TERM_CTRL_MASK (0x38U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_TX_TERM_CTRL_SHIFT (3U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_TX_TERM_CTRL_WIDTH (3U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_TX_TERM_CTRL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_TX_TERM_CTRL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_TX_TERM_CTRL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_RESERVED_15_6_MASK (0xFFC0U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_RESERVED_15_6_SHIFT (6U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_RESERVED_15_6_WIDTH (10U)
#define X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_RESERVED_15_6_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_TXRX_TERM_CTRL_IN_RESERVED_15_6_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1 - Override values for outgoing RX controls to PCS, register #1 */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_CLK_EN_MASK (0x1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_CLK_EN_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_CLK_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_CLK_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_CLK_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_125MHZ_CLK_OVRD_VAL_MASK (0x2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_125MHZ_CLK_OVRD_VAL_SHIFT (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_125MHZ_CLK_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_125MHZ_CLK_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_125MHZ_CLK_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_125MHZ_CLK_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_125MHZ_CLK_OVRD_EN_MASK (0x4U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_125MHZ_CLK_OVRD_EN_SHIFT (2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_125MHZ_CLK_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_125MHZ_CLK_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_125MHZ_CLK_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RX_125MHZ_CLK_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_DIV16P5RX_CLK_OVRD_VAL_MASK (0x8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_DIV16P5RX_CLK_OVRD_VAL_SHIFT (3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_DIV16P5RX_CLK_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_DIV16P5RX_CLK_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_DIV16P5RX_CLK_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_DIV16P5RX_CLK_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_DIV16P5RX_CLK_OVRD_EN_MASK (0x10U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_DIV16P5RX_CLK_OVRD_EN_SHIFT (4U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_DIV16P5RX_CLK_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_DIV16P5RX_CLK_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_DIV16P5RX_CLK_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_DIV16P5RX_CLK_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_BYPASS_RX_ETH_CLKGEN_FSM_MASK (0x20U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_BYPASS_RX_ETH_CLKGEN_FSM_SHIFT (5U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_BYPASS_RX_ETH_CLKGEN_FSM_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_BYPASS_RX_ETH_CLKGEN_FSM(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_BYPASS_RX_ETH_CLKGEN_FSM_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_BYPASS_RX_ETH_CLKGEN_FSM_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RESERVED_MASK (0xFFC0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RESERVED_SHIFT (6U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RESERVED_WIDTH (10U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RESERVED_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_1_RESERVED_MASK)
/*! @} */

