zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1 - Override values for incoming RX EQ controls from PCS, register #1 */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_AFE_GAIN_OVRD_VAL_MASK (0xFU)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_AFE_GAIN_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_AFE_GAIN_OVRD_VAL_WIDTH (4U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_AFE_GAIN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_AFE_GAIN_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_AFE_GAIN_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_ATT_LVL_OVRD_VAL_MASK (0x70U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_ATT_LVL_OVRD_VAL_SHIFT (4U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_ATT_LVL_OVRD_VAL_WIDTH (3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_ATT_LVL_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_ATT_LVL_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_ATT_LVL_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_OVRD_EN_MASK (0x80U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_OVRD_EN_SHIFT (7U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RX_EQ_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_1_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2 - Override values for incoming RX EQ controls from PCS, register #2 */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RX_EQ_DFE_TAP1_OVRD_VAL_MASK (0xFFU)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RX_EQ_DFE_TAP1_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RX_EQ_DFE_TAP1_OVRD_VAL_WIDTH (8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RX_EQ_DFE_TAP1_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RX_EQ_DFE_TAP1_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RX_EQ_DFE_TAP1_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RX_EQ_CTLE_BOOST_OVRD_VAL_MASK (0x1F00U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RX_EQ_CTLE_BOOST_OVRD_VAL_SHIFT (8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RX_EQ_CTLE_BOOST_OVRD_VAL_WIDTH (5U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RX_EQ_CTLE_BOOST_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RX_EQ_CTLE_BOOST_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RX_EQ_CTLE_BOOST_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RESERVED_15_13_MASK (0xE000U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RESERVED_15_13_SHIFT (13U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RESERVED_15_13_WIDTH (3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RESERVED_15_13_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_EQ_OVRD_IN_2_RESERVED_15_13_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2 - Override value for RX VALID/DATA_EN/DATA_EN/LANE_TX2RX_SER_LB_EN/LANE_RX2TX_PAR_LB_EN signal from PCS */
/*! @{ */

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_VALID_OVRD_VAL_MASK (0x1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_VALID_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_VALID_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_VALID_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_VALID_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_VALID_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_VALID_OVRD_EN_MASK (0x2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_VALID_OVRD_EN_SHIFT (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_VALID_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_VALID_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_VALID_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_VALID_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_OVRD_VAL_MASK (0x4U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_OVRD_VAL_SHIFT (2U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_OVRD_EN_MASK (0x8U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_OVRD_EN_SHIFT (3U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_ATE_OVRD_VAL_MASK (0x10U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_ATE_OVRD_VAL_SHIFT (4U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_ATE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_ATE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_ATE_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_ATE_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_ATE_OVRD_EN_MASK (0x20U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_ATE_OVRD_EN_SHIFT (5U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_ATE_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_DATA_EN_ATE_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_CDR_TRACK_EN_ATE_OVRD_VAL_MASK (0x40U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_CDR_TRACK_EN_ATE_OVRD_VAL_SHIFT (6U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_CDR_TRACK_EN_ATE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_CDR_TRACK_EN_ATE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_CDR_TRACK_EN_ATE_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PCS_XF_RX_OVRD_OUT_2_RX_CDR_TRACK_EN_ATE_OVRD_VAL_MASK)

