zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_FSM_STATUS_MON_WRMSK_DISABLED_MASK (0x200U)
#define X2_RAWLANE0_DIG_FSM_STATUS_MON_WRMSK_DISABLED_SHIFT (9U)
#define X2_RAWLANE0_DIG_FSM_STATUS_MON_WRMSK_DISABLED_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_STATUS_MON_WRMSK_DISABLED(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_STATUS_MON_WRMSK_DISABLED_SHIFT)) & X2_RAWLANE0_DIG_FSM_STATUS_MON_WRMSK_DISABLED_MASK)

#define X2_RAWLANE0_DIG_FSM_STATUS_MON_RDMSK_DISABLED_MASK (0x400U)
#define X2_RAWLANE0_DIG_FSM_STATUS_MON_RDMSK_DISABLED_SHIFT (10U)
#define X2_RAWLANE0_DIG_FSM_STATUS_MON_RDMSK_DISABLED_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_STATUS_MON_RDMSK_DISABLED(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_STATUS_MON_RDMSK_DISABLED_SHIFT)) & X2_RAWLANE0_DIG_FSM_STATUS_MON_RDMSK_DISABLED_MASK)

#define X2_RAWLANE0_DIG_FSM_STATUS_MON_RESERVED_15_11_MASK (0xF800U)
#define X2_RAWLANE0_DIG_FSM_STATUS_MON_RESERVED_15_11_SHIFT (11U)
#define X2_RAWLANE0_DIG_FSM_STATUS_MON_RESERVED_15_11_WIDTH (5U)
#define X2_RAWLANE0_DIG_FSM_STATUS_MON_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_STATUS_MON_RESERVED_15_11_SHIFT)) & X2_RAWLANE0_DIG_FSM_STATUS_MON_RESERVED_15_11_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL - Status of Fast RX Start Up Calibration */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL_FAST_RX_STARTUP_CAL_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL_FAST_RX_STARTUP_CAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL_FAST_RX_STARTUP_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL_FAST_RX_STARTUP_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL_FAST_RX_STARTUP_CAL_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL_FAST_RX_STARTUP_CAL_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_STARTUP_CAL_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_ADAPT - Status of Fast RX Adaptation */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_ADAPT_FAST_RX_ADAPT_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_ADAPT_FAST_RX_ADAPT_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_ADAPT_FAST_RX_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_ADAPT_FAST_RX_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_ADAPT_FAST_RX_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_ADAPT_FAST_RX_ADAPT_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_ADAPT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_ADAPT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_ADAPT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_ADAPT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_ADAPT_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_ADAPT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL - Status of Fast RX AFE Calibration */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL_FAST_RX_AFE_CAL_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL_FAST_RX_AFE_CAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL_FAST_RX_AFE_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL_FAST_RX_AFE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL_FAST_RX_AFE_CAL_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL_FAST_RX_AFE_CAL_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_CAL_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL - Status of Fast RX DFE Calibration */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL_FAST_RX_DFE_CAL_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL_FAST_RX_DFE_CAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL_FAST_RX_DFE_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL_FAST_RX_DFE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL_FAST_RX_DFE_CAL_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL_FAST_RX_DFE_CAL_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_CAL_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT - Enables fast RX DFE re -adaptation */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT_FAST_RX_DFE_RE_ADAPT_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT_FAST_RX_DFE_RE_ADAPT_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT_FAST_RX_DFE_RE_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT_FAST_RX_DFE_RE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT_FAST_RX_DFE_RE_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT_FAST_RX_DFE_RE_ADAPT_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_RE_ADAPT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL - Status of Fast RX Reference Level Calibration */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL_FAST_RX_REFLVL_CAL_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL_FAST_RX_REFLVL_CAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL_FAST_RX_REFLVL_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL_FAST_RX_REFLVL_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL_FAST_RX_REFLVL_CAL_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL_FAST_RX_REFLVL_CAL_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_REFLVL_CAL_RESERVED_15_1_MASK)
/*! @} */

