zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL - Status of Fast RX IQ Calibration */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL_FAST_RX_IQ_CAL_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL_FAST_RX_IQ_CAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL_FAST_RX_IQ_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL_FAST_RX_IQ_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL_FAST_RX_IQ_CAL_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL_FAST_RX_IQ_CAL_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_IQ_CAL_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT - Status of Fast RX AFE Adaptation */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT_FAST_RX_AFE_ADAPT_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT_FAST_RX_AFE_ADAPT_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT_FAST_RX_AFE_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT_FAST_RX_AFE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT_FAST_RX_AFE_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT_FAST_RX_AFE_ADAPT_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_AFE_ADAPT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT - Status of Fast RX DFE Adaptation */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT_FAST_RX_DFE_ADAPT_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT_FAST_RX_DFE_ADAPT_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT_FAST_RX_DFE_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT_FAST_RX_DFE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT_FAST_RX_DFE_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT_FAST_RX_DFE_ADAPT_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_DFE_ADAPT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_SUP - Status of Fast Support block */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_SUP_FAST_SUP_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_SUP_FAST_SUP_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_SUP_FAST_SUP_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_SUP_FAST_SUP(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_SUP_FAST_SUP_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_SUP_FAST_SUP_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_SUP_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_SUP_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_SUP_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_SUP_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_SUP_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_SUP_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE - Status of Fast TX Common-mode Charge-up */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE_FAST_TX_CMN_MODE_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE_FAST_TX_CMN_MODE_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE_FAST_TX_CMN_MODE_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE_FAST_TX_CMN_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE_FAST_TX_CMN_MODE_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE_FAST_TX_CMN_MODE_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_TX_CMN_MODE_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_TX_RXDET - Status of Fast TX detect RX */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_TX_RXDET_FAST_TX_RXDET_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_TX_RXDET_FAST_TX_RXDET_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_TX_RXDET_FAST_TX_RXDET_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_TX_RXDET_FAST_TX_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_TX_RXDET_FAST_TX_RXDET_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_TX_RXDET_FAST_TX_RXDET_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_TX_RXDET_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_TX_RXDET_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_TX_RXDET_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_TX_RXDET_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_TX_RXDET_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_TX_RXDET_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_PWRUP - Status of Fast RX Power-up */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_PWRUP_FAST_RX_PWRUP_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_PWRUP_FAST_RX_PWRUP_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_PWRUP_FAST_RX_PWRUP_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_PWRUP_FAST_RX_PWRUP(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_PWRUP_FAST_RX_PWRUP_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_PWRUP_FAST_RX_PWRUP_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_PWRUP_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_PWRUP_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_PWRUP_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_PWRUP_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_PWRUP_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_PWRUP_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT - Status of Fast RX VCO Wait Times */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT_FAST_RX_VCO_WAIT_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT_FAST_RX_VCO_WAIT_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT_FAST_RX_VCO_WAIT_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT_FAST_RX_VCO_WAIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT_FAST_RX_VCO_WAIT_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT_FAST_RX_VCO_WAIT_MASK)

