zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_WAIT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL - Status of Fast RX VCO Calibration */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL_FAST_RX_VCO_CAL_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL_FAST_RX_VCO_CAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL_FAST_RX_VCO_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL_FAST_RX_VCO_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL_FAST_RX_VCO_CAL_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL_FAST_RX_VCO_CAL_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_VCO_CAL_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS - Status of MPLL common calibration initiation */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_INIT_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_INIT_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_INIT_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_INIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_INIT_SHIFT)) & X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_INIT_MASK)

#define X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_DONE_MASK (0x2U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_DONE_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_DONE_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_DONE_SHIFT)) & X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_DONE_MASK)

#define X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_RESERVED_15_2_SHIFT)) & X2_RAWLANE0_DIG_FSM_CMNCAL_MPLL_STATUS_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT - Status of Fast RX Continuous Calibration/Adaptation */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_FAST_RX_CONT_CAL_ADAPT_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_FAST_RX_CONT_CAL_ADAPT_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_FAST_RX_CONT_CAL_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_FAST_RX_CONT_CAL_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_FAST_RX_CONT_CAL_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_FAST_RX_CONT_CAL_ADAPT_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT - Status of Fast RX Continuous Adaptation */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT_FAST_RX_CONT_ADAPT_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT_FAST_RX_CONT_ADAPT_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT_FAST_RX_CONT_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT_FAST_RX_CONT_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT_FAST_RX_CONT_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT_FAST_RX_CONT_ADAPT_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_ADAPT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL - Status of Fast RX Continuous Data Calibration */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL_FAST_RX_CONT_DATA_CAL_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL_FAST_RX_CONT_DATA_CAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL_FAST_RX_CONT_DATA_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL_FAST_RX_CONT_DATA_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL_FAST_RX_CONT_DATA_CAL_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL_FAST_RX_CONT_DATA_CAL_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_DATA_CAL_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL - Status of Fast RX Continuous Phase Calibration */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL_FAST_RX_CONT_PHASE_CAL_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL_FAST_RX_CONT_PHASE_CAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL_FAST_RX_CONT_PHASE_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL_FAST_RX_CONT_PHASE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL_FAST_RX_CONT_PHASE_CAL_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL_FAST_RX_CONT_PHASE_CAL_MASK)

#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_FSM_FAST_RX_CONT_PHASE_CAL_RESERVED_15_1_MASK)
/*! @} */

