zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_INIT_MASK (0x1U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_INIT_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_INIT_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_INIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_INIT_SHIFT)) & X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_INIT_MASK)

#define X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_DONE_MASK (0x2U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_DONE_SHIFT (1U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_DONE_WIDTH (1U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_DONE_SHIFT)) & X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_DONE_MASK)

#define X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_RESERVED_15_2_SHIFT)) & X2_RAWLANE0_DIG_FSM_CMNCAL_RCAL_STATUS_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET - Offset value for IQ Phase Calculation */
/*! @{ */

#define X2_RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET_RX_IQ_PHASE_OFFSET_MASK (0xFU)
#define X2_RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET_RX_IQ_PHASE_OFFSET_SHIFT (0U)
#define X2_RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET_RX_IQ_PHASE_OFFSET_WIDTH (4U)
#define X2_RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET_RX_IQ_PHASE_OFFSET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET_RX_IQ_PHASE_OFFSET_SHIFT)) & X2_RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET_RX_IQ_PHASE_OFFSET_MASK)

#define X2_RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET_RESERVED_15_4_SHIFT)) & X2_RAWLANE0_DIG_FSM_RX_IQ_PHASE_OFFSET_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST - Offset value for RX AFE ATT iDAC */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST_AFE_ATT_IDAC_OFST_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST_AFE_ATT_IDAC_OFST_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST_AFE_ATT_IDAC_OFST_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST_AFE_ATT_IDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST_AFE_ATT_IDAC_OFST_SHIFT)) & X2_RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST_AFE_ATT_IDAC_OFST_MASK)

#define X2_RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_AFE_ATT_IDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST - Offset value for RX AFE CTLE iDAC */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST_AFE_CTLE_IDAC_OFST_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST_AFE_CTLE_IDAC_OFST_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST_AFE_CTLE_IDAC_OFST_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST_AFE_CTLE_IDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST_AFE_CTLE_IDAC_OFST_SHIFT)) & X2_RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST_AFE_CTLE_IDAC_OFST_MASK)

#define X2_RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_AFE_CTLE_IDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE - Reference level for RX AFE Adaptation */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE_ADAPT_REF_LVL_DAC_CODE_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE_ADAPT_REF_LVL_DAC_CODE_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE_ADAPT_REF_LVL_DAC_CODE_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE_ADAPT_REF_LVL_DAC_CODE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE_ADAPT_REF_LVL_DAC_CODE_SHIFT)) & X2_RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE_ADAPT_REF_LVL_DAC_CODE_MASK)

#define X2_RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_ADAPT_REF_LVL_DAC_CODE_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_RX_ADAPT_FOM - Adaptation Figure of Merit (FOM) */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_RX_ADAPT_FOM_RX_ADAPT_FOM_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_RX_ADAPT_FOM_RX_ADAPT_FOM_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_RX_ADAPT_FOM_RX_ADAPT_FOM_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_RX_ADAPT_FOM_RX_ADAPT_FOM(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_ADAPT_FOM_RX_ADAPT_FOM_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_ADAPT_FOM_RX_ADAPT_FOM_MASK)

#define X2_RAWLANE0_DIG_AON_RX_ADAPT_FOM_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_RX_ADAPT_FOM_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_RX_ADAPT_FOM_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_RX_ADAPT_FOM_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_ADAPT_FOM_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_ADAPT_FOM_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST - Offset values for RX CTLE Loopback path iDAC */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_AFE_CTLE_LBK_IDAC_OFST_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_AFE_CTLE_LBK_IDAC_OFST_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_AFE_CTLE_LBK_IDAC_OFST_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_AFE_CTLE_LBK_IDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_AFE_CTLE_LBK_IDAC_OFST_SHIFT)) & X2_RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_AFE_CTLE_LBK_IDAC_OFST_MASK)

