zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST - Offset values for RX DFE Phase Even vDAC */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_DFE_PHASE_EVEN_VDAC_OFST_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_DFE_PHASE_EVEN_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_DFE_PHASE_EVEN_VDAC_OFST_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_DFE_PHASE_EVEN_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_DFE_PHASE_EVEN_VDAC_OFST_SHIFT)) & X2_RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_DFE_PHASE_EVEN_VDAC_OFST_MASK)

#define X2_RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST - Offset values for RX DFE Phase Odd vDAC */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_DFE_PHASE_ODD_VDAC_OFST_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_DFE_PHASE_ODD_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_DFE_PHASE_ODD_VDAC_OFST_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_DFE_PHASE_ODD_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_DFE_PHASE_ODD_VDAC_OFST_SHIFT)) & X2_RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_DFE_PHASE_ODD_VDAC_OFST_MASK)

#define X2_RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL - DFE Even reference level */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL_DFE_EVEN_REF_LVL_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL_DFE_EVEN_REF_LVL_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL_DFE_EVEN_REF_LVL_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL_DFE_EVEN_REF_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL_DFE_EVEN_REF_LVL_SHIFT)) & X2_RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL_DFE_EVEN_REF_LVL_MASK)

#define X2_RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_DFE_EVEN_REF_LVL_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_DFE_ODD_REF_LVL - DFE Odd reference level */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_DFE_ODD_REF_LVL_DFE_ODD_REF_LVL_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_DFE_ODD_REF_LVL_DFE_ODD_REF_LVL_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_DFE_ODD_REF_LVL_DFE_ODD_REF_LVL_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_DFE_ODD_REF_LVL_DFE_ODD_REF_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_DFE_ODD_REF_LVL_DFE_ODD_REF_LVL_SHIFT)) & X2_RAWLANE0_DIG_AON_DFE_ODD_REF_LVL_DFE_ODD_REF_LVL_MASK)

#define X2_RAWLANE0_DIG_AON_DFE_ODD_REF_LVL_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_DFE_ODD_REF_LVL_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_DFE_ODD_REF_LVL_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_DFE_ODD_REF_LVL_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_DFE_ODD_REF_LVL_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_DFE_ODD_REF_LVL_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_RX_PHSADJ_LIN - RX Phase Adjust Linear Value */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RX_PHSADJ_LIN_MASK (0x1FU)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RX_PHSADJ_LIN_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RX_PHSADJ_LIN_WIDTH (5U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RX_PHSADJ_LIN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RX_PHSADJ_LIN_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RX_PHSADJ_LIN_MASK)

#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RESERVED_15_5_MASK (0xFFE0U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RESERVED_15_5_SHIFT (5U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RESERVED_15_5_WIDTH (11U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RESERVED_15_5_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RESERVED_15_5_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_RX_PHSADJ_MAP - RX Phase Adjust Mapped Value */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_MAP_RX_PHSADJ_MAP_MASK (0x1FU)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_MAP_RX_PHSADJ_MAP_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_MAP_RX_PHSADJ_MAP_WIDTH (5U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_MAP_RX_PHSADJ_MAP(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_PHSADJ_MAP_RX_PHSADJ_MAP_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_PHSADJ_MAP_RX_PHSADJ_MAP_MASK)

#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_MAP_RESERVED_15_5_MASK (0xFFE0U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_MAP_RESERVED_15_5_SHIFT (5U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_MAP_RESERVED_15_5_WIDTH (11U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_MAP_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_PHSADJ_MAP_RESERVED_15_5_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_PHSADJ_MAP_RESERVED_15_5_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST - Offset values for RX DFE Data Even High vDAC */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_DFE_DATA_EVEN_HIGH_VDAC_OFST_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_DFE_DATA_EVEN_HIGH_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_DFE_DATA_EVEN_HIGH_VDAC_OFST_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_DFE_DATA_EVEN_HIGH_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_DFE_DATA_EVEN_HIGH_VDAC_OFST_SHIFT)) & X2_RAWLANE0_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_DFE_DATA_EVEN_HIGH_VDAC_OFST_MASK)

