zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_SHIFT)) & X2_RAWLANE0_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_MASK)

#define X2_RAWLANE0_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST - Offset values for RX DFE Error Odd vDAC */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_SHIFT)) & X2_RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_MASK)

#define X2_RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST - Value for RX IQ PHASE Adjust */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST_RX_IQ_PHASE_ADJUST_MASK (0x7FU)
#define X2_RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST_RX_IQ_PHASE_ADJUST_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST_RX_IQ_PHASE_ADJUST_WIDTH (7U)
#define X2_RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST_RX_IQ_PHASE_ADJUST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST_RX_IQ_PHASE_ADJUST_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST_RX_IQ_PHASE_ADJUST_MASK)

#define X2_RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST_RESERVED_15_7_MASK (0xFF80U)
#define X2_RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST_RESERVED_15_7_SHIFT (7U)
#define X2_RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST_RESERVED_15_7_WIDTH (9U)
#define X2_RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST_RESERVED_15_7(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST_RESERVED_15_7_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_IQ_PHASE_ADJUST_RESERVED_15_7_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE - MPLLA_COARSE_TUNE */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE_MPLLA_COARSE_TUNE_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE_MPLLA_COARSE_TUNE_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE_MPLLA_COARSE_TUNE_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE_MPLLA_COARSE_TUNE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE_MPLLA_COARSE_TUNE_SHIFT)) & X2_RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE_MPLLA_COARSE_TUNE_MASK)

#define X2_RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_MPLLA_COARSE_TUNE_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE - MPLLB_COARSE_TUNE */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE_MPLLB_COARSE_TUNE_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE_MPLLB_COARSE_TUNE_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE_MPLLB_COARSE_TUNE_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE_MPLLB_COARSE_TUNE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE_MPLLB_COARSE_TUNE_SHIFT)) & X2_RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE_MPLLB_COARSE_TUNE_MASK)

#define X2_RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_MPLLB_COARSE_TUNE_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_INIT_PWRUP_DONE - Initial Power-Up Done Status */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_INIT_PWRUP_DONE_INIT_PWRUP_DONE_MASK (0x1U)
#define X2_RAWLANE0_DIG_AON_INIT_PWRUP_DONE_INIT_PWRUP_DONE_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_INIT_PWRUP_DONE_INIT_PWRUP_DONE_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_INIT_PWRUP_DONE_INIT_PWRUP_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_INIT_PWRUP_DONE_INIT_PWRUP_DONE_SHIFT)) & X2_RAWLANE0_DIG_AON_INIT_PWRUP_DONE_INIT_PWRUP_DONE_MASK)

#define X2_RAWLANE0_DIG_AON_INIT_PWRUP_DONE_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_AON_INIT_PWRUP_DONE_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_AON_INIT_PWRUP_DONE_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_AON_INIT_PWRUP_DONE_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_INIT_PWRUP_DONE_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_AON_INIT_PWRUP_DONE_RESERVED_15_1_MASK)
/*! @} */

