zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_CAL_MASK (0x8U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_CAL_SHIFT (3U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_CAL_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_CAL_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_RE_ADAPT_MASK (0x10U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_RE_ADAPT_SHIFT (4U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_RE_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_RE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_RE_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_RE_ADAPT_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_REFLVL_CAL_MASK (0x20U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_REFLVL_CAL_SHIFT (5U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_REFLVL_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_REFLVL_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_REFLVL_CAL_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_REFLVL_CAL_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_IQ_CAL_MASK (0x40U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_IQ_CAL_SHIFT (6U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_IQ_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_IQ_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_IQ_CAL_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_IQ_CAL_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_AFE_ADAPT_MASK (0x80U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_AFE_ADAPT_SHIFT (7U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_AFE_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_AFE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_AFE_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_AFE_ADAPT_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_ADAPT_MASK (0x100U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_ADAPT_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_DFE_ADAPT_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_SUP_MASK (0x200U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_SUP_SHIFT (9U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_SUP_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_SUP(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_SUP_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_SUP_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_TX_CMN_MODE_MASK (0x400U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_TX_CMN_MODE_SHIFT (10U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_TX_CMN_MODE_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_TX_CMN_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_TX_CMN_MODE_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_TX_CMN_MODE_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_TX_RXDET_MASK (0x800U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_TX_RXDET_SHIFT (11U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_TX_RXDET_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_TX_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_TX_RXDET_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_TX_RXDET_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_PWRUP_MASK (0x1000U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_PWRUP_SHIFT (12U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_PWRUP_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_PWRUP(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_PWRUP_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_PWRUP_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_VCO_WAIT_MASK (0x2000U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_VCO_WAIT_SHIFT (13U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_VCO_WAIT_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_VCO_WAIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_VCO_WAIT_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_VCO_WAIT_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_VCO_CAL_MASK (0x4000U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_VCO_CAL_SHIFT (14U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_VCO_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_VCO_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_VCO_CAL_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_FAST_RX_VCO_CAL_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_RESERVED_15_15_MASK (0x8000U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_RESERVED_15_15_SHIFT (15U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_RESERVED_15_15_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_RESERVED_15_15_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_RESERVED_15_15_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2 - RX Adapted value of DFE TAP2 */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2_DFE_TAP2_ADPT_VAL_MASK (0xFFFU)
#define X2_RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2_DFE_TAP2_ADPT_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2_DFE_TAP2_ADPT_VAL_WIDTH (12U)
#define X2_RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2_DFE_TAP2_ADPT_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2_DFE_TAP2_ADPT_VAL_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2_DFE_TAP2_ADPT_VAL_MASK)

#define X2_RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2_RESERVED_15_12_MASK (0xF000U)
#define X2_RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2_RESERVED_15_12_SHIFT (12U)
#define X2_RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2_RESERVED_15_12_WIDTH (4U)
#define X2_RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2_RESERVED_15_12_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_ADPT_DFE_TAP2_RESERVED_15_12_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT - RX last stable iq phase of Right of the eye */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT_RX_PHSADJ_LIN_RIGHT_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT_RX_PHSADJ_LIN_RIGHT_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT_RX_PHSADJ_LIN_RIGHT_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT_RX_PHSADJ_LIN_RIGHT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT_RX_PHSADJ_LIN_RIGHT_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT_RX_PHSADJ_LIN_RIGHT_MASK)

#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT_RESERVED_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT_RESERVED_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT_RESERVED_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT_RESERVED_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_RIGHT_RESERVED_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT - RX last stable iq phase of Left of the eye */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT_RX_PHSADJ_LIN_LEFT_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT_RX_PHSADJ_LIN_LEFT_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT_RX_PHSADJ_LIN_LEFT_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT_RX_PHSADJ_LIN_LEFT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT_RX_PHSADJ_LIN_LEFT_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT_RX_PHSADJ_LIN_LEFT_MASK)

#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT_RESERVED_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT_RESERVED_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT_RESERVED_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT_RESERVED_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_LEFT_RESERVED_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT - RX Adapted value of PHASE IQ */
/*! @{ */

