zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT_RX_PHSADJ_LIN_ADAPT_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT_RX_PHSADJ_LIN_ADAPT_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT_RX_PHSADJ_LIN_ADAPT_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT_RX_PHSADJ_LIN_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT_RX_PHSADJ_LIN_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT_RX_PHSADJ_LIN_ADAPT_MASK)

#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT_RESERVED_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT_RESERVED_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT_RESERVED_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT_RESERVED_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_PHSADJ_LIN_ADAPT_RESERVED_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN - Sets values for RX SLICER CTRL EVEN signals going to ANA */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_MASK (0xFU)
#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_WIDTH (4U)
#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_MASK)

#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN_RESERVED_15_4_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_EVEN_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD - Sets values for RX SLICER CTRL ODD signals going to ANA */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_MASK (0xFU)
#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_WIDTH (4U)
#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_MASK)

#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD_RESERVED_15_4_SHIFT)) & X2_RAWLANE0_DIG_AON_RX_SLICER_CTRL_ODD_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS - MPLL Common Calibration Status */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_INIT_MASK (0x1U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_INIT_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_INIT_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_INIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_INIT_SHIFT)) & X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_INIT_MASK)

#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_DONE_MASK (0x2U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_DONE_SHIFT (1U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_DONE_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_DONE_SHIFT)) & X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_DONE_MASK)

#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_RESERVED_15_2_SHIFT)) & X2_RAWLANE0_DIG_AON_LANE_CMNCAL_MPLL_STATUS_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_ADPT_CTL_0 - Adaptation Control register #0 */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_ADPT_CTL_0_VAL_MASK  (0xFFFFU)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_0_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_0_VAL_WIDTH (16U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_0_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_ADPT_CTL_0_VAL_SHIFT)) & X2_RAWLANE0_DIG_AON_ADPT_CTL_0_VAL_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_ADPT_CTL_1 - Adaptation Control register #1 */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_ADPT_CTL_1_VAL_MASK  (0xFFFFU)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_1_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_1_VAL_WIDTH (16U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_1_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_ADPT_CTL_1_VAL_SHIFT)) & X2_RAWLANE0_DIG_AON_ADPT_CTL_1_VAL_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_ADPT_CTL_2 - Adaptation Control register #2 */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_ADPT_CTL_2_VAL_MASK  (0xFFFFU)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_2_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_2_VAL_WIDTH (16U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_2_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_ADPT_CTL_2_VAL_SHIFT)) & X2_RAWLANE0_DIG_AON_ADPT_CTL_2_VAL_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_ADPT_CTL_3 - Adaptation Control register #3 */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_ADPT_CTL_3_VAL_MASK  (0xFFFFU)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_3_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_3_VAL_WIDTH (16U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_3_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_ADPT_CTL_3_VAL_SHIFT)) & X2_RAWLANE0_DIG_AON_ADPT_CTL_3_VAL_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_ADPT_CTL_4 - Adaptation Control register #4 */
/*! @{ */

