zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_4_VAL_MASK  (0xFFFFU)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_4_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_4_VAL_WIDTH (16U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_4_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_ADPT_CTL_4_VAL_SHIFT)) & X2_RAWLANE0_DIG_AON_ADPT_CTL_4_VAL_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_ADPT_CTL_5 - Adaptation Control register #5 */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_ADPT_CTL_5_VAL_MASK  (0xFFFFU)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_5_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_5_VAL_WIDTH (16U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_5_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_ADPT_CTL_5_VAL_SHIFT)) & X2_RAWLANE0_DIG_AON_ADPT_CTL_5_VAL_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_ADPT_CTL_6 - Adaptation Control register #6 */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_ADPT_CTL_6_VAL_MASK  (0xFFFFU)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_6_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_6_VAL_WIDTH (16U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_6_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_ADPT_CTL_6_VAL_SHIFT)) & X2_RAWLANE0_DIG_AON_ADPT_CTL_6_VAL_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_ADPT_CTL_7 - Adaptation Control register #7 */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_ADPT_CTL_7_VAL_MASK  (0xFFFFU)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_7_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_7_VAL_WIDTH (16U)
#define X2_RAWLANE0_DIG_AON_ADPT_CTL_7_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_ADPT_CTL_7_VAL_SHIFT)) & X2_RAWLANE0_DIG_AON_ADPT_CTL_7_VAL_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_MPLL_DISABLE - LANE_MPLLA/B_DISABLE override */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_MPLL_DISABLE_LANE_MPLLA_DISABLE_MASK (0x1U)
#define X2_RAWLANE0_DIG_AON_MPLL_DISABLE_LANE_MPLLA_DISABLE_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_MPLL_DISABLE_LANE_MPLLA_DISABLE_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_MPLL_DISABLE_LANE_MPLLA_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_MPLL_DISABLE_LANE_MPLLA_DISABLE_SHIFT)) & X2_RAWLANE0_DIG_AON_MPLL_DISABLE_LANE_MPLLA_DISABLE_MASK)

#define X2_RAWLANE0_DIG_AON_MPLL_DISABLE_LANE_MPLLB_DISABLE_MASK (0x2U)
#define X2_RAWLANE0_DIG_AON_MPLL_DISABLE_LANE_MPLLB_DISABLE_SHIFT (1U)
#define X2_RAWLANE0_DIG_AON_MPLL_DISABLE_LANE_MPLLB_DISABLE_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_MPLL_DISABLE_LANE_MPLLB_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_MPLL_DISABLE_LANE_MPLLB_DISABLE_SHIFT)) & X2_RAWLANE0_DIG_AON_MPLL_DISABLE_LANE_MPLLB_DISABLE_MASK)

#define X2_RAWLANE0_DIG_AON_MPLL_DISABLE_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANE0_DIG_AON_MPLL_DISABLE_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANE0_DIG_AON_MPLL_DISABLE_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANE0_DIG_AON_MPLL_DISABLE_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_MPLL_DISABLE_RESERVED_15_2_SHIFT)) & X2_RAWLANE0_DIG_AON_MPLL_DISABLE_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_FAST_FLAGS_2 - Fast flags for simulation only */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_CAL_ADAPT_MASK (0x1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_CAL_ADAPT_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_CAL_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_CAL_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_CAL_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_CAL_ADAPT_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_ADAPT_MASK (0x2U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_ADAPT_SHIFT (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_ADAPT_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_DATA_CAL_MASK (0x4U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_DATA_CAL_SHIFT (2U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_DATA_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_DATA_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_DATA_CAL_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_DATA_CAL_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_PHASE_CAL_MASK (0x8U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_PHASE_CAL_SHIFT (3U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_PHASE_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_PHASE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_PHASE_CAL_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_PHASE_CAL_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_AFE_CAL_MASK (0x10U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_AFE_CAL_SHIFT (4U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_AFE_CAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_AFE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_AFE_CAL_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_AFE_CAL_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_IQ_ADAPT_MASK (0x20U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_IQ_ADAPT_SHIFT (5U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_IQ_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_IQ_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_IQ_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_IQ_ADAPT_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RX_IQ_DELTA_ADD_MASK (0x40U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RX_IQ_DELTA_ADD_SHIFT (6U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RX_IQ_DELTA_ADD_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RX_IQ_DELTA_ADD(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RX_IQ_DELTA_ADD_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RX_IQ_DELTA_ADD_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_ATT_ADAPT_MASK (0x80U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_ATT_ADAPT_SHIFT (7U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_ATT_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_ATT_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_ATT_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_ATT_ADAPT_MASK)

