zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CTLE_ADAPT_MASK (0x100U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CTLE_ADAPT_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CTLE_ADAPT_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CTLE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CTLE_ADAPT_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_FAST_RX_CTLE_ADAPT_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RESERVED_MASK (0x200U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RESERVED_SHIFT (9U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RESERVED_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RESERVED_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RESERVED_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_SKIP_250US_WAIT_MASK (0x400U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_SKIP_250US_WAIT_SHIFT (10U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_SKIP_250US_WAIT_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_SKIP_250US_WAIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_SKIP_250US_WAIT_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_SKIP_250US_WAIT_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_SKIP_IQ_STEP_SKIP_MASK (0x800U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_SKIP_IQ_STEP_SKIP_SHIFT (11U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_SKIP_IQ_STEP_SKIP_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_SKIP_IQ_STEP_SKIP(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_SKIP_IQ_STEP_SKIP_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_SKIP_IQ_STEP_SKIP_MASK)

#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RSVD_FAST_FLAGS_MASK (0xF000U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RSVD_FAST_FLAGS_SHIFT (12U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RSVD_FAST_FLAGS_WIDTH (4U)
#define X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RSVD_FAST_FLAGS(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RSVD_FAST_FLAGS_SHIFT)) & X2_RAWLANE0_DIG_AON_FAST_FLAGS_2_RSVD_FAST_FLAGS_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS - RTUNE Common Calibration Status */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_INIT_MASK (0x1U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_INIT_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_INIT_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_INIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_INIT_SHIFT)) & X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_INIT_MASK)

#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_DONE_MASK (0x2U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_DONE_SHIFT (1U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_DONE_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_DONE_SHIFT)) & X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_DONE_MASK)

#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_RESERVED_15_2_SHIFT)) & X2_RAWLANE0_DIG_AON_LANE_CMNCAL_RCAL_STATUS_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_TXRX_OVRD_IN - Override values for incoming AON TX/RX controls from PCS */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_VAL_MASK (0x1U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_EN_MASK (0x2U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_EN_SHIFT (1U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_VAL_MASK (0x4U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_VAL_SHIFT (2U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_EN_MASK (0x8U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_EN_SHIFT (3U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RESERVED_15_4_SHIFT)) & X2_RAWLANE0_DIG_AON_TXRX_OVRD_IN_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST - Offset value for RX AFE ATT_2 iDAC */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST_AFE_ATT_2_IDAC_OFST_MASK (0xFFU)
#define X2_RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST_AFE_ATT_2_IDAC_OFST_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST_AFE_ATT_2_IDAC_OFST_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST_AFE_ATT_2_IDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST_AFE_ATT_2_IDAC_OFST_SHIFT)) & X2_RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST_AFE_ATT_2_IDAC_OFST_MASK)

