zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANE0_DIG_AON_AFE_ATT_2_IDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN - Override incoming values for rxtx_cc */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_VAL_MASK (0x1U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_EN_MASK (0x2U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_EN_SHIFT (1U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RESERVED_15_2_SHIFT)) & X2_RAWLANE0_DIG_AON_RXTX_CC_OVRD_IN_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN - Incoming value of CC status from TCA */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN_rxtx_cc_in_i_MASK (0x1U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN_rxtx_cc_in_i_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN_rxtx_cc_in_i_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN_rxtx_cc_in_i(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN_rxtx_cc_in_i_SHIFT)) & X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN_rxtx_cc_in_i_MASK)

#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_IN_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT - Current values for outgoing CC status to PMA */
/*! @{ */

#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT_rxtx_cc_out_MASK (0x1U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT_rxtx_cc_out_SHIFT (0U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT_rxtx_cc_out_WIDTH (1U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT_rxtx_cc_out(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT_rxtx_cc_out_SHIFT)) & X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT_rxtx_cc_out_MASK)

#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_AON_RXTX_CC_STATUS_OUT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ - Reset routine request */
/*! @{ */

#define X2_RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ_RESET_RTN_REQ_MASK (0x1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ_RESET_RTN_REQ_SHIFT (0U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ_RESET_RTN_REQ_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ_RESET_RTN_REQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ_RESET_RTN_REQ_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ_RESET_RTN_REQ_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RESET_RTN_REQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ - Rx reset interrupt */
/*! @{ */

#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ_RX_RESET_MASK (0x1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ_RX_RESET_SHIFT (0U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ_RX_RESET_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ_RX_RESET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ_RX_RESET_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ_RX_RESET_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RX_RESET_IRQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ - Rx request interrupt */
/*! @{ */

#define X2_RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ_RX_REQ_MASK (0x1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ_RX_REQ_SHIFT (0U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ_RX_REQ_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ_RX_REQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ_RX_REQ_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ_RX_REQ_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RX_REQ_IRQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ - Rx rate change interrupt request */
/*! @{ */

#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ_RX_RATE_IRQ_MASK (0x1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ_RX_RATE_IRQ_SHIFT (0U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ_RX_RATE_IRQ_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ_RX_RATE_IRQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ_RX_RATE_IRQ_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ_RX_RATE_IRQ_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RX_RATE_IRQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ - Rx pstate change interrupt request */
/*! @{ */

#define X2_RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ_RX_PSTATE_IRQ_MASK (0x1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ_RX_PSTATE_IRQ_SHIFT (0U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ_RX_PSTATE_IRQ_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ_RX_PSTATE_IRQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ_RX_PSTATE_IRQ_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ_RX_PSTATE_IRQ_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RX_PSTATE_IRQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ - Rx adaptation request interrupt */
/*! @{ */

#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RX_ADAPT_REQ_IRQ_MASK (0x1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RX_ADAPT_REQ_IRQ_SHIFT (0U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RX_ADAPT_REQ_IRQ_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RX_ADAPT_REQ_IRQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RX_ADAPT_REQ_IRQ_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RX_ADAPT_REQ_IRQ_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ - Rx adaptation disable interrupt */
/*! @{ */

#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RX_ADAPT_DIS_IRQ_MASK (0x1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RX_ADAPT_DIS_IRQ_SHIFT (0U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RX_ADAPT_DIS_IRQ_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RX_ADAPT_DIS_IRQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RX_ADAPT_DIS_IRQ_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RX_ADAPT_DIS_IRQ_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RESERVED_15_1_MASK)
/*! @} */

