zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name RAWLANE0_DIG_IRQ_CTL_IRQ_MASK - Interrupt Mask */
/*! @{ */

#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_REQ_IRQ_MSK_MASK (0x1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_REQ_IRQ_MSK_SHIFT (0U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_REQ_IRQ_MSK_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_REQ_IRQ_MSK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_REQ_IRQ_MSK_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_REQ_IRQ_MSK_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_RATE_IRQ_MSK_MASK (0x2U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_RATE_IRQ_MSK_SHIFT (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_RATE_IRQ_MSK_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_RATE_IRQ_MSK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_RATE_IRQ_MSK_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_RATE_IRQ_MSK_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_PSTATE_IRQ_MSK_MASK (0x4U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_PSTATE_IRQ_MSK_SHIFT (2U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_PSTATE_IRQ_MSK_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_PSTATE_IRQ_MSK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_PSTATE_IRQ_MSK_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_PSTATE_IRQ_MSK_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_REQ_IRQ_MSK_MASK (0x8U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_REQ_IRQ_MSK_SHIFT (3U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_REQ_IRQ_MSK_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_REQ_IRQ_MSK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_REQ_IRQ_MSK_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_REQ_IRQ_MSK_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_DIS_IRQ_MSK_MASK (0x10U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_DIS_IRQ_MSK_SHIFT (4U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_DIS_IRQ_MSK_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_DIS_IRQ_MSK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_DIS_IRQ_MSK_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_DIS_IRQ_MSK_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_RESET_IRQ_MSK_MASK (0x20U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_RESET_IRQ_MSK_SHIFT (5U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_RESET_IRQ_MSK_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_RESET_IRQ_MSK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_RESET_IRQ_MSK_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RX_RESET_IRQ_MSK_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_LANE_XCVR_MODE_IRQ_MSK_MASK (0x40U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_LANE_XCVR_MODE_IRQ_MSK_SHIFT (6U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_LANE_XCVR_MODE_IRQ_MSK_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_LANE_XCVR_MODE_IRQ_MSK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_LANE_XCVR_MODE_IRQ_MSK_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_LANE_XCVR_MODE_IRQ_MSK_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RESERVED_15_7_MASK (0xFF80U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RESERVED_15_7_SHIFT (7U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RESERVED_15_7_WIDTH (9U)
#define X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RESERVED_15_7(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RESERVED_15_7_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_IRQ_MASK_RESERVED_15_7_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ - Lane transceiver mode interrupt */
/*! @{ */

#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_LANE_XCVR_MODE_IRQ_MASK (0x1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_LANE_XCVR_MODE_IRQ_SHIFT (0U)
#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_LANE_XCVR_MODE_IRQ_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_LANE_XCVR_MODE_IRQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_LANE_XCVR_MODE_IRQ_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_LANE_XCVR_MODE_IRQ_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR - Lane transceiver mode interrupt clear */
/*! @{ */

#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR_LANE_XCVR_MODE_IRQ_CLR_MASK (0x1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR_LANE_XCVR_MODE_IRQ_CLR_SHIFT (0U)
#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR_LANE_XCVR_MODE_IRQ_CLR_WIDTH (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR_LANE_XCVR_MODE_IRQ_CLR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR_LANE_XCVR_MODE_IRQ_CLR_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR_LANE_XCVR_MODE_IRQ_CLR_MASK)

#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_IRQ_CTL_LANE_XCVR_MODE_IRQ_CLR_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN - Override values for incoming LANE controls */
/*! @{ */

#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_MPLLA_EN_IN_MASK (0x1U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_MPLLA_EN_IN_SHIFT (0U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_MPLLA_EN_IN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_MPLLA_EN_IN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_MPLLA_EN_IN_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_MPLLA_EN_IN_MASK)

#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_MPLLB_EN_IN_MASK (0x2U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_MPLLB_EN_IN_SHIFT (1U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_MPLLB_EN_IN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_MPLLB_EN_IN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_MPLLB_EN_IN_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_MPLLB_EN_IN_MASK)

#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_OVRD_EN_MASK (0x4U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_OVRD_EN_SHIFT (2U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_LANE_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_RESERVED_15_3_MASK (0xFFF8U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_RESERVED_15_3_SHIFT (3U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_RESERVED_15_3_WIDTH (13U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_RESERVED_15_3(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_RESERVED_15_3_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_IN_RESERVED_15_3_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PMA_XF_LANE_OVRD_OUT - Override values for outgoing LANE controls */
/*! @{ */

#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_OUT_LANE_MPLLA_EN_OUT_MASK (0x1U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_OUT_LANE_MPLLA_EN_OUT_SHIFT (0U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_OUT_LANE_MPLLA_EN_OUT_WIDTH (1U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_OUT_LANE_MPLLA_EN_OUT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_OUT_LANE_MPLLA_EN_OUT_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_LANE_OVRD_OUT_LANE_MPLLA_EN_OUT_MASK)

