zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_PMA_XF_TX_OVRD_OUT_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANE0_DIG_PMA_XF_TX_OVRD_OUT_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANE0_DIG_PMA_XF_TX_OVRD_OUT_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANE0_DIG_PMA_XF_TX_OVRD_OUT_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_TX_OVRD_OUT_RESERVED_15_4_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_TX_OVRD_OUT_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PMA_XF_TX_PMA_IN - Current values for coming TX status controls from PMA */
/*! @{ */

#define X2_RAWLANE0_DIG_PMA_XF_TX_PMA_IN_ACK_MASK (0x1U)
#define X2_RAWLANE0_DIG_PMA_XF_TX_PMA_IN_ACK_SHIFT (0U)
#define X2_RAWLANE0_DIG_PMA_XF_TX_PMA_IN_ACK_WIDTH (1U)
#define X2_RAWLANE0_DIG_PMA_XF_TX_PMA_IN_ACK(x)  (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_TX_PMA_IN_ACK_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_TX_PMA_IN_ACK_MASK)

#define X2_RAWLANE0_DIG_PMA_XF_TX_PMA_IN_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_PMA_XF_TX_PMA_IN_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_PMA_XF_TX_PMA_IN_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_PMA_XF_TX_PMA_IN_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_TX_PMA_IN_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_TX_PMA_IN_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT - Override values for outgoing RX controls to PMA */
/*! @{ */

#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_REQ_OVRD_VAL_MASK (0x1U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_REQ_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_REQ_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_REQ_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_REQ_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_REQ_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_REQ_OVRD_EN_MASK (0x2U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_REQ_OVRD_EN_SHIFT (1U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_REQ_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_REQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_REQ_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_REQ_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_RESET_OVRD_VAL_MASK (0x4U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_RESET_OVRD_VAL_SHIFT (2U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_RESET_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_RESET_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_RESET_OVRD_VAL_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_RESET_OVRD_VAL_MASK)

#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_RESET_OVRD_EN_MASK (0x8U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_RESET_OVRD_EN_SHIFT (3U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_RESET_OVRD_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_RESET_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_RESET_OVRD_EN_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RX_RESET_OVRD_EN_MASK)

#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RESERVED_15_4_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_RX_OVRD_OUT_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PMA_XF_RX_PMA_IN - Current values for coming RX status controls from PMA */
/*! @{ */

#define X2_RAWLANE0_DIG_PMA_XF_RX_PMA_IN_ACK_MASK (0x1U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_PMA_IN_ACK_SHIFT (0U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_PMA_IN_ACK_WIDTH (1U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_PMA_IN_ACK(x)  (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_RX_PMA_IN_ACK_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_RX_PMA_IN_ACK_MASK)

#define X2_RAWLANE0_DIG_PMA_XF_RX_PMA_IN_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_PMA_XF_RX_PMA_IN_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_PMA_IN_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_PMA_XF_RX_PMA_IN_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_RX_PMA_IN_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_RX_PMA_IN_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL - Lane Rtune Controls */
/*! @{ */

#define X2_RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL_LANE_RTUNE_REQ_MASK (0x1U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL_LANE_RTUNE_REQ_SHIFT (0U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL_LANE_RTUNE_REQ_WIDTH (1U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL_LANE_RTUNE_REQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL_LANE_RTUNE_REQ_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL_LANE_RTUNE_REQ_MASK)

#define X2_RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_LANE_RTUNE_CTL_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1 - Current values for incoming RTUNE status controls from PMA */
/*! @{ */

#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1_RTUNE_ACK_MASK (0x1U)
#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1_RTUNE_ACK_SHIFT (0U)
#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1_RTUNE_ACK_WIDTH (1U)
#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1_RTUNE_ACK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1_RTUNE_ACK_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1_RTUNE_ACK_MASK)

#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_IN_1_RESERVED_15_1_MASK)
/*! @} */

