zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID - Current value of RX valid from PMA */
/*! @{ */

#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID_RX_VALID_MASK (0x1U)
#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID_RX_VALID_SHIFT (0U)
#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID_RX_VALID_WIDTH (1U)
#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID_RX_VALID(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID_RX_VALID_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID_RX_VALID_MASK)

#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_PMA_XF_SUP_PMA_RX_VALID_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_TX_CTL_TX_FSM_CTL - TX FSM Control */
/*! @{ */

#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_WAIT_MPLL_OFF_TIME_MASK (0x3FU)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_WAIT_MPLL_OFF_TIME_SHIFT (0U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_WAIT_MPLL_OFF_TIME_WIDTH (6U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_WAIT_MPLL_OFF_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_WAIT_MPLL_OFF_TIME_SHIFT)) & X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_WAIT_MPLL_OFF_TIME_MASK)

#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P2_ALLOW_RXDET_MASK (0x40U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P2_ALLOW_RXDET_SHIFT (6U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P2_ALLOW_RXDET_WIDTH (1U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P2_ALLOW_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P2_ALLOW_RXDET_SHIFT)) & X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P2_ALLOW_RXDET_MASK)

#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P1_ALLOW_RXDET_MASK (0x80U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P1_ALLOW_RXDET_SHIFT (7U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P1_ALLOW_RXDET_WIDTH (1U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P1_ALLOW_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P1_ALLOW_RXDET_SHIFT)) & X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P1_ALLOW_RXDET_MASK)

#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P0S_ALLOW_RXDET_MASK (0x100U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P0S_ALLOW_RXDET_SHIFT (8U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P0S_ALLOW_RXDET_WIDTH (1U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P0S_ALLOW_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P0S_ALLOW_RXDET_SHIFT)) & X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P0S_ALLOW_RXDET_MASK)

#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P0_ALLOW_RXDET_MASK (0x200U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P0_ALLOW_RXDET_SHIFT (9U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P0_ALLOW_RXDET_WIDTH (1U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P0_ALLOW_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P0_ALLOW_RXDET_SHIFT)) & X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_TX_P0_ALLOW_RXDET_MASK)

#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_RESERVED_15_10_SHIFT (10U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_RESERVED_15_10_WIDTH (6U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_RESERVED_15_10_SHIFT)) & X2_RAWLANE0_DIG_TX_CTL_TX_FSM_CTL_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_TX_CTL_TX_CLK_CTL - Select clock to act as TX input clock */
/*! @{ */

#define X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_EN_MASK (0x1U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_EN_SHIFT (0U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_EN_WIDTH (1U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_EN_SHIFT)) & X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_EN_MASK)

#define X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_SEL_MASK (0x1EU)
#define X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_SEL_SHIFT (1U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_SEL_WIDTH (4U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_SEL_SHIFT)) & X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_SEL_MASK)

#define X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_RESERVED_15_5_MASK (0xFFE0U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_RESERVED_15_5_SHIFT (5U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_RESERVED_15_5_WIDTH (11U)
#define X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_RESERVED_15_5_SHIFT)) & X2_RAWLANE0_DIG_TX_CTL_TX_CLK_CTL_RESERVED_15_5_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_RX_CTL_RX_FSM_CTL - RX FSM control register */
/*! @{ */

#define X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_EN_RX_CTL_FSM_MASK (0x1U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_EN_RX_CTL_FSM_SHIFT (0U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_EN_RX_CTL_FSM_WIDTH (1U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_EN_RX_CTL_FSM(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_EN_RX_CTL_FSM_SHIFT)) & X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_EN_RX_CTL_FSM_MASK)

#define X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_RATE_CHG_IN_P1_MASK (0x2U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_RATE_CHG_IN_P1_SHIFT (1U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_RATE_CHG_IN_P1_WIDTH (1U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_RATE_CHG_IN_P1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_RATE_CHG_IN_P1_SHIFT)) & X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_RATE_CHG_IN_P1_MASK)

#define X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_RESERVED_15_2_SHIFT)) & X2_RAWLANE0_DIG_RX_CTL_RX_FSM_CTL_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL - RX LOS Mask Control */
/*! @{ */

#define X2_RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL_RX_LOS_MASK_CNT_MASK (0x1FFU)
#define X2_RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL_RX_LOS_MASK_CNT_SHIFT (0U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL_RX_LOS_MASK_CNT_WIDTH (9U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL_RX_LOS_MASK_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL_RX_LOS_MASK_CNT_SHIFT)) & X2_RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL_RX_LOS_MASK_CNT_MASK)

