zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL_RESERVED_15_9_MASK (0xFE00U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL_RESERVED_15_9_SHIFT (9U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL_RESERVED_15_9_WIDTH (7U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL_RESERVED_15_9_SHIFT)) & X2_RAWLANE0_DIG_RX_CTL_RX_LOS_MASK_CTL_RESERVED_15_9_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL - RX Data Enable Override Control */
/*! @{ */

#define X2_RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_RX_DATA_EN_OVRD_CNT_MASK (0x1FU)
#define X2_RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_RX_DATA_EN_OVRD_CNT_SHIFT (0U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_RX_DATA_EN_OVRD_CNT_WIDTH (5U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_RX_DATA_EN_OVRD_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_RX_DATA_EN_OVRD_CNT_SHIFT)) & X2_RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_RX_DATA_EN_OVRD_CNT_MASK)

#define X2_RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_INT_REF_TRCK_CNT_MASK (0xFFE0U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_INT_REF_TRCK_CNT_SHIFT (5U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_INT_REF_TRCK_CNT_WIDTH (11U)
#define X2_RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_INT_REF_TRCK_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_INT_REF_TRCK_CNT_SHIFT)) & X2_RAWLANE0_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_INT_REF_TRCK_CNT_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS - RX continuous offset cancellation status */
/*! @{ */

#define X2_RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS_ENABLE_MASK (0x1U)
#define X2_RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS_ENABLE_SHIFT (0U)
#define X2_RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS_ENABLE_WIDTH (1U)
#define X2_RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS_ENABLE_SHIFT)) & X2_RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS_ENABLE_MASK)

#define X2_RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_RX_CTL_OFFCAN_CONT_STATUS_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS - RX continuous adaptation status */
/*! @{ */

#define X2_RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS_ENABLE_MASK (0x1U)
#define X2_RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS_ENABLE_SHIFT (0U)
#define X2_RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS_ENABLE_WIDTH (1U)
#define X2_RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS_ENABLE_SHIFT)) & X2_RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS_ENABLE_MASK)

#define X2_RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS_RESERVED_15_1_SHIFT)) & X2_RAWLANE0_DIG_RX_CTL_ADAPT_CONT_STATUS_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWMEM_D_ROM_CMN_B_R - Common Memory #0, Bank #0, Reg #0..Common Memory #15, Bank #7, Reg #31 */
/*! @{ */

#define X2_RAWMEM_D_ROM_CMN_B_R_DAT_MASK         (0xFFFFU)
#define X2_RAWMEM_D_ROM_CMN_B_R_DAT_SHIFT        (0U)
#define X2_RAWMEM_D_ROM_CMN_B_R_DAT_WIDTH        (16U)
#define X2_RAWMEM_D_ROM_CMN_B_R_DAT(x)           (((uint16_t)(((uint16_t)(x)) << X2_RAWMEM_D_ROM_CMN_B_R_DAT_SHIFT)) & X2_RAWMEM_D_ROM_CMN_B_R_DAT_MASK)
/*! @} */

/*! @name RAWMEM_D_RAM_CMN_B_R - Common Memory #0, Bank #0, Reg #0..Common Memory #15, Bank #7, Reg #31 */
/*! @{ */

#define X2_RAWMEM_D_RAM_CMN_B_R_DAT_MASK         (0xFFFFU)
#define X2_RAWMEM_D_RAM_CMN_B_R_DAT_SHIFT        (0U)
#define X2_RAWMEM_D_RAM_CMN_B_R_DAT_WIDTH        (16U)
#define X2_RAWMEM_D_RAM_CMN_B_R_DAT(x)           (((uint16_t)(((uint16_t)(x)) << X2_RAWMEM_D_RAM_CMN_B_R_DAT_SHIFT)) & X2_RAWMEM_D_RAM_CMN_B_R_DAT_MASK)
/*! @} */

/*! @name SUPX_DIG_IDCODE_LO - Low 16 bits of IDCODE */
/*! @{ */

#define X2_SUPX_DIG_IDCODE_LO_data_MASK          (0xFFFFU)
#define X2_SUPX_DIG_IDCODE_LO_data_SHIFT         (0U)
#define X2_SUPX_DIG_IDCODE_LO_data_WIDTH         (16U)
#define X2_SUPX_DIG_IDCODE_LO_data(x)            (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_IDCODE_LO_data_SHIFT)) & X2_SUPX_DIG_IDCODE_LO_data_MASK)
/*! @} */

/*! @name SUPX_DIG_IDCODE_HI - High 16 bits of IDCODE */
/*! @{ */

#define X2_SUPX_DIG_IDCODE_HI_data_MASK          (0xFFFFU)
#define X2_SUPX_DIG_IDCODE_HI_data_SHIFT         (0U)
#define X2_SUPX_DIG_IDCODE_HI_data_WIDTH         (16U)
#define X2_SUPX_DIG_IDCODE_HI_data(x)            (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_IDCODE_HI_data_SHIFT)) & X2_SUPX_DIG_IDCODE_HI_data_MASK)
/*! @} */

/*! @name SUPX_DIG_REFCLK_OVRD_IN - Override values for incoming REFCLK and RESET controls from ASIC */
/*! @{ */

#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_EN_MASK (0x1U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_EN_SHIFT (0U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_EN_SHIFT)) & X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_EN_MASK)

#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_EN_OVRD_EN_MASK (0x2U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_EN_OVRD_EN_SHIFT (1U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_EN_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_EN_OVRD_EN_SHIFT)) & X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_EN_OVRD_EN_MASK)

#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_MASK (0x4U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_SHIFT (2U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_WIDTH (1U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_SHIFT)) & X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_MASK)

#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_OVRD_EN_MASK (0x8U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_OVRD_EN_SHIFT (3U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_OVRD_EN_SHIFT)) & X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_DIV2_EN_OVRD_EN_MASK)

