zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_USE_PAD_MASK (0x10U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_USE_PAD_SHIFT (4U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_USE_PAD_WIDTH (1U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_USE_PAD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_REFCLK_OVRD_IN_REF_USE_PAD_SHIFT)) & X2_SUPX_DIG_REFCLK_OVRD_IN_REF_USE_PAD_MASK)

#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_USE_PAD_OVRD_EN_MASK (0x20U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_USE_PAD_OVRD_EN_SHIFT (5U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_USE_PAD_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_USE_PAD_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_REFCLK_OVRD_IN_REF_USE_PAD_OVRD_EN_SHIFT)) & X2_SUPX_DIG_REFCLK_OVRD_IN_REF_USE_PAD_OVRD_EN_MASK)

#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_MASK (0x40U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_SHIFT (6U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_SHIFT)) & X2_SUPX_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_MASK)

#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_OVRD_EN_MASK (0x80U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_OVRD_EN_SHIFT (7U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_OVRD_EN_SHIFT)) & X2_SUPX_DIG_REFCLK_OVRD_IN_REF_REPEAT_CLK_EN_OVRD_EN_MASK)

#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_MASK (0x700U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_SHIFT (8U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_WIDTH (3U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_SHIFT)) & X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_MASK)

#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_OVRD_EN_MASK (0x800U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_OVRD_EN_SHIFT (11U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_OVRD_EN_SHIFT)) & X2_SUPX_DIG_REFCLK_OVRD_IN_REF_CLK_RANGE_OVRD_EN_MASK)

#define X2_SUPX_DIG_REFCLK_OVRD_IN_BG_EN_MASK    (0x1000U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_BG_EN_SHIFT   (12U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_BG_EN_WIDTH   (1U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_BG_EN(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_REFCLK_OVRD_IN_BG_EN_SHIFT)) & X2_SUPX_DIG_REFCLK_OVRD_IN_BG_EN_MASK)

#define X2_SUPX_DIG_REFCLK_OVRD_IN_BG_EN_OVRD_EN_MASK (0x2000U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_BG_EN_OVRD_EN_SHIFT (13U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_BG_EN_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_BG_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_REFCLK_OVRD_IN_BG_EN_OVRD_EN_SHIFT)) & X2_SUPX_DIG_REFCLK_OVRD_IN_BG_EN_OVRD_EN_MASK)

#define X2_SUPX_DIG_REFCLK_OVRD_IN_RESERVED_15_14_MASK (0xC000U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_RESERVED_15_14_SHIFT (14U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_RESERVED_15_14_WIDTH (2U)
#define X2_SUPX_DIG_REFCLK_OVRD_IN_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_REFCLK_OVRD_IN_RESERVED_15_14_SHIFT)) & X2_SUPX_DIG_REFCLK_OVRD_IN_RESERVED_15_14_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN - Override values for incoming MPLLA_DIV_CLK controls from ASIC */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_CLK_EN_MASK (0x1U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_CLK_EN_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_CLK_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_CLK_EN_MASK)

#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_MULTIPLIER_MASK (0x1FEU)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_MULTIPLIER_SHIFT (1U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_MULTIPLIER_WIDTH (8U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_MULTIPLIER(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_MULTIPLIER_SHIFT)) & X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_MULTIPLIER_MASK)

#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_OVRD_EN_MASK (0x200U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_OVRD_EN_SHIFT (9U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_OVRD_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_MPLLA_DIV_OVRD_EN_MASK)

#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_RESERVED_15_10_SHIFT (10U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_RESERVED_15_10_WIDTH (6U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_RESERVED_15_10_SHIFT)) & X2_SUPX_DIG_MPLLA_DIV_CLK_OVRD_IN_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN - Override values for incoming MPLLB_DIV_CLK controls from ASIC */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_CLK_EN_MASK (0x1U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_CLK_EN_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_CLK_EN_SHIFT)) & X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_CLK_EN_MASK)

#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_MULTIPLIER_MASK (0x1FEU)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_MULTIPLIER_SHIFT (1U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_MULTIPLIER_WIDTH (8U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_MULTIPLIER(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_MULTIPLIER_SHIFT)) & X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_MULTIPLIER_MASK)

