zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_OVRD_EN_MASK (0x200U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_OVRD_EN_SHIFT (9U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_OVRD_EN_SHIFT)) & X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_MPLLB_DIV_OVRD_EN_MASK)

#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_RESERVED_15_10_SHIFT (10U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_RESERVED_15_10_WIDTH (6U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_RESERVED_15_10_SHIFT)) & X2_SUPX_DIG_MPLLB_DIV_CLK_OVRD_IN_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_OVRD_IN_0 - Override values for incoming MPLLA controls from ASIC */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_EN_MASK (0x1U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_EN_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_EN(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_EN_MASK)

#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_REF_CLK_MPLLA_DIV2_EN_MASK (0x2U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_REF_CLK_MPLLA_DIV2_EN_SHIFT (1U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_REF_CLK_MPLLA_DIV2_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_REF_CLK_MPLLA_DIV2_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_OVRD_IN_0_REF_CLK_MPLLA_DIV2_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_OVRD_IN_0_REF_CLK_MPLLA_DIV2_EN_MASK)

#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV8_CLK_EN_MASK (0x4U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV8_CLK_EN_SHIFT (2U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV8_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV8_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV8_CLK_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV8_CLK_EN_MASK)

#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV10_CLK_EN_MASK (0x8U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV10_CLK_EN_SHIFT (3U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV10_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV10_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV10_CLK_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_DIV10_CLK_EN_MASK)

#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_MULTIPLIER_MASK (0xFF0U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_MULTIPLIER_SHIFT (4U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_MULTIPLIER_WIDTH (8U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_MULTIPLIER(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_MULTIPLIER_SHIFT)) & X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_MULTIPLIER_MASK)

#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_TX_CLK_DIV_MASK (0x7000U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_TX_CLK_DIV_SHIFT (12U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_TX_CLK_DIV_WIDTH (3U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_TX_CLK_DIV(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_TX_CLK_DIV_SHIFT)) & X2_SUPX_DIG_MPLLA_OVRD_IN_0_MPLLA_TX_CLK_DIV_MASK)

#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_OVRD_EN_MASK (0x8000U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_OVRD_EN_SHIFT (15U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_0_OVRD_EN(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_OVRD_IN_0_OVRD_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_OVRD_IN_0_OVRD_EN_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_OVRD_IN_1 - Override values for incoming MPLLA controls from ASIC */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_EN_MASK (0x1U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_EN_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_EN_MASK)

#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_RANGE_MASK (0xEU)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_RANGE_SHIFT (1U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_RANGE_WIDTH (3U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_RANGE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_RANGE_SHIFT)) & X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_RANGE_MASK)

#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_CLK_SEL_MASK (0x70U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_CLK_SEL_SHIFT (4U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_CLK_SEL_WIDTH (3U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_CLK_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_CLK_SEL_SHIFT)) & X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_CLK_SEL_MASK)

#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_OVRD_EN_MASK (0x80U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_OVRD_EN_SHIFT (7U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_OVRD_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_SSC_OVRD_EN_MASK)

#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_WORD_DIV2_EN_MASK (0x100U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_WORD_DIV2_EN_SHIFT (8U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_WORD_DIV2_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_WORD_DIV2_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_WORD_DIV2_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_OVRD_IN_1_MPLLA_WORD_DIV2_EN_MASK)

#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_RESERVED_15_9_MASK (0xFE00U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_RESERVED_15_9_SHIFT (9U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_RESERVED_15_9_WIDTH (7U)
#define X2_SUPX_DIG_MPLLA_OVRD_IN_1_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_OVRD_IN_1_RESERVED_15_9_SHIFT)) & X2_SUPX_DIG_MPLLA_OVRD_IN_1_RESERVED_15_9_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_OVRD_IN_2 - Override values for incoming MPLLA controls from ASIC */
/*! @{ */

