zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_MPLLB_BANDWIDTH_OVRD_IN_MPLLB_BANDWIDTH_MASK (0xFFFFU)
#define X2_SUPX_DIG_MPLLB_BANDWIDTH_OVRD_IN_MPLLB_BANDWIDTH_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_BANDWIDTH_OVRD_IN_MPLLB_BANDWIDTH_WIDTH (16U)
#define X2_SUPX_DIG_MPLLB_BANDWIDTH_OVRD_IN_MPLLB_BANDWIDTH(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_BANDWIDTH_OVRD_IN_MPLLB_BANDWIDTH_SHIFT)) & X2_SUPX_DIG_MPLLB_BANDWIDTH_OVRD_IN_MPLLB_BANDWIDTH_MASK)
/*! @} */

/*! @name SUPX_DIG_SUP_OVRD_IN - Override values for support block ASIC inputs */
/*! @{ */

#define X2_SUPX_DIG_SUP_OVRD_IN_RTUNE_REQ_MASK   (0x1U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RTUNE_REQ_SHIFT  (0U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RTUNE_REQ_WIDTH  (1U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RTUNE_REQ(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_IN_RTUNE_REQ_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_IN_RTUNE_REQ_MASK)

#define X2_SUPX_DIG_SUP_OVRD_IN_RTUNE_OVRD_EN_MASK (0x2U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RTUNE_OVRD_EN_SHIFT (1U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RTUNE_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RTUNE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_IN_RTUNE_OVRD_EN_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_IN_RTUNE_OVRD_EN_MASK)

#define X2_SUPX_DIG_SUP_OVRD_IN_RES_REQ_IN_MASK  (0x4U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RES_REQ_IN_SHIFT (2U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RES_REQ_IN_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RES_REQ_IN(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_IN_RES_REQ_IN_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_IN_RES_REQ_IN_MASK)

#define X2_SUPX_DIG_SUP_OVRD_IN_RES_ACK_IN_MASK  (0x8U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RES_ACK_IN_SHIFT (3U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RES_ACK_IN_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RES_ACK_IN(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_IN_RES_ACK_IN_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_IN_RES_ACK_IN_MASK)

#define X2_SUPX_DIG_SUP_OVRD_IN_RES_OVRD_EN_MASK (0x10U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RES_OVRD_EN_SHIFT (4U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RES_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RES_OVRD_EN(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_IN_RES_OVRD_EN_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_IN_RES_OVRD_EN_MASK)

#define X2_SUPX_DIG_SUP_OVRD_IN_RESERVED_15_5_MASK (0xFFE0U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RESERVED_15_5_SHIFT (5U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RESERVED_15_5_WIDTH (11U)
#define X2_SUPX_DIG_SUP_OVRD_IN_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_IN_RESERVED_15_5_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_IN_RESERVED_15_5_MASK)
/*! @} */

/*! @name SUPX_DIG_SUP_OVRD_OUT - Override values for support block ASIC outputs */
/*! @{ */

#define X2_SUPX_DIG_SUP_OVRD_OUT_RTUNE_ACK_MASK  (0x1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RTUNE_ACK_SHIFT (0U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RTUNE_ACK_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RTUNE_ACK(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_RTUNE_ACK_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_RTUNE_ACK_MASK)

#define X2_SUPX_DIG_SUP_OVRD_OUT_RTUNE_ACK_OVRD_EN_MASK (0x2U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RTUNE_ACK_OVRD_EN_SHIFT (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RTUNE_ACK_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RTUNE_ACK_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_RTUNE_ACK_OVRD_EN_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_RTUNE_ACK_OVRD_EN_MASK)

#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_REQ_OUT_MASK (0x4U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_REQ_OUT_SHIFT (2U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_REQ_OUT_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_REQ_OUT(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_RES_REQ_OUT_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_RES_REQ_OUT_MASK)

#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_REQ_OUT_OVRD_EN_MASK (0x8U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_REQ_OUT_OVRD_EN_SHIFT (3U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_REQ_OUT_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_REQ_OUT_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_RES_REQ_OUT_OVRD_EN_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_RES_REQ_OUT_OVRD_EN_MASK)

#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_ACK_OUT_MASK (0x10U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_ACK_OUT_SHIFT (4U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_ACK_OUT_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_ACK_OUT(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_RES_ACK_OUT_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_RES_ACK_OUT_MASK)

#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_ACK_OUT_OVRD_EN_MASK (0x20U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_ACK_OUT_OVRD_EN_SHIFT (5U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_ACK_OUT_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RES_ACK_OUT_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_RES_ACK_OUT_OVRD_EN_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_RES_ACK_OUT_OVRD_EN_MASK)

#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLA_STATE_MASK (0x40U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLA_STATE_SHIFT (6U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLA_STATE_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLA_STATE(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_MPLLA_STATE_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_MPLLA_STATE_MASK)

#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLA_STATE_OVRD_EN_MASK (0x80U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLA_STATE_OVRD_EN_SHIFT (7U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLA_STATE_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLA_STATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_MPLLA_STATE_OVRD_EN_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_MPLLA_STATE_OVRD_EN_MASK)

#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLB_STATE_MASK (0x100U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLB_STATE_SHIFT (8U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLB_STATE_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLB_STATE(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_MPLLB_STATE_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_MPLLB_STATE_MASK)

#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLB_STATE_OVRD_EN_MASK (0x200U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLB_STATE_OVRD_EN_SHIFT (9U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLB_STATE_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_MPLLB_STATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_MPLLB_STATE_OVRD_EN_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_MPLLB_STATE_OVRD_EN_MASK)

#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_LANE_STATE_MASK (0x400U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_LANE_STATE_SHIFT (10U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_LANE_STATE_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_LANE_STATE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_BG_LANE_STATE_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_BG_LANE_STATE_MASK)

#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_LANE_STATE_OVRD_EN_MASK (0x800U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_LANE_STATE_OVRD_EN_SHIFT (11U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_LANE_STATE_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_LANE_STATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_BG_LANE_STATE_OVRD_EN_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_BG_LANE_STATE_OVRD_EN_MASK)

