zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_SUP_STATE_MASK (0x1000U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_SUP_STATE_SHIFT (12U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_SUP_STATE_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_SUP_STATE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_BG_SUP_STATE_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_BG_SUP_STATE_MASK)

#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_SUP_STATE_OVRD_EN_MASK (0x2000U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_SUP_STATE_OVRD_EN_SHIFT (13U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_SUP_STATE_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_BG_SUP_STATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_BG_SUP_STATE_OVRD_EN_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_BG_SUP_STATE_OVRD_EN_MASK)

#define X2_SUPX_DIG_SUP_OVRD_OUT_RESERVED_15_14_MASK (0xC000U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RESERVED_15_14_SHIFT (14U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RESERVED_15_14_WIDTH (2U)
#define X2_SUPX_DIG_SUP_OVRD_OUT_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_SUP_OVRD_OUT_RESERVED_15_14_SHIFT)) & X2_SUPX_DIG_SUP_OVRD_OUT_RESERVED_15_14_MASK)
/*! @} */

/*! @name SUPX_DIG_LVL_OVRD_IN - Override values for level settings */
/*! @{ */

#define X2_SUPX_DIG_LVL_OVRD_IN_RX_VREF_CTRL_MASK (0x1FU)
#define X2_SUPX_DIG_LVL_OVRD_IN_RX_VREF_CTRL_SHIFT (0U)
#define X2_SUPX_DIG_LVL_OVRD_IN_RX_VREF_CTRL_WIDTH (5U)
#define X2_SUPX_DIG_LVL_OVRD_IN_RX_VREF_CTRL(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_LVL_OVRD_IN_RX_VREF_CTRL_SHIFT)) & X2_SUPX_DIG_LVL_OVRD_IN_RX_VREF_CTRL_MASK)

#define X2_SUPX_DIG_LVL_OVRD_IN_RX_VREF_CTRL_EN_MASK (0x20U)
#define X2_SUPX_DIG_LVL_OVRD_IN_RX_VREF_CTRL_EN_SHIFT (5U)
#define X2_SUPX_DIG_LVL_OVRD_IN_RX_VREF_CTRL_EN_WIDTH (1U)
#define X2_SUPX_DIG_LVL_OVRD_IN_RX_VREF_CTRL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_LVL_OVRD_IN_RX_VREF_CTRL_EN_SHIFT)) & X2_SUPX_DIG_LVL_OVRD_IN_RX_VREF_CTRL_EN_MASK)

#define X2_SUPX_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_MASK (0x1C0U)
#define X2_SUPX_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_SHIFT (6U)
#define X2_SUPX_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_WIDTH (3U)
#define X2_SUPX_DIG_LVL_OVRD_IN_TX_VBOOST_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_SHIFT)) & X2_SUPX_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_MASK)

#define X2_SUPX_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_EN_MASK (0x200U)
#define X2_SUPX_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_EN_SHIFT (9U)
#define X2_SUPX_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_EN_WIDTH (1U)
#define X2_SUPX_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_EN_SHIFT)) & X2_SUPX_DIG_LVL_OVRD_IN_TX_VBOOST_LVL_EN_MASK)

#define X2_SUPX_DIG_LVL_OVRD_IN_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUPX_DIG_LVL_OVRD_IN_RESERVED_15_10_SHIFT (10U)
#define X2_SUPX_DIG_LVL_OVRD_IN_RESERVED_15_10_WIDTH (6U)
#define X2_SUPX_DIG_LVL_OVRD_IN_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_LVL_OVRD_IN_RESERVED_15_10_SHIFT)) & X2_SUPX_DIG_LVL_OVRD_IN_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUPX_DIG_DEBUG - Debug controls */
/*! @{ */

#define X2_SUPX_DIG_DEBUG_DTB_SEL_MASK           (0x7U)
#define X2_SUPX_DIG_DEBUG_DTB_SEL_SHIFT          (0U)
#define X2_SUPX_DIG_DEBUG_DTB_SEL_WIDTH          (3U)
#define X2_SUPX_DIG_DEBUG_DTB_SEL(x)             (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_DEBUG_DTB_SEL_SHIFT)) & X2_SUPX_DIG_DEBUG_DTB_SEL_MASK)

#define X2_SUPX_DIG_DEBUG_RESERVED_15_3_MASK     (0xFFF8U)
#define X2_SUPX_DIG_DEBUG_RESERVED_15_3_SHIFT    (3U)
#define X2_SUPX_DIG_DEBUG_RESERVED_15_3_WIDTH    (13U)
#define X2_SUPX_DIG_DEBUG_RESERVED_15_3(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_DEBUG_RESERVED_15_3_SHIFT)) & X2_SUPX_DIG_DEBUG_RESERVED_15_3_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_ASIC_IN_0 - Current values for incoming MPLLA controls from ASIC */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_EN_MASK (0x1U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_EN_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_EN(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_EN_MASK)

#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_REF_CLK_MPLLA_DIV2_EN_MASK (0x2U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_REF_CLK_MPLLA_DIV2_EN_SHIFT (1U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_REF_CLK_MPLLA_DIV2_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_REF_CLK_MPLLA_DIV2_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_ASIC_IN_0_REF_CLK_MPLLA_DIV2_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_ASIC_IN_0_REF_CLK_MPLLA_DIV2_EN_MASK)

#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV8_CLK_EN_MASK (0x4U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV8_CLK_EN_SHIFT (2U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV8_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV8_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV8_CLK_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV8_CLK_EN_MASK)

#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV10_CLK_EN_MASK (0x8U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV10_CLK_EN_SHIFT (3U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV10_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV10_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV10_CLK_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_DIV10_CLK_EN_MASK)

#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_MULTIPLIER_MASK (0xFF0U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_MULTIPLIER_SHIFT (4U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_MULTIPLIER_WIDTH (8U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_MULTIPLIER(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_MULTIPLIER_SHIFT)) & X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_MULTIPLIER_MASK)

#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_TX_CLK_DIV_MASK (0x7000U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_TX_CLK_DIV_SHIFT (12U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_TX_CLK_DIV_WIDTH (3U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_TX_CLK_DIV(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_TX_CLK_DIV_SHIFT)) & X2_SUPX_DIG_MPLLA_ASIC_IN_0_MPLLA_TX_CLK_DIV_MASK)

#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_RESERVED_15_15_MASK (0x8000U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_RESERVED_15_15_SHIFT (15U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_RESERVED_15_15_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_0_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_ASIC_IN_0_RESERVED_15_15_SHIFT)) & X2_SUPX_DIG_MPLLA_ASIC_IN_0_RESERVED_15_15_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_ASIC_IN_1 - Current values for incoming MPLLA controls from ASIC */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_EN_MASK (0x1U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_EN_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_ASIC_IN_1_MPLLA_SSC_EN_MASK)

