zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_MPLLB_ASIC_IN_1_MPLLB_SSC_CLK_SEL_MASK (0x70U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_1_MPLLB_SSC_CLK_SEL_SHIFT (4U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_1_MPLLB_SSC_CLK_SEL_WIDTH (3U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_1_MPLLB_SSC_CLK_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_ASIC_IN_1_MPLLB_SSC_CLK_SEL_SHIFT)) & X2_SUPX_DIG_MPLLB_ASIC_IN_1_MPLLB_SSC_CLK_SEL_MASK)

#define X2_SUPX_DIG_MPLLB_ASIC_IN_1_MPLLB_WORD_DIV2_EN_MASK (0x80U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_1_MPLLB_WORD_DIV2_EN_SHIFT (7U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_1_MPLLB_WORD_DIV2_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_1_MPLLB_WORD_DIV2_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_ASIC_IN_1_MPLLB_WORD_DIV2_EN_SHIFT)) & X2_SUPX_DIG_MPLLB_ASIC_IN_1_MPLLB_WORD_DIV2_EN_MASK)

#define X2_SUPX_DIG_MPLLB_ASIC_IN_1_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_1_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_1_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_1_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_ASIC_IN_1_RESERVED_15_8_SHIFT)) & X2_SUPX_DIG_MPLLB_ASIC_IN_1_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLB_ASIC_IN_2 - Current values for incoming MPLLB controls from ASIC */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_ASIC_IN_2_MPLLB_FRACN_CTRL_MASK (0x7FFU)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_2_MPLLB_FRACN_CTRL_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_2_MPLLB_FRACN_CTRL_WIDTH (11U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_2_MPLLB_FRACN_CTRL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_ASIC_IN_2_MPLLB_FRACN_CTRL_SHIFT)) & X2_SUPX_DIG_MPLLB_ASIC_IN_2_MPLLB_FRACN_CTRL_MASK)

#define X2_SUPX_DIG_MPLLB_ASIC_IN_2_RESERVED_15_11_MASK (0xF800U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_2_RESERVED_15_11_SHIFT (11U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_2_RESERVED_15_11_WIDTH (5U)
#define X2_SUPX_DIG_MPLLB_ASIC_IN_2_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_ASIC_IN_2_RESERVED_15_11_SHIFT)) & X2_SUPX_DIG_MPLLB_ASIC_IN_2_RESERVED_15_11_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN - Current values for incoming MPLLA_DIV_CLK controls from ASIC */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_CLK_EN_MASK (0x1U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_CLK_EN_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_CLK_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_CLK_EN_MASK)

#define X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_MULTIPLIER_MASK (0x1FEU)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_MULTIPLIER_SHIFT (1U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_MULTIPLIER_WIDTH (8U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_MULTIPLIER(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_MULTIPLIER_SHIFT)) & X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_MPLLA_DIV_MULTIPLIER_MASK)

#define X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_RESERVED_15_9_MASK (0xFE00U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_RESERVED_15_9_SHIFT (9U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_RESERVED_15_9_WIDTH (7U)
#define X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_RESERVED_15_9_SHIFT)) & X2_SUPX_DIG_MPLLA_DIV_CLK_ASIC_IN_RESERVED_15_9_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN - Current values for incoming MPLLB_DIV_CLK controls from ASIC */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_MPLLB_DIV_CLK_EN_MASK (0x1U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_MPLLB_DIV_CLK_EN_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_MPLLB_DIV_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_MPLLB_DIV_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_MPLLB_DIV_CLK_EN_SHIFT)) & X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_MPLLB_DIV_CLK_EN_MASK)

#define X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_MPLLB_DIV_MULTIPLIER_MASK (0x1FEU)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_MPLLB_DIV_MULTIPLIER_SHIFT (1U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_MPLLB_DIV_MULTIPLIER_WIDTH (8U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_MPLLB_DIV_MULTIPLIER(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_MPLLB_DIV_MULTIPLIER_SHIFT)) & X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_MPLLB_DIV_MULTIPLIER_MASK)

#define X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_RESERVED_15_9_MASK (0xFE00U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_RESERVED_15_9_SHIFT (9U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_RESERVED_15_9_WIDTH (7U)
#define X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_RESERVED_15_9_SHIFT)) & X2_SUPX_DIG_MPLLB_DIV_CLK_ASIC_IN_RESERVED_15_9_MASK)
/*! @} */

/*! @name SUPX_DIG_ASIC_IN - Current values for incoming SUP control signals from ASIC */
/*! @{ */

#define X2_SUPX_DIG_ASIC_IN_PHY_RESET_MASK       (0x1U)
#define X2_SUPX_DIG_ASIC_IN_PHY_RESET_SHIFT      (0U)
#define X2_SUPX_DIG_ASIC_IN_PHY_RESET_WIDTH      (1U)
#define X2_SUPX_DIG_ASIC_IN_PHY_RESET(x)         (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_PHY_RESET_SHIFT)) & X2_SUPX_DIG_ASIC_IN_PHY_RESET_MASK)

#define X2_SUPX_DIG_ASIC_IN_REF_CLK_EN_MASK      (0x2U)
#define X2_SUPX_DIG_ASIC_IN_REF_CLK_EN_SHIFT     (1U)
#define X2_SUPX_DIG_ASIC_IN_REF_CLK_EN_WIDTH     (1U)
#define X2_SUPX_DIG_ASIC_IN_REF_CLK_EN(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_REF_CLK_EN_SHIFT)) & X2_SUPX_DIG_ASIC_IN_REF_CLK_EN_MASK)

#define X2_SUPX_DIG_ASIC_IN_REF_CLK_DIV2_EN_MASK (0x4U)
#define X2_SUPX_DIG_ASIC_IN_REF_CLK_DIV2_EN_SHIFT (2U)
#define X2_SUPX_DIG_ASIC_IN_REF_CLK_DIV2_EN_WIDTH (1U)
#define X2_SUPX_DIG_ASIC_IN_REF_CLK_DIV2_EN(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_REF_CLK_DIV2_EN_SHIFT)) & X2_SUPX_DIG_ASIC_IN_REF_CLK_DIV2_EN_MASK)

#define X2_SUPX_DIG_ASIC_IN_REF_REPEAT_CLK_EN_MASK (0x8U)
#define X2_SUPX_DIG_ASIC_IN_REF_REPEAT_CLK_EN_SHIFT (3U)
#define X2_SUPX_DIG_ASIC_IN_REF_REPEAT_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_ASIC_IN_REF_REPEAT_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_REF_REPEAT_CLK_EN_SHIFT)) & X2_SUPX_DIG_ASIC_IN_REF_REPEAT_CLK_EN_MASK)

