zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_ASIC_IN_REF_USE_PAD_MASK     (0x10U)
#define X2_SUPX_DIG_ASIC_IN_REF_USE_PAD_SHIFT    (4U)
#define X2_SUPX_DIG_ASIC_IN_REF_USE_PAD_WIDTH    (1U)
#define X2_SUPX_DIG_ASIC_IN_REF_USE_PAD(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_REF_USE_PAD_SHIFT)) & X2_SUPX_DIG_ASIC_IN_REF_USE_PAD_MASK)

#define X2_SUPX_DIG_ASIC_IN_TEST_BURNIN_MASK     (0x20U)
#define X2_SUPX_DIG_ASIC_IN_TEST_BURNIN_SHIFT    (5U)
#define X2_SUPX_DIG_ASIC_IN_TEST_BURNIN_WIDTH    (1U)
#define X2_SUPX_DIG_ASIC_IN_TEST_BURNIN(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_TEST_BURNIN_SHIFT)) & X2_SUPX_DIG_ASIC_IN_TEST_BURNIN_MASK)

#define X2_SUPX_DIG_ASIC_IN_TEST_POWERDOWN_MASK  (0x40U)
#define X2_SUPX_DIG_ASIC_IN_TEST_POWERDOWN_SHIFT (6U)
#define X2_SUPX_DIG_ASIC_IN_TEST_POWERDOWN_WIDTH (1U)
#define X2_SUPX_DIG_ASIC_IN_TEST_POWERDOWN(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_TEST_POWERDOWN_SHIFT)) & X2_SUPX_DIG_ASIC_IN_TEST_POWERDOWN_MASK)

#define X2_SUPX_DIG_ASIC_IN_RTUNE_REQ_MASK       (0x80U)
#define X2_SUPX_DIG_ASIC_IN_RTUNE_REQ_SHIFT      (7U)
#define X2_SUPX_DIG_ASIC_IN_RTUNE_REQ_WIDTH      (1U)
#define X2_SUPX_DIG_ASIC_IN_RTUNE_REQ(x)         (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_RTUNE_REQ_SHIFT)) & X2_SUPX_DIG_ASIC_IN_RTUNE_REQ_MASK)

#define X2_SUPX_DIG_ASIC_IN_RTUNE_ACK_MASK       (0x100U)
#define X2_SUPX_DIG_ASIC_IN_RTUNE_ACK_SHIFT      (8U)
#define X2_SUPX_DIG_ASIC_IN_RTUNE_ACK_WIDTH      (1U)
#define X2_SUPX_DIG_ASIC_IN_RTUNE_ACK(x)         (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_RTUNE_ACK_SHIFT)) & X2_SUPX_DIG_ASIC_IN_RTUNE_ACK_MASK)

#define X2_SUPX_DIG_ASIC_IN_RES_REQ_IN_MASK      (0x200U)
#define X2_SUPX_DIG_ASIC_IN_RES_REQ_IN_SHIFT     (9U)
#define X2_SUPX_DIG_ASIC_IN_RES_REQ_IN_WIDTH     (1U)
#define X2_SUPX_DIG_ASIC_IN_RES_REQ_IN(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_RES_REQ_IN_SHIFT)) & X2_SUPX_DIG_ASIC_IN_RES_REQ_IN_MASK)

#define X2_SUPX_DIG_ASIC_IN_RES_REQ_OUT_MASK     (0x400U)
#define X2_SUPX_DIG_ASIC_IN_RES_REQ_OUT_SHIFT    (10U)
#define X2_SUPX_DIG_ASIC_IN_RES_REQ_OUT_WIDTH    (1U)
#define X2_SUPX_DIG_ASIC_IN_RES_REQ_OUT(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_RES_REQ_OUT_SHIFT)) & X2_SUPX_DIG_ASIC_IN_RES_REQ_OUT_MASK)

#define X2_SUPX_DIG_ASIC_IN_RES_ACK_IN_MASK      (0x800U)
#define X2_SUPX_DIG_ASIC_IN_RES_ACK_IN_SHIFT     (11U)
#define X2_SUPX_DIG_ASIC_IN_RES_ACK_IN_WIDTH     (1U)
#define X2_SUPX_DIG_ASIC_IN_RES_ACK_IN(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_RES_ACK_IN_SHIFT)) & X2_SUPX_DIG_ASIC_IN_RES_ACK_IN_MASK)

#define X2_SUPX_DIG_ASIC_IN_RES_ACK_OUT_MASK     (0x1000U)
#define X2_SUPX_DIG_ASIC_IN_RES_ACK_OUT_SHIFT    (12U)
#define X2_SUPX_DIG_ASIC_IN_RES_ACK_OUT_WIDTH    (1U)
#define X2_SUPX_DIG_ASIC_IN_RES_ACK_OUT(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_RES_ACK_OUT_SHIFT)) & X2_SUPX_DIG_ASIC_IN_RES_ACK_OUT_MASK)

#define X2_SUPX_DIG_ASIC_IN_MPLLA_STATE_MASK     (0x2000U)
#define X2_SUPX_DIG_ASIC_IN_MPLLA_STATE_SHIFT    (13U)
#define X2_SUPX_DIG_ASIC_IN_MPLLA_STATE_WIDTH    (1U)
#define X2_SUPX_DIG_ASIC_IN_MPLLA_STATE(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_MPLLA_STATE_SHIFT)) & X2_SUPX_DIG_ASIC_IN_MPLLA_STATE_MASK)

#define X2_SUPX_DIG_ASIC_IN_MPLLB_STATE_MASK     (0x4000U)
#define X2_SUPX_DIG_ASIC_IN_MPLLB_STATE_SHIFT    (14U)
#define X2_SUPX_DIG_ASIC_IN_MPLLB_STATE_WIDTH    (1U)
#define X2_SUPX_DIG_ASIC_IN_MPLLB_STATE(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_MPLLB_STATE_SHIFT)) & X2_SUPX_DIG_ASIC_IN_MPLLB_STATE_MASK)

#define X2_SUPX_DIG_ASIC_IN_TEST_TX_REF_CLK_EN_MASK (0x8000U)
#define X2_SUPX_DIG_ASIC_IN_TEST_TX_REF_CLK_EN_SHIFT (15U)
#define X2_SUPX_DIG_ASIC_IN_TEST_TX_REF_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_ASIC_IN_TEST_TX_REF_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ASIC_IN_TEST_TX_REF_CLK_EN_SHIFT)) & X2_SUPX_DIG_ASIC_IN_TEST_TX_REF_CLK_EN_MASK)
/*! @} */

/*! @name SUPX_DIG_LVL_ASIC_IN - Current values for incoming level controls from ASIC */
/*! @{ */

#define X2_SUPX_DIG_LVL_ASIC_IN_RX_VREF_CTRL_MASK (0x1FU)
#define X2_SUPX_DIG_LVL_ASIC_IN_RX_VREF_CTRL_SHIFT (0U)
#define X2_SUPX_DIG_LVL_ASIC_IN_RX_VREF_CTRL_WIDTH (5U)
#define X2_SUPX_DIG_LVL_ASIC_IN_RX_VREF_CTRL(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_LVL_ASIC_IN_RX_VREF_CTRL_SHIFT)) & X2_SUPX_DIG_LVL_ASIC_IN_RX_VREF_CTRL_MASK)

#define X2_SUPX_DIG_LVL_ASIC_IN_TX_VBOOST_LVL_MASK (0xE0U)
#define X2_SUPX_DIG_LVL_ASIC_IN_TX_VBOOST_LVL_SHIFT (5U)
#define X2_SUPX_DIG_LVL_ASIC_IN_TX_VBOOST_LVL_WIDTH (3U)
#define X2_SUPX_DIG_LVL_ASIC_IN_TX_VBOOST_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_LVL_ASIC_IN_TX_VBOOST_LVL_SHIFT)) & X2_SUPX_DIG_LVL_ASIC_IN_TX_VBOOST_LVL_MASK)

#define X2_SUPX_DIG_LVL_ASIC_IN_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_DIG_LVL_ASIC_IN_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_DIG_LVL_ASIC_IN_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_DIG_LVL_ASIC_IN_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_LVL_ASIC_IN_RESERVED_15_8_SHIFT)) & X2_SUPX_DIG_LVL_ASIC_IN_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_DIG_BANDGAP_ASIC_IN - Current values for incoming bandgap control from ASIC */
/*! @{ */

#define X2_SUPX_DIG_BANDGAP_ASIC_IN_BG_EN_MASK   (0x1U)
#define X2_SUPX_DIG_BANDGAP_ASIC_IN_BG_EN_SHIFT  (0U)
#define X2_SUPX_DIG_BANDGAP_ASIC_IN_BG_EN_WIDTH  (1U)
#define X2_SUPX_DIG_BANDGAP_ASIC_IN_BG_EN(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_BANDGAP_ASIC_IN_BG_EN_SHIFT)) & X2_SUPX_DIG_BANDGAP_ASIC_IN_BG_EN_MASK)

#define X2_SUPX_DIG_BANDGAP_ASIC_IN_RESERVED_15_1_MASK (0xFFFEU)
#define X2_SUPX_DIG_BANDGAP_ASIC_IN_RESERVED_15_1_SHIFT (1U)
#define X2_SUPX_DIG_BANDGAP_ASIC_IN_RESERVED_15_1_WIDTH (15U)
#define X2_SUPX_DIG_BANDGAP_ASIC_IN_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_BANDGAP_ASIC_IN_RESERVED_15_1_SHIFT)) & X2_SUPX_DIG_BANDGAP_ASIC_IN_RESERVED_15_1_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_BANDWIDTH_ASIC_IN - Current values for incoming MPLLA bandwidth controls from ASIC */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_BANDWIDTH_ASIC_IN_MPLLA_BANDWIDTH_MASK (0xFFFFU)
#define X2_SUPX_DIG_MPLLA_BANDWIDTH_ASIC_IN_MPLLA_BANDWIDTH_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_BANDWIDTH_ASIC_IN_MPLLA_BANDWIDTH_WIDTH (16U)
#define X2_SUPX_DIG_MPLLA_BANDWIDTH_ASIC_IN_MPLLA_BANDWIDTH(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_BANDWIDTH_ASIC_IN_MPLLA_BANDWIDTH_SHIFT)) & X2_SUPX_DIG_MPLLA_BANDWIDTH_ASIC_IN_MPLLA_BANDWIDTH_MASK)
/*! @} */

