zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name SUPX_DIG_MPLLB_BANDWIDTH_ASIC_IN - Current values for incoming MPLLB bandwidth controls from ASIC */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_BANDWIDTH_ASIC_IN_MPLLB_BANDWIDTH_MASK (0xFFFFU)
#define X2_SUPX_DIG_MPLLB_BANDWIDTH_ASIC_IN_MPLLB_BANDWIDTH_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_BANDWIDTH_ASIC_IN_MPLLB_BANDWIDTH_WIDTH (16U)
#define X2_SUPX_DIG_MPLLB_BANDWIDTH_ASIC_IN_MPLLB_BANDWIDTH(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_BANDWIDTH_ASIC_IN_MPLLB_BANDWIDTH_SHIFT)) & X2_SUPX_DIG_MPLLB_BANDWIDTH_ASIC_IN_MPLLB_BANDWIDTH_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL - MPLL Calibration controls */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_MASK (0xFU)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_WIDTH (4U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_MASK)

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_MASK (0x10U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_SHIFT (4U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_MASK)

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_MASK (0x20U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_SHIFT (5U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_MASK)

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CHKFRQ_EN_MASK (0x40U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CHKFRQ_EN_SHIFT (6U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CHKFRQ_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CHKFRQ_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CHKFRQ_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CHKFRQ_EN_MASK)

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_COARSE_TUNE_MASK (0x7F80U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_COARSE_TUNE_SHIFT (7U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_COARSE_TUNE_WIDTH (8U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_COARSE_TUNE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_COARSE_TUNE_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_COARSE_TUNE_MASK)

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CAL_DONE_MASK (0x8000U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CAL_DONE_SHIFT (15U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CAL_DONE_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CAL_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CAL_DONE_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_CAL_CTRL_EXT_CAL_DONE_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD - MPLL override controls */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_OVRD_SEL_MASK (0x1U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_OVRD_SEL_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_OVRD_SEL_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_OVRD_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_OVRD_SEL_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_OVRD_SEL_MASK)

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_FBDIGCLK_EN_MASK (0x2U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_FBDIGCLK_EN_SHIFT (1U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_FBDIGCLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_FBDIGCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_FBDIGCLK_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_FBDIGCLK_EN_MASK)

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_PCLK_EN_MASK (0x4U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_PCLK_EN_SHIFT (2U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_PCLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_PCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_PCLK_EN_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_MPLL_PCLK_EN_MASK)

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_PWRUP_MASK (0x8U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_PWRUP_SHIFT (3U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_PWRUP_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_PWRUP(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_PWRUP_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_PWRUP_MASK)

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_LOCK_MASK (0x10U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_LOCK_SHIFT (4U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_LOCK_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_LOCK(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_LOCK_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_FAST_MPLL_LOCK_MASK)

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_DTB_SEL_MASK (0x3E0U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_DTB_SEL_SHIFT (5U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_DTB_SEL_WIDTH (5U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_DTB_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_DTB_SEL_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_DTB_SEL_MASK)

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_SHIFT (10U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_WIDTH (6U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_OVRD_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_MPLL_PWR_CTL_STAT - MPLL status register */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_STAT_FSM_STATE_MASK (0xFU)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_STAT_FSM_STATE_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_STAT_FSM_STATE_WIDTH (4U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_STAT_FSM_STATE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_STAT_FSM_STATE_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_STAT_FSM_STATE_MASK)

