zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_RESERVED_15_8_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE - Value for MPLL coarse_tune when skipping calibration */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_MPLL_SKIPCAL_COARSE_TUNE_MASK (0xFFU)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_MPLL_SKIPCAL_COARSE_TUNE_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_MPLL_SKIPCAL_COARSE_TUNE_WIDTH (8U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_MPLL_SKIPCAL_COARSE_TUNE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_MPLL_SKIPCAL_COARSE_TUNE_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_MPLL_SKIPCAL_COARSE_TUNE_MASK)

#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_RESERVED_15_8_SHIFT)) & X2_SUPX_DIG_MPLLA_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_SSC_SS_PHASE - Current MPLL phase selector value */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_DTHR_MASK (0x3U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_DTHR_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_DTHR_WIDTH (2U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_DTHR(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_DTHR_SHIFT)) & X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_DTHR_MASK)

#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_VAL_MASK  (0x7FCU)
#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_VAL_SHIFT (2U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_VAL_WIDTH (9U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_VAL_SHIFT)) & X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_VAL_MASK)

#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_ZERO_FREQ_MASK (0x800U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_ZERO_FREQ_SHIFT (11U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_ZERO_FREQ_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_ZERO_FREQ(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_ZERO_FREQ_SHIFT)) & X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_ZERO_FREQ_MASK)

#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_RESERVED_15_12_MASK (0xF000U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_RESERVED_15_12_SHIFT (12U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_RESERVED_15_12_WIDTH (4U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_RESERVED_15_12_SHIFT)) & X2_SUPX_DIG_MPLLA_SSC_SS_PHASE_RESERVED_15_12_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_SSC_SS_FREQ_0 - Frequency Control for Spread Spectrum #0 */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_FREQ_CNT_INIT_MASK (0xFFFU)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_FREQ_CNT_INIT_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_FREQ_CNT_INIT_WIDTH (12U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_FREQ_CNT_INIT(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_FREQ_CNT_INIT_SHIFT)) & X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_FREQ_CNT_INIT_MASK)

#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_FREQ_0_OVRD_MASK (0x1000U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_FREQ_0_OVRD_SHIFT (12U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_FREQ_0_OVRD_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_FREQ_0_OVRD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_FREQ_0_OVRD_SHIFT)) & X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_FREQ_0_OVRD_MASK)

#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_RESERVED_15_13_MASK (0xE000U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_RESERVED_15_13_SHIFT (13U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_RESERVED_15_13_WIDTH (3U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_RESERVED_15_13_SHIFT)) & X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_0_RESERVED_15_13_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLA_SSC_SS_FREQ_1 - Frequency Control for Spread Spectrum #1 */
/*! @{ */

#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_FREQ_PK_MASK (0xFFU)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_FREQ_PK_SHIFT (0U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_FREQ_PK_WIDTH (8U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_FREQ_PK(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_FREQ_PK_SHIFT)) & X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_FREQ_PK_MASK)

#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_FREQ_1_OVRD_MASK (0x100U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_FREQ_1_OVRD_SHIFT (8U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_FREQ_1_OVRD_WIDTH (1U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_FREQ_1_OVRD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_FREQ_1_OVRD_SHIFT)) & X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_FREQ_1_OVRD_MASK)

#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_RESERVED_15_9_MASK (0xFE00U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_RESERVED_15_9_SHIFT (9U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_RESERVED_15_9_WIDTH (7U)
#define X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_RESERVED_15_9_SHIFT)) & X2_SUPX_DIG_MPLLA_SSC_SS_FREQ_1_RESERVED_15_9_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL - MPLL Calibration controls */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_MASK (0xFU)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_WIDTH (4U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_LOAD_CNT_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_MASK (0x10U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_SHIFT (4U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_MPLL_SKIPCAL_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_MASK (0x20U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_SHIFT (5U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_CAL_CTRL_MPLL_EXTCAL_MASK)

