zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_MASK (0x200U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_SHIFT (9U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_PCLK_EN_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_MASK (0x400U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_SHIFT (10U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_OUTPUT_EN_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_FBCLK_EN_MASK (0x800U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_FBCLK_EN_SHIFT (11U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_FBCLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_FBCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_FBCLK_EN_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_FBCLK_EN_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_MASK (0x1000U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_SHIFT (12U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_CAL_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_RST_MASK (0x2000U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_RST_SHIFT (13U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_RST_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_RST_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_RST_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_ANA_EN_MASK (0x4000U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_ANA_EN_SHIFT (14U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_ANA_EN_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_ANA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_ANA_EN_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_MPLL_ANA_EN_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_RESERVED_15_15_MASK (0x8000U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_RESERVED_15_15_SHIFT (15U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_RESERVED_15_15_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_RESERVED_15_15_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_STAT_RESERVED_15_15_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD - Thresholds for MPLL CAL Update timer and MPLL VCO Stabilization timer */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_VCO_STABILIZATION_TIME_THRESHOLD_MASK (0x1FFU)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_VCO_STABILIZATION_TIME_THRESHOLD_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_VCO_STABILIZATION_TIME_THRESHOLD_WIDTH (9U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_VCO_STABILIZATION_TIME_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_VCO_STABILIZATION_TIME_THRESHOLD_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_VCO_STABILIZATION_TIME_THRESHOLD_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_MPLL_CAL_UPDATE_TIME_THRESHOLD_MASK (0x1E00U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_MPLL_CAL_UPDATE_TIME_THRESHOLD_SHIFT (9U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_MPLL_CAL_UPDATE_TIME_THRESHOLD_WIDTH (4U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_MPLL_CAL_UPDATE_TIME_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_MPLL_CAL_UPDATE_TIME_THRESHOLD_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_MPLL_CAL_UPDATE_TIME_THRESHOLD_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_RESERVED_15_13_MASK (0xE000U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_RESERVED_15_13_SHIFT (13U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_RESERVED_15_13_WIDTH (3U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_RESERVED_15_13_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_MISC_TIME_THRESHOLD_RESERVED_15_13_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD - Thresholds for PCLK enable and MPLL VCO Clock Stabilization timer */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_VCO_CLK_STABILIZATION_TIME_THRESHOLD_MASK (0x7FFU)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_VCO_CLK_STABILIZATION_TIME_THRESHOLD_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_VCO_CLK_STABILIZATION_TIME_THRESHOLD_WIDTH (11U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_VCO_CLK_STABILIZATION_TIME_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_VCO_CLK_STABILIZATION_TIME_THRESHOLD_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_VCO_CLK_STABILIZATION_TIME_THRESHOLD_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_PCLK_EN_TIME_THRESHOLD_MASK (0xF800U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_PCLK_EN_TIME_THRESHOLD_SHIFT (11U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_PCLK_EN_TIME_THRESHOLD_WIDTH (5U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_PCLK_EN_TIME_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_PCLK_EN_TIME_THRESHOLD_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_EN_AND_VCO_CLK_STABILIZATION_TIME_THRESHOLD_PCLK_EN_TIME_THRESHOLD_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD - Thresholds for PCLK disable and MPLL VCO POWER DOWN timer */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_PCLK_DIS_TIME_THRESHOLD_MASK (0x1FU)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_PCLK_DIS_TIME_THRESHOLD_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_PCLK_DIS_TIME_THRESHOLD_WIDTH (5U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_PCLK_DIS_TIME_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_PCLK_DIS_TIME_THRESHOLD_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_PCLK_DIS_TIME_THRESHOLD_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_MPLL_VCO_PWRDN_TIME_THRESHOLD_MASK (0x3E0U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_MPLL_VCO_PWRDN_TIME_THRESHOLD_SHIFT (5U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_MPLL_VCO_PWRDN_TIME_THRESHOLD_WIDTH (5U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_MPLL_VCO_PWRDN_TIME_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_MPLL_VCO_PWRDN_TIME_THRESHOLD_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_MPLL_VCO_PWRDN_TIME_THRESHOLD_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_RESERVED_15_10_SHIFT (10U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_RESERVED_15_10_WIDTH (6U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_RESERVED_15_10_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_PCLK_DIS_AND_MPLL_VCO_PWRDN_THRESHOLD_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD - Thresholds for MPLL feedback clock enable and MPLL feedback digital clock disable and MPLL ANA POWER UP timer */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_FBCLK_EN_TIME_THRESHOLD_MASK (0xFU)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_FBCLK_EN_TIME_THRESHOLD_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_FBCLK_EN_TIME_THRESHOLD_WIDTH (4U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_FBCLK_EN_TIME_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_FBCLK_EN_TIME_THRESHOLD_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_FBCLK_EN_TIME_THRESHOLD_MASK)

