zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_FBDIGCLK_DIS_TIME_THRESHOLD_MASK (0xF0U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_FBDIGCLK_DIS_TIME_THRESHOLD_SHIFT (4U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_FBDIGCLK_DIS_TIME_THRESHOLD_WIDTH (4U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_FBDIGCLK_DIS_TIME_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_FBDIGCLK_DIS_TIME_THRESHOLD_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_FBDIGCLK_DIS_TIME_THRESHOLD_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_ANA_PWRUP_TIME_THRESHOLD_MASK (0x7F00U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_ANA_PWRUP_TIME_THRESHOLD_SHIFT (8U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_ANA_PWRUP_TIME_THRESHOLD_WIDTH (7U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_ANA_PWRUP_TIME_THRESHOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_ANA_PWRUP_TIME_THRESHOLD_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_MPLL_ANA_PWRUP_TIME_THRESHOLD_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_RESERVED_15_15_MASK (0x8000U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_RESERVED_15_15_SHIFT (15U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_RESERVED_15_15_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_RESERVED_15_15_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_FBCLK_EN_AND_MPLL_FBDIGCLK_DIS_AND_MPLL_ANA_PWRUP_TIME_THRESHOLD_RESERVED_15_15_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL - MPLL coarse_tune value register */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_MPLL_COARSE_TUNE_VAL_MASK (0xFFU)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_MPLL_COARSE_TUNE_VAL_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_MPLL_COARSE_TUNE_VAL_WIDTH (8U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_MPLL_COARSE_TUNE_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_MPLL_COARSE_TUNE_VAL_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_MPLL_COARSE_TUNE_VAL_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_RESERVED_15_8_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_COARSE_TUNE_VAL_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE - Value for MPLL coarse_tune when skipping calibration */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_MPLL_SKIPCAL_COARSE_TUNE_MASK (0xFFU)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_MPLL_SKIPCAL_COARSE_TUNE_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_MPLL_SKIPCAL_COARSE_TUNE_WIDTH (8U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_MPLL_SKIPCAL_COARSE_TUNE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_MPLL_SKIPCAL_COARSE_TUNE_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_MPLL_SKIPCAL_COARSE_TUNE_MASK)

#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_RESERVED_15_8_SHIFT)) & X2_SUPX_DIG_MPLLB_MPLL_PWR_CTL_MPLL_SKIPCAL_COARSE_TUNE_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLB_SSC_SS_PHASE - Current MPLL phase selector value */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_DTHR_MASK (0x3U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_DTHR_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_DTHR_WIDTH (2U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_DTHR(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_DTHR_SHIFT)) & X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_DTHR_MASK)

#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_VAL_MASK  (0x7FCU)
#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_VAL_SHIFT (2U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_VAL_WIDTH (9U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_VAL_SHIFT)) & X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_VAL_MASK)

#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_ZERO_FREQ_MASK (0x800U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_ZERO_FREQ_SHIFT (11U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_ZERO_FREQ_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_ZERO_FREQ(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_ZERO_FREQ_SHIFT)) & X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_ZERO_FREQ_MASK)

