zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_RESERVED_15_12_MASK (0xF000U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_RESERVED_15_12_SHIFT (12U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_RESERVED_15_12_WIDTH (4U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_RESERVED_15_12_SHIFT)) & X2_SUPX_DIG_MPLLB_SSC_SS_PHASE_RESERVED_15_12_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLB_SSC_SS_FREQ_0 - Frequency Control for Spread Spectrum #0 */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_FREQ_CNT_INIT_MASK (0xFFFU)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_FREQ_CNT_INIT_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_FREQ_CNT_INIT_WIDTH (12U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_FREQ_CNT_INIT(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_FREQ_CNT_INIT_SHIFT)) & X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_FREQ_CNT_INIT_MASK)

#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_FREQ_0_OVRD_MASK (0x1000U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_FREQ_0_OVRD_SHIFT (12U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_FREQ_0_OVRD_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_FREQ_0_OVRD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_FREQ_0_OVRD_SHIFT)) & X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_FREQ_0_OVRD_MASK)

#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_RESERVED_15_13_MASK (0xE000U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_RESERVED_15_13_SHIFT (13U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_RESERVED_15_13_WIDTH (3U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_RESERVED_15_13_SHIFT)) & X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_0_RESERVED_15_13_MASK)
/*! @} */

/*! @name SUPX_DIG_MPLLB_SSC_SS_FREQ_1 - Frequency Control for Spread Spectrum #1 */
/*! @{ */

#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_FREQ_PK_MASK (0xFFU)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_FREQ_PK_SHIFT (0U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_FREQ_PK_WIDTH (8U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_FREQ_PK(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_FREQ_PK_SHIFT)) & X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_FREQ_PK_MASK)

#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_FREQ_1_OVRD_MASK (0x100U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_FREQ_1_OVRD_SHIFT (8U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_FREQ_1_OVRD_WIDTH (1U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_FREQ_1_OVRD(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_FREQ_1_OVRD_SHIFT)) & X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_FREQ_1_OVRD_MASK)

#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_RESERVED_15_9_MASK (0xFE00U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_RESERVED_15_9_SHIFT (9U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_RESERVED_15_9_WIDTH (7U)
#define X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_RESERVED_15_9_SHIFT)) & X2_SUPX_DIG_MPLLB_SSC_SS_FREQ_1_RESERVED_15_9_MASK)
/*! @} */

/*! @name SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0 - BG Power UP Time Register #0 */
/*! @{ */

#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_BG_SUP_EN_TIME_MASK (0x1FFU)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_BG_SUP_EN_TIME_SHIFT (0U)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_BG_SUP_EN_TIME_WIDTH (9U)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_BG_SUP_EN_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_BG_SUP_EN_TIME_SHIFT)) & X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_BG_SUP_EN_TIME_MASK)

#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_FAST_BG_WAIT_MASK (0x200U)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_FAST_BG_WAIT_SHIFT (9U)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_FAST_BG_WAIT_WIDTH (1U)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_FAST_BG_WAIT(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_FAST_BG_WAIT_SHIFT)) & X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_FAST_BG_WAIT_MASK)

#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_RESERVED_15_10_SHIFT (10U)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_RESERVED_15_10_WIDTH (6U)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_RESERVED_15_10_SHIFT)) & X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_0_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1 - BG Power UP Time Register #1 */
/*! @{ */

#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1_BG_LANE_EN_TIME_MASK (0x3FFU)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1_BG_LANE_EN_TIME_SHIFT (0U)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1_BG_LANE_EN_TIME_WIDTH (10U)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1_BG_LANE_EN_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1_BG_LANE_EN_TIME_SHIFT)) & X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1_BG_LANE_EN_TIME_MASK)

#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1_RESERVED_15_10_SHIFT (10U)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1_RESERVED_15_10_WIDTH (6U)
#define X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1_RESERVED_15_10_SHIFT)) & X2_SUPX_DIG_CLK_RST_BG_PWRUP_TIME_1_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUPX_ANA_MPLLA_MISC - MPLLA_MISC */
/*! @{ */

#define X2_SUPX_ANA_MPLLA_MISC_bypass_buf_MASK   (0x1U)
#define X2_SUPX_ANA_MPLLA_MISC_bypass_buf_SHIFT  (0U)
#define X2_SUPX_ANA_MPLLA_MISC_bypass_buf_WIDTH  (1U)
#define X2_SUPX_ANA_MPLLA_MISC_bypass_buf(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_MISC_bypass_buf_SHIFT)) & X2_SUPX_ANA_MPLLA_MISC_bypass_buf_MASK)

#define X2_SUPX_ANA_MPLLA_MISC_ovrd_pr_bypass_MASK (0x2U)
#define X2_SUPX_ANA_MPLLA_MISC_ovrd_pr_bypass_SHIFT (1U)
#define X2_SUPX_ANA_MPLLA_MISC_ovrd_pr_bypass_WIDTH (1U)
#define X2_SUPX_ANA_MPLLA_MISC_ovrd_pr_bypass(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_MISC_ovrd_pr_bypass_SHIFT)) & X2_SUPX_ANA_MPLLA_MISC_ovrd_pr_bypass_MASK)

#define X2_SUPX_ANA_MPLLA_MISC_mode_old_ssc_MASK (0x4U)
#define X2_SUPX_ANA_MPLLA_MISC_mode_old_ssc_SHIFT (2U)
#define X2_SUPX_ANA_MPLLA_MISC_mode_old_ssc_WIDTH (1U)
#define X2_SUPX_ANA_MPLLA_MISC_mode_old_ssc(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_MISC_mode_old_ssc_SHIFT)) & X2_SUPX_ANA_MPLLA_MISC_mode_old_ssc_MASK)

#define X2_SUPX_ANA_MPLLA_MISC_pr_bypass_MASK    (0x8U)
#define X2_SUPX_ANA_MPLLA_MISC_pr_bypass_SHIFT   (3U)
#define X2_SUPX_ANA_MPLLA_MISC_pr_bypass_WIDTH   (1U)
#define X2_SUPX_ANA_MPLLA_MISC_pr_bypass(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_MISC_pr_bypass_SHIFT)) & X2_SUPX_ANA_MPLLA_MISC_pr_bypass_MASK)

#define X2_SUPX_ANA_MPLLA_MISC_NC7_4_MASK        (0xF0U)
#define X2_SUPX_ANA_MPLLA_MISC_NC7_4_SHIFT       (4U)
#define X2_SUPX_ANA_MPLLA_MISC_NC7_4_WIDTH       (4U)
#define X2_SUPX_ANA_MPLLA_MISC_NC7_4(x)          (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_MISC_NC7_4_SHIFT)) & X2_SUPX_ANA_MPLLA_MISC_NC7_4_MASK)

#define X2_SUPX_ANA_MPLLA_MISC_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_ANA_MPLLA_MISC_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_ANA_MPLLA_MISC_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_ANA_MPLLA_MISC_RESERVED_15_8(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_MISC_RESERVED_15_8_SHIFT)) & X2_SUPX_ANA_MPLLA_MISC_RESERVED_15_8_MASK)
/*! @} */

