zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_ANA_MPLLA_ATB2_meas_vreg_vp_MASK (0x2U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_vreg_vp_SHIFT (1U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_vreg_vp_WIDTH (1U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_vreg_vp(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB2_meas_vreg_vp_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB2_meas_vreg_vp_MASK)

#define X2_SUPX_ANA_MPLLA_ATB2_meas_vreg_cp_MASK (0x4U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_vreg_cp_SHIFT (2U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_vreg_cp_WIDTH (1U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_vreg_cp(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB2_meas_vreg_cp_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB2_meas_vreg_cp_MASK)

#define X2_SUPX_ANA_MPLLA_ATB2_meas_vp_MASK      (0x8U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_vp_SHIFT     (3U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_vp_WIDTH     (1U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_vp(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB2_meas_vp_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB2_meas_vp_MASK)

#define X2_SUPX_ANA_MPLLA_ATB2_meas_gd_MASK      (0x10U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_gd_SHIFT     (4U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_gd_WIDTH     (1U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_gd(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB2_meas_gd_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB2_meas_gd_MASK)

#define X2_SUPX_ANA_MPLLA_ATB2_meas_ctl_fine_MASK (0x20U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_ctl_fine_SHIFT (5U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_ctl_fine_WIDTH (1U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_ctl_fine(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB2_meas_ctl_fine_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB2_meas_ctl_fine_MASK)

#define X2_SUPX_ANA_MPLLA_ATB2_meas_mag_ctrl_MASK (0x40U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_mag_ctrl_SHIFT (6U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_mag_ctrl_WIDTH (1U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_mag_ctrl(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB2_meas_mag_ctrl_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB2_meas_mag_ctrl_MASK)

#define X2_SUPX_ANA_MPLLA_ATB2_meas_mag_ref_MASK (0x80U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_mag_ref_SHIFT (7U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_mag_ref_WIDTH (1U)
#define X2_SUPX_ANA_MPLLA_ATB2_meas_mag_ref(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB2_meas_mag_ref_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB2_meas_mag_ref_MASK)

#define X2_SUPX_ANA_MPLLA_ATB2_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_ANA_MPLLA_ATB2_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_ANA_MPLLA_ATB2_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_ANA_MPLLA_ATB2_RESERVED_15_8(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB2_RESERVED_15_8_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB2_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_ANA_MPLLA_ATB3 - MPLLA_ATB3 */
/*! @{ */

#define X2_SUPX_ANA_MPLLA_ATB3_force_fine_high_MASK (0x1U)
#define X2_SUPX_ANA_MPLLA_ATB3_force_fine_high_SHIFT (0U)
#define X2_SUPX_ANA_MPLLA_ATB3_force_fine_high_WIDTH (1U)
#define X2_SUPX_ANA_MPLLA_ATB3_force_fine_high(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB3_force_fine_high_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB3_force_fine_high_MASK)

#define X2_SUPX_ANA_MPLLA_ATB3_force_fine_low_MASK (0x2U)
#define X2_SUPX_ANA_MPLLA_ATB3_force_fine_low_SHIFT (1U)
#define X2_SUPX_ANA_MPLLA_ATB3_force_fine_low_WIDTH (1U)
#define X2_SUPX_ANA_MPLLA_ATB3_force_fine_low(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB3_force_fine_low_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB3_force_fine_low_MASK)

#define X2_SUPX_ANA_MPLLA_ATB3_override_amp_atb_MASK (0x4U)
#define X2_SUPX_ANA_MPLLA_ATB3_override_amp_atb_SHIFT (2U)
#define X2_SUPX_ANA_MPLLA_ATB3_override_amp_atb_WIDTH (1U)
#define X2_SUPX_ANA_MPLLA_ATB3_override_amp_atb(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB3_override_amp_atb_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB3_override_amp_atb_MASK)

#define X2_SUPX_ANA_MPLLA_ATB3_override_amp_high_MASK (0x8U)
#define X2_SUPX_ANA_MPLLA_ATB3_override_amp_high_SHIFT (3U)
#define X2_SUPX_ANA_MPLLA_ATB3_override_amp_high_WIDTH (1U)
#define X2_SUPX_ANA_MPLLA_ATB3_override_amp_high(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB3_override_amp_high_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB3_override_amp_high_MASK)

#define X2_SUPX_ANA_MPLLA_ATB3_override_amp_low_MASK (0x10U)
#define X2_SUPX_ANA_MPLLA_ATB3_override_amp_low_SHIFT (4U)
#define X2_SUPX_ANA_MPLLA_ATB3_override_amp_low_WIDTH (1U)
#define X2_SUPX_ANA_MPLLA_ATB3_override_amp_low(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB3_override_amp_low_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB3_override_amp_low_MASK)

#define X2_SUPX_ANA_MPLLA_ATB3_meas_atb_dll_bias_MASK (0x20U)
#define X2_SUPX_ANA_MPLLA_ATB3_meas_atb_dll_bias_SHIFT (5U)
#define X2_SUPX_ANA_MPLLA_ATB3_meas_atb_dll_bias_WIDTH (1U)
#define X2_SUPX_ANA_MPLLA_ATB3_meas_atb_dll_bias(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB3_meas_atb_dll_bias_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB3_meas_atb_dll_bias_MASK)

#define X2_SUPX_ANA_MPLLA_ATB3_atb_select_MASK   (0x40U)
#define X2_SUPX_ANA_MPLLA_ATB3_atb_select_SHIFT  (6U)
#define X2_SUPX_ANA_MPLLA_ATB3_atb_select_WIDTH  (1U)
#define X2_SUPX_ANA_MPLLA_ATB3_atb_select(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB3_atb_select_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB3_atb_select_MASK)

#define X2_SUPX_ANA_MPLLA_ATB3_NC7_MASK          (0x80U)
#define X2_SUPX_ANA_MPLLA_ATB3_NC7_SHIFT         (7U)
#define X2_SUPX_ANA_MPLLA_ATB3_NC7_WIDTH         (1U)
#define X2_SUPX_ANA_MPLLA_ATB3_NC7(x)            (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB3_NC7_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB3_NC7_MASK)

#define X2_SUPX_ANA_MPLLA_ATB3_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_ANA_MPLLA_ATB3_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_ANA_MPLLA_ATB3_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_ANA_MPLLA_ATB3_RESERVED_15_8(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLA_ATB3_RESERVED_15_8_SHIFT)) & X2_SUPX_ANA_MPLLA_ATB3_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_ANA_MPLLB_MISC - MPLLB_MISC */
/*! @{ */

#define X2_SUPX_ANA_MPLLB_MISC_bypass_buf_MASK   (0x1U)
#define X2_SUPX_ANA_MPLLB_MISC_bypass_buf_SHIFT  (0U)
#define X2_SUPX_ANA_MPLLB_MISC_bypass_buf_WIDTH  (1U)
#define X2_SUPX_ANA_MPLLB_MISC_bypass_buf(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_MISC_bypass_buf_SHIFT)) & X2_SUPX_ANA_MPLLB_MISC_bypass_buf_MASK)

#define X2_SUPX_ANA_MPLLB_MISC_ovrd_pr_bypass_MASK (0x2U)
#define X2_SUPX_ANA_MPLLB_MISC_ovrd_pr_bypass_SHIFT (1U)
#define X2_SUPX_ANA_MPLLB_MISC_ovrd_pr_bypass_WIDTH (1U)
#define X2_SUPX_ANA_MPLLB_MISC_ovrd_pr_bypass(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_MISC_ovrd_pr_bypass_SHIFT)) & X2_SUPX_ANA_MPLLB_MISC_ovrd_pr_bypass_MASK)

#define X2_SUPX_ANA_MPLLB_MISC_mode_old_ssc_MASK (0x4U)
#define X2_SUPX_ANA_MPLLB_MISC_mode_old_ssc_SHIFT (2U)
#define X2_SUPX_ANA_MPLLB_MISC_mode_old_ssc_WIDTH (1U)
#define X2_SUPX_ANA_MPLLB_MISC_mode_old_ssc(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_MISC_mode_old_ssc_SHIFT)) & X2_SUPX_ANA_MPLLB_MISC_mode_old_ssc_MASK)

#define X2_SUPX_ANA_MPLLB_MISC_pr_bypass_MASK    (0x8U)
#define X2_SUPX_ANA_MPLLB_MISC_pr_bypass_SHIFT   (3U)
#define X2_SUPX_ANA_MPLLB_MISC_pr_bypass_WIDTH   (1U)
#define X2_SUPX_ANA_MPLLB_MISC_pr_bypass(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_MISC_pr_bypass_SHIFT)) & X2_SUPX_ANA_MPLLB_MISC_pr_bypass_MASK)

#define X2_SUPX_ANA_MPLLB_MISC_NC7_4_MASK        (0xF0U)
#define X2_SUPX_ANA_MPLLB_MISC_NC7_4_SHIFT       (4U)
#define X2_SUPX_ANA_MPLLB_MISC_NC7_4_WIDTH       (4U)
#define X2_SUPX_ANA_MPLLB_MISC_NC7_4(x)          (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_MISC_NC7_4_SHIFT)) & X2_SUPX_ANA_MPLLB_MISC_NC7_4_MASK)

#define X2_SUPX_ANA_MPLLB_MISC_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_ANA_MPLLB_MISC_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_ANA_MPLLB_MISC_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_ANA_MPLLB_MISC_RESERVED_15_8(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_MISC_RESERVED_15_8_SHIFT)) & X2_SUPX_ANA_MPLLB_MISC_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_ANA_MPLLB_OVRD - MPLLB_OVRD */
/*! @{ */

