zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_enable_MASK  (0x1U)
#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_enable_SHIFT (0U)
#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_enable_WIDTH (1U)
#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_enable(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_OVRD_ovrd_enable_SHIFT)) & X2_SUPX_ANA_MPLLB_OVRD_ovrd_enable_MASK)

#define X2_SUPX_ANA_MPLLB_OVRD_enable_reg_MASK   (0x2U)
#define X2_SUPX_ANA_MPLLB_OVRD_enable_reg_SHIFT  (1U)
#define X2_SUPX_ANA_MPLLB_OVRD_enable_reg_WIDTH  (1U)
#define X2_SUPX_ANA_MPLLB_OVRD_enable_reg(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_OVRD_enable_reg_SHIFT)) & X2_SUPX_ANA_MPLLB_OVRD_enable_reg_MASK)

#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_cal_MASK     (0x4U)
#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_cal_SHIFT    (2U)
#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_cal_WIDTH    (1U)
#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_cal(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_OVRD_ovrd_cal_SHIFT)) & X2_SUPX_ANA_MPLLB_OVRD_ovrd_cal_MASK)

#define X2_SUPX_ANA_MPLLB_OVRD_cal_reg_MASK      (0x8U)
#define X2_SUPX_ANA_MPLLB_OVRD_cal_reg_SHIFT     (3U)
#define X2_SUPX_ANA_MPLLB_OVRD_cal_reg_WIDTH     (1U)
#define X2_SUPX_ANA_MPLLB_OVRD_cal_reg(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_OVRD_cal_reg_SHIFT)) & X2_SUPX_ANA_MPLLB_OVRD_cal_reg_MASK)

#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_fb_clk_en_MASK (0x10U)
#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_fb_clk_en_SHIFT (4U)
#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_fb_clk_en_WIDTH (1U)
#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_fb_clk_en(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_OVRD_ovrd_fb_clk_en_SHIFT)) & X2_SUPX_ANA_MPLLB_OVRD_ovrd_fb_clk_en_MASK)

#define X2_SUPX_ANA_MPLLB_OVRD_fb_clk_en_reg_MASK (0x20U)
#define X2_SUPX_ANA_MPLLB_OVRD_fb_clk_en_reg_SHIFT (5U)
#define X2_SUPX_ANA_MPLLB_OVRD_fb_clk_en_reg_WIDTH (1U)
#define X2_SUPX_ANA_MPLLB_OVRD_fb_clk_en_reg(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_OVRD_fb_clk_en_reg_SHIFT)) & X2_SUPX_ANA_MPLLB_OVRD_fb_clk_en_reg_MASK)

#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_reset_MASK   (0x40U)
#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_reset_SHIFT  (6U)
#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_reset_WIDTH  (1U)
#define X2_SUPX_ANA_MPLLB_OVRD_ovrd_reset(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_OVRD_ovrd_reset_SHIFT)) & X2_SUPX_ANA_MPLLB_OVRD_ovrd_reset_MASK)

#define X2_SUPX_ANA_MPLLB_OVRD_reset_reg_MASK    (0x80U)
#define X2_SUPX_ANA_MPLLB_OVRD_reset_reg_SHIFT   (7U)
#define X2_SUPX_ANA_MPLLB_OVRD_reset_reg_WIDTH   (1U)
#define X2_SUPX_ANA_MPLLB_OVRD_reset_reg(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_OVRD_reset_reg_SHIFT)) & X2_SUPX_ANA_MPLLB_OVRD_reset_reg_MASK)

#define X2_SUPX_ANA_MPLLB_OVRD_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_ANA_MPLLB_OVRD_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_ANA_MPLLB_OVRD_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_ANA_MPLLB_OVRD_RESERVED_15_8(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_OVRD_RESERVED_15_8_SHIFT)) & X2_SUPX_ANA_MPLLB_OVRD_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_ANA_MPLLB_ATB1 - MPLLB_ATB1 */
/*! @{ */

#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_vco_MASK (0x1U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_vco_SHIFT (0U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_vco_WIDTH (1U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_vco(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_ATB1_override_vreg_vco_SHIFT)) & X2_SUPX_ANA_MPLLB_ATB1_override_vreg_vco_MASK)

#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_right_MASK (0x2U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_right_SHIFT (1U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_right_WIDTH (1U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_right(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_ATB1_override_vreg_right_SHIFT)) & X2_SUPX_ANA_MPLLB_ATB1_override_vreg_right_MASK)

#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_left_MASK (0x4U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_left_SHIFT (2U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_left_WIDTH (1U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_left(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_ATB1_override_vreg_left_SHIFT)) & X2_SUPX_ANA_MPLLB_ATB1_override_vreg_left_MASK)

#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_vp_MASK (0x8U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_vp_SHIFT (3U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_vp_WIDTH (1U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_vp(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_ATB1_override_vreg_vp_SHIFT)) & X2_SUPX_ANA_MPLLB_ATB1_override_vreg_vp_MASK)

#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_cp_MASK (0x10U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_cp_SHIFT (4U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_cp_WIDTH (1U)
#define X2_SUPX_ANA_MPLLB_ATB1_override_vreg_cp(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_ATB1_override_vreg_cp_SHIFT)) & X2_SUPX_ANA_MPLLB_ATB1_override_vreg_cp_MASK)

#define X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_vco_MASK (0x20U)
#define X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_vco_SHIFT (5U)
#define X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_vco_WIDTH (1U)
#define X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_vco(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_vco_SHIFT)) & X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_vco_MASK)

#define X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_s_MASK  (0x40U)
#define X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_s_SHIFT (6U)
#define X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_s_WIDTH (1U)
#define X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_s(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_s_SHIFT)) & X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_s_MASK)

#define X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_l_MASK  (0x80U)
#define X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_l_SHIFT (7U)
#define X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_l_WIDTH (1U)
#define X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_l(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_l_SHIFT)) & X2_SUPX_ANA_MPLLB_ATB1_meas_vreg_l_MASK)

#define X2_SUPX_ANA_MPLLB_ATB1_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_ANA_MPLLB_ATB1_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_ANA_MPLLB_ATB1_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_ANA_MPLLB_ATB1_RESERVED_15_8(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_MPLLB_ATB1_RESERVED_15_8_SHIFT)) & X2_SUPX_ANA_MPLLB_ATB1_RESERVED_15_8_MASK)
/*! @} */

