zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_ANA_RTUNE_CTRL_rt_sel_atbp_MASK  (0x2U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_sel_atbp_SHIFT (1U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_sel_atbp_WIDTH (1U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_sel_atbp(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_RTUNE_CTRL_rt_sel_atbp_SHIFT)) & X2_SUPX_ANA_RTUNE_CTRL_rt_sel_atbp_MASK)

#define X2_SUPX_ANA_RTUNE_CTRL_rt_atb_MASK       (0x4U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_atb_SHIFT      (2U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_atb_WIDTH      (1U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_atb(x)         (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_RTUNE_CTRL_rt_atb_SHIFT)) & X2_SUPX_ANA_RTUNE_CTRL_rt_atb_MASK)

#define X2_SUPX_ANA_RTUNE_CTRL_rt_dac_chop_MASK  (0x8U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_dac_chop_SHIFT (3U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_dac_chop_WIDTH (1U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_dac_chop(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_RTUNE_CTRL_rt_dac_chop_SHIFT)) & X2_SUPX_ANA_RTUNE_CTRL_rt_dac_chop_MASK)

#define X2_SUPX_ANA_RTUNE_CTRL_rt_dac_mode_MASK  (0x30U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_dac_mode_SHIFT (4U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_dac_mode_WIDTH (2U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_dac_mode(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_RTUNE_CTRL_rt_dac_mode_SHIFT)) & X2_SUPX_ANA_RTUNE_CTRL_rt_dac_mode_MASK)

#define X2_SUPX_ANA_RTUNE_CTRL_NC6_MASK          (0x40U)
#define X2_SUPX_ANA_RTUNE_CTRL_NC6_SHIFT         (6U)
#define X2_SUPX_ANA_RTUNE_CTRL_NC6_WIDTH         (1U)
#define X2_SUPX_ANA_RTUNE_CTRL_NC6(x)            (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_RTUNE_CTRL_NC6_SHIFT)) & X2_SUPX_ANA_RTUNE_CTRL_NC6_MASK)

#define X2_SUPX_ANA_RTUNE_CTRL_rt_en_frcon_MASK  (0x80U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_en_frcon_SHIFT (7U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_en_frcon_WIDTH (1U)
#define X2_SUPX_ANA_RTUNE_CTRL_rt_en_frcon(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_RTUNE_CTRL_rt_en_frcon_SHIFT)) & X2_SUPX_ANA_RTUNE_CTRL_rt_en_frcon_MASK)

#define X2_SUPX_ANA_RTUNE_CTRL_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_ANA_RTUNE_CTRL_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_ANA_RTUNE_CTRL_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_ANA_RTUNE_CTRL_RESERVED_15_8(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_RTUNE_CTRL_RESERVED_15_8_SHIFT)) & X2_SUPX_ANA_RTUNE_CTRL_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_ANA_SWITCH_PWR_MEAS - SWITCH_PWR_MEAS */
/*! @{ */

#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_bias_ref_MASK (0x1U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_bias_ref_SHIFT (0U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_bias_ref_WIDTH (1U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_bias_ref(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_bias_ref_SHIFT)) & X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_bias_ref_MASK)

#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vph_MASK (0x2U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vph_SHIFT (1U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vph_WIDTH (1U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vph(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vph_SHIFT)) & X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vph_MASK)

#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_vref_MASK (0x4U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_vref_SHIFT (2U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_vref_WIDTH (1U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_vref(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_vref_SHIFT)) & X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vbg_vref_MASK)

#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vp_MASK (0x8U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vp_SHIFT (3U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vp_WIDTH (1U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vp(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vp_SHIFT)) & X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_vp_MASK)

#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_gd_MASK (0x10U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_gd_SHIFT (4U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_gd_WIDTH (1U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_gd(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_gd_SHIFT)) & X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_gd_MASK)

#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_half_vph_MASK (0x20U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_half_vph_SHIFT (5U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_half_vph_WIDTH (1U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_half_vph(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_half_vph_SHIFT)) & X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_half_vph_MASK)

#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_MASK  (0x40U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_SHIFT (6U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_WIDTH (1U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_SHIFT)) & X2_SUPX_ANA_SWITCH_PWR_MEAS_atb_sw_MASK)

#define X2_SUPX_ANA_SWITCH_PWR_MEAS_NC7_MASK     (0x80U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_NC7_SHIFT    (7U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_NC7_WIDTH    (1U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_NC7(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_PWR_MEAS_NC7_SHIFT)) & X2_SUPX_ANA_SWITCH_PWR_MEAS_NC7_MASK)

#define X2_SUPX_ANA_SWITCH_PWR_MEAS_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_ANA_SWITCH_PWR_MEAS_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_PWR_MEAS_RESERVED_15_8_SHIFT)) & X2_SUPX_ANA_SWITCH_PWR_MEAS_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_ANA_SWITCH_MISC_MEAS - SWITCH_MISC_MEAS */
/*! @{ */

#define X2_SUPX_ANA_SWITCH_MISC_MEAS_hyst_ref_MASK (0x3U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_hyst_ref_SHIFT (0U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_hyst_ref_WIDTH (2U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_hyst_ref(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_MISC_MEAS_hyst_ref_SHIFT)) & X2_SUPX_ANA_SWITCH_MISC_MEAS_hyst_ref_MASK)

#define X2_SUPX_ANA_SWITCH_MISC_MEAS_sel_vpll_ref_MASK (0xCU)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_sel_vpll_ref_SHIFT (2U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_sel_vpll_ref_WIDTH (2U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_sel_vpll_ref(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_MISC_MEAS_sel_vpll_ref_SHIFT)) & X2_SUPX_ANA_SWITCH_MISC_MEAS_sel_vpll_ref_MASK)

#define X2_SUPX_ANA_SWITCH_MISC_MEAS_NC4_MASK    (0x10U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_NC4_SHIFT   (4U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_NC4_WIDTH   (1U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_NC4(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_MISC_MEAS_NC4_SHIFT)) & X2_SUPX_ANA_SWITCH_MISC_MEAS_NC4_MASK)

#define X2_SUPX_ANA_SWITCH_MISC_MEAS_temp_meas_MASK (0x20U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_temp_meas_SHIFT (5U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_temp_meas_WIDTH (1U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_temp_meas(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_MISC_MEAS_temp_meas_SHIFT)) & X2_SUPX_ANA_SWITCH_MISC_MEAS_temp_meas_MASK)

#define X2_SUPX_ANA_SWITCH_MISC_MEAS_NC7_6_MASK  (0xC0U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_NC7_6_SHIFT (6U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_NC7_6_WIDTH (2U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_NC7_6(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_MISC_MEAS_NC7_6_SHIFT)) & X2_SUPX_ANA_SWITCH_MISC_MEAS_NC7_6_MASK)

#define X2_SUPX_ANA_SWITCH_MISC_MEAS_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_ANA_SWITCH_MISC_MEAS_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_SWITCH_MISC_MEAS_RESERVED_15_8_SHIFT)) & X2_SUPX_ANA_SWITCH_MISC_MEAS_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_ANA_BG - BG */
/*! @{ */

#define X2_SUPX_ANA_BG_bypass_bg_MASK            (0x1U)
#define X2_SUPX_ANA_BG_bypass_bg_SHIFT           (0U)
#define X2_SUPX_ANA_BG_bypass_bg_WIDTH           (1U)
#define X2_SUPX_ANA_BG_bypass_bg(x)              (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_BG_bypass_bg_SHIFT)) & X2_SUPX_ANA_BG_bypass_bg_MASK)

#define X2_SUPX_ANA_BG_sel_vbg_vref_MASK         (0x6U)
#define X2_SUPX_ANA_BG_sel_vbg_vref_SHIFT        (1U)
#define X2_SUPX_ANA_BG_sel_vbg_vref_WIDTH        (2U)
#define X2_SUPX_ANA_BG_sel_vbg_vref(x)           (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_BG_sel_vbg_vref_SHIFT)) & X2_SUPX_ANA_BG_sel_vbg_vref_MASK)

