zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_ANA_BG_chop_en_MASK              (0x8U)
#define X2_SUPX_ANA_BG_chop_en_SHIFT             (3U)
#define X2_SUPX_ANA_BG_chop_en_WIDTH             (1U)
#define X2_SUPX_ANA_BG_chop_en(x)                (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_BG_chop_en_SHIFT)) & X2_SUPX_ANA_BG_chop_en_MASK)

#define X2_SUPX_ANA_BG_por_start_kick_en_MASK    (0x10U)
#define X2_SUPX_ANA_BG_por_start_kick_en_SHIFT   (4U)
#define X2_SUPX_ANA_BG_por_start_kick_en_WIDTH   (1U)
#define X2_SUPX_ANA_BG_por_start_kick_en(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_BG_por_start_kick_en_SHIFT)) & X2_SUPX_ANA_BG_por_start_kick_en_MASK)

#define X2_SUPX_ANA_BG_NC7_5_MASK                (0xE0U)
#define X2_SUPX_ANA_BG_NC7_5_SHIFT               (5U)
#define X2_SUPX_ANA_BG_NC7_5_WIDTH               (3U)
#define X2_SUPX_ANA_BG_NC7_5(x)                  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_BG_NC7_5_SHIFT)) & X2_SUPX_ANA_BG_NC7_5_MASK)

#define X2_SUPX_ANA_BG_RESERVED_15_8_MASK        (0xFF00U)
#define X2_SUPX_ANA_BG_RESERVED_15_8_SHIFT       (8U)
#define X2_SUPX_ANA_BG_RESERVED_15_8_WIDTH       (8U)
#define X2_SUPX_ANA_BG_RESERVED_15_8(x)          (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_BG_RESERVED_15_8_SHIFT)) & X2_SUPX_ANA_BG_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_ANA_PRESCALER_CTRL - PRESCALER_CTRL */
/*! @{ */

#define X2_SUPX_ANA_PRESCALER_CTRL_meas_vreg_MASK (0x1U)
#define X2_SUPX_ANA_PRESCALER_CTRL_meas_vreg_SHIFT (0U)
#define X2_SUPX_ANA_PRESCALER_CTRL_meas_vreg_WIDTH (1U)
#define X2_SUPX_ANA_PRESCALER_CTRL_meas_vreg(x)  (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_PRESCALER_CTRL_meas_vreg_SHIFT)) & X2_SUPX_ANA_PRESCALER_CTRL_meas_vreg_MASK)

#define X2_SUPX_ANA_PRESCALER_CTRL_NC1_MASK      (0x2U)
#define X2_SUPX_ANA_PRESCALER_CTRL_NC1_SHIFT     (1U)
#define X2_SUPX_ANA_PRESCALER_CTRL_NC1_WIDTH     (1U)
#define X2_SUPX_ANA_PRESCALER_CTRL_NC1(x)        (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_PRESCALER_CTRL_NC1_SHIFT)) & X2_SUPX_ANA_PRESCALER_CTRL_NC1_MASK)

#define X2_SUPX_ANA_PRESCALER_CTRL_atb_select_MASK (0x4U)
#define X2_SUPX_ANA_PRESCALER_CTRL_atb_select_SHIFT (2U)
#define X2_SUPX_ANA_PRESCALER_CTRL_atb_select_WIDTH (1U)
#define X2_SUPX_ANA_PRESCALER_CTRL_atb_select(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_PRESCALER_CTRL_atb_select_SHIFT)) & X2_SUPX_ANA_PRESCALER_CTRL_atb_select_MASK)

#define X2_SUPX_ANA_PRESCALER_CTRL_NC7_3_MASK    (0xF8U)
#define X2_SUPX_ANA_PRESCALER_CTRL_NC7_3_SHIFT   (3U)
#define X2_SUPX_ANA_PRESCALER_CTRL_NC7_3_WIDTH   (5U)
#define X2_SUPX_ANA_PRESCALER_CTRL_NC7_3(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_PRESCALER_CTRL_NC7_3_SHIFT)) & X2_SUPX_ANA_PRESCALER_CTRL_NC7_3_MASK)

#define X2_SUPX_ANA_PRESCALER_CTRL_RESERVED_15_8_MASK (0xFF00U)
#define X2_SUPX_ANA_PRESCALER_CTRL_RESERVED_15_8_SHIFT (8U)
#define X2_SUPX_ANA_PRESCALER_CTRL_RESERVED_15_8_WIDTH (8U)
#define X2_SUPX_ANA_PRESCALER_CTRL_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_ANA_PRESCALER_CTRL_RESERVED_15_8_SHIFT)) & X2_SUPX_ANA_PRESCALER_CTRL_RESERVED_15_8_MASK)
/*! @} */

/*! @name SUPX_DIG_RTUNE_DEBUG - Resistor tuning debug controls */
/*! @{ */

#define X2_SUPX_DIG_RTUNE_DEBUG_FLIP_COMP_MASK   (0x1U)
#define X2_SUPX_DIG_RTUNE_DEBUG_FLIP_COMP_SHIFT  (0U)
#define X2_SUPX_DIG_RTUNE_DEBUG_FLIP_COMP_WIDTH  (1U)
#define X2_SUPX_DIG_RTUNE_DEBUG_FLIP_COMP(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_DEBUG_FLIP_COMP_SHIFT)) & X2_SUPX_DIG_RTUNE_DEBUG_FLIP_COMP_MASK)

#define X2_SUPX_DIG_RTUNE_DEBUG_MAN_TUNE_MASK    (0x2U)
#define X2_SUPX_DIG_RTUNE_DEBUG_MAN_TUNE_SHIFT   (1U)
#define X2_SUPX_DIG_RTUNE_DEBUG_MAN_TUNE_WIDTH   (1U)
#define X2_SUPX_DIG_RTUNE_DEBUG_MAN_TUNE(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_DEBUG_MAN_TUNE_SHIFT)) & X2_SUPX_DIG_RTUNE_DEBUG_MAN_TUNE_MASK)

#define X2_SUPX_DIG_RTUNE_DEBUG_SET_VAL_MASK     (0x4U)
#define X2_SUPX_DIG_RTUNE_DEBUG_SET_VAL_SHIFT    (2U)
#define X2_SUPX_DIG_RTUNE_DEBUG_SET_VAL_WIDTH    (1U)
#define X2_SUPX_DIG_RTUNE_DEBUG_SET_VAL(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_DEBUG_SET_VAL_SHIFT)) & X2_SUPX_DIG_RTUNE_DEBUG_SET_VAL_MASK)

#define X2_SUPX_DIG_RTUNE_DEBUG_TYPE_MASK        (0x18U)
#define X2_SUPX_DIG_RTUNE_DEBUG_TYPE_SHIFT       (3U)
#define X2_SUPX_DIG_RTUNE_DEBUG_TYPE_WIDTH       (2U)
#define X2_SUPX_DIG_RTUNE_DEBUG_TYPE(x)          (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_DEBUG_TYPE_SHIFT)) & X2_SUPX_DIG_RTUNE_DEBUG_TYPE_MASK)

#define X2_SUPX_DIG_RTUNE_DEBUG_VALUE_MASK       (0x7FE0U)
#define X2_SUPX_DIG_RTUNE_DEBUG_VALUE_SHIFT      (5U)
#define X2_SUPX_DIG_RTUNE_DEBUG_VALUE_WIDTH      (10U)
#define X2_SUPX_DIG_RTUNE_DEBUG_VALUE(x)         (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_DEBUG_VALUE_SHIFT)) & X2_SUPX_DIG_RTUNE_DEBUG_VALUE_MASK)

#define X2_SUPX_DIG_RTUNE_DEBUG_TXUP_GO_MASK     (0x8000U)
#define X2_SUPX_DIG_RTUNE_DEBUG_TXUP_GO_SHIFT    (15U)
#define X2_SUPX_DIG_RTUNE_DEBUG_TXUP_GO_WIDTH    (1U)
#define X2_SUPX_DIG_RTUNE_DEBUG_TXUP_GO(x)       (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_DEBUG_TXUP_GO_SHIFT)) & X2_SUPX_DIG_RTUNE_DEBUG_TXUP_GO_MASK)
/*! @} */

/*! @name SUPX_DIG_RTUNE_CONFIG - Configure Rtune Operation */
/*! @{ */

#define X2_SUPX_DIG_RTUNE_CONFIG_RX_CAL_EN_MASK  (0x1U)
#define X2_SUPX_DIG_RTUNE_CONFIG_RX_CAL_EN_SHIFT (0U)
#define X2_SUPX_DIG_RTUNE_CONFIG_RX_CAL_EN_WIDTH (1U)
#define X2_SUPX_DIG_RTUNE_CONFIG_RX_CAL_EN(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_CONFIG_RX_CAL_EN_SHIFT)) & X2_SUPX_DIG_RTUNE_CONFIG_RX_CAL_EN_MASK)

#define X2_SUPX_DIG_RTUNE_CONFIG_FAST_RTUNE_MASK (0x2U)
#define X2_SUPX_DIG_RTUNE_CONFIG_FAST_RTUNE_SHIFT (1U)
#define X2_SUPX_DIG_RTUNE_CONFIG_FAST_RTUNE_WIDTH (1U)
#define X2_SUPX_DIG_RTUNE_CONFIG_FAST_RTUNE(x)   (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_CONFIG_FAST_RTUNE_SHIFT)) & X2_SUPX_DIG_RTUNE_CONFIG_FAST_RTUNE_MASK)

#define X2_SUPX_DIG_RTUNE_CONFIG_TX_CAL_EN_MASK  (0x4U)
#define X2_SUPX_DIG_RTUNE_CONFIG_TX_CAL_EN_SHIFT (2U)
#define X2_SUPX_DIG_RTUNE_CONFIG_TX_CAL_EN_WIDTH (1U)
#define X2_SUPX_DIG_RTUNE_CONFIG_TX_CAL_EN(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_CONFIG_TX_CAL_EN_SHIFT)) & X2_SUPX_DIG_RTUNE_CONFIG_TX_CAL_EN_MASK)

#define X2_SUPX_DIG_RTUNE_CONFIG_SUP_ANA_TERM_CTRL_MASK (0x38U)
#define X2_SUPX_DIG_RTUNE_CONFIG_SUP_ANA_TERM_CTRL_SHIFT (3U)
#define X2_SUPX_DIG_RTUNE_CONFIG_SUP_ANA_TERM_CTRL_WIDTH (3U)
#define X2_SUPX_DIG_RTUNE_CONFIG_SUP_ANA_TERM_CTRL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_CONFIG_SUP_ANA_TERM_CTRL_SHIFT)) & X2_SUPX_DIG_RTUNE_CONFIG_SUP_ANA_TERM_CTRL_MASK)

