zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_RTUNE_CONFIG_RESERVED_15_6_MASK (0xFFC0U)
#define X2_SUPX_DIG_RTUNE_CONFIG_RESERVED_15_6_SHIFT (6U)
#define X2_SUPX_DIG_RTUNE_CONFIG_RESERVED_15_6_WIDTH (10U)
#define X2_SUPX_DIG_RTUNE_CONFIG_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_CONFIG_RESERVED_15_6_SHIFT)) & X2_SUPX_DIG_RTUNE_CONFIG_RESERVED_15_6_MASK)
/*! @} */

/*! @name SUPX_DIG_RTUNE_STAT - Resistor tuning register status */
/*! @{ */

#define X2_SUPX_DIG_RTUNE_STAT_STAT_MASK         (0x3FFU)
#define X2_SUPX_DIG_RTUNE_STAT_STAT_SHIFT        (0U)
#define X2_SUPX_DIG_RTUNE_STAT_STAT_WIDTH        (10U)
#define X2_SUPX_DIG_RTUNE_STAT_STAT(x)           (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_STAT_STAT_SHIFT)) & X2_SUPX_DIG_RTUNE_STAT_STAT_MASK)

#define X2_SUPX_DIG_RTUNE_STAT_DTB_RTUNE_MASK    (0xC00U)
#define X2_SUPX_DIG_RTUNE_STAT_DTB_RTUNE_SHIFT   (10U)
#define X2_SUPX_DIG_RTUNE_STAT_DTB_RTUNE_WIDTH   (2U)
#define X2_SUPX_DIG_RTUNE_STAT_DTB_RTUNE(x)      (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_STAT_DTB_RTUNE_SHIFT)) & X2_SUPX_DIG_RTUNE_STAT_DTB_RTUNE_MASK)

#define X2_SUPX_DIG_RTUNE_STAT_RESERVED_15_12_MASK (0xF000U)
#define X2_SUPX_DIG_RTUNE_STAT_RESERVED_15_12_SHIFT (12U)
#define X2_SUPX_DIG_RTUNE_STAT_RESERVED_15_12_WIDTH (4U)
#define X2_SUPX_DIG_RTUNE_STAT_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_STAT_RESERVED_15_12_SHIFT)) & X2_SUPX_DIG_RTUNE_STAT_RESERVED_15_12_MASK)
/*! @} */

/*! @name SUPX_DIG_RTUNE_RX_SET_VAL - Set value of RX Resistor */
/*! @{ */

#define X2_SUPX_DIG_RTUNE_RX_SET_VAL_RX_SET_VAL_MASK (0x3FU)
#define X2_SUPX_DIG_RTUNE_RX_SET_VAL_RX_SET_VAL_SHIFT (0U)
#define X2_SUPX_DIG_RTUNE_RX_SET_VAL_RX_SET_VAL_WIDTH (6U)
#define X2_SUPX_DIG_RTUNE_RX_SET_VAL_RX_SET_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_RX_SET_VAL_RX_SET_VAL_SHIFT)) & X2_SUPX_DIG_RTUNE_RX_SET_VAL_RX_SET_VAL_MASK)

#define X2_SUPX_DIG_RTUNE_RX_SET_VAL_RESERVED_15_6_MASK (0xFFC0U)
#define X2_SUPX_DIG_RTUNE_RX_SET_VAL_RESERVED_15_6_SHIFT (6U)
#define X2_SUPX_DIG_RTUNE_RX_SET_VAL_RESERVED_15_6_WIDTH (10U)
#define X2_SUPX_DIG_RTUNE_RX_SET_VAL_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_RX_SET_VAL_RESERVED_15_6_SHIFT)) & X2_SUPX_DIG_RTUNE_RX_SET_VAL_RESERVED_15_6_MASK)
/*! @} */

/*! @name SUPX_DIG_RTUNE_TXDN_SET_VAL - Set value of TX-DN Resistor */
/*! @{ */

#define X2_SUPX_DIG_RTUNE_TXDN_SET_VAL_TXDN_SET_VAL_MASK (0x3FFU)
#define X2_SUPX_DIG_RTUNE_TXDN_SET_VAL_TXDN_SET_VAL_SHIFT (0U)
#define X2_SUPX_DIG_RTUNE_TXDN_SET_VAL_TXDN_SET_VAL_WIDTH (10U)
#define X2_SUPX_DIG_RTUNE_TXDN_SET_VAL_TXDN_SET_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_TXDN_SET_VAL_TXDN_SET_VAL_SHIFT)) & X2_SUPX_DIG_RTUNE_TXDN_SET_VAL_TXDN_SET_VAL_MASK)

#define X2_SUPX_DIG_RTUNE_TXDN_SET_VAL_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUPX_DIG_RTUNE_TXDN_SET_VAL_RESERVED_15_10_SHIFT (10U)
#define X2_SUPX_DIG_RTUNE_TXDN_SET_VAL_RESERVED_15_10_WIDTH (6U)
#define X2_SUPX_DIG_RTUNE_TXDN_SET_VAL_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_TXDN_SET_VAL_RESERVED_15_10_SHIFT)) & X2_SUPX_DIG_RTUNE_TXDN_SET_VAL_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUPX_DIG_RTUNE_TXUP_SET_VAL - Set value of TX-UP Resistor */
/*! @{ */

#define X2_SUPX_DIG_RTUNE_TXUP_SET_VAL_TXUP_SET_VAL_MASK (0x3FFU)
#define X2_SUPX_DIG_RTUNE_TXUP_SET_VAL_TXUP_SET_VAL_SHIFT (0U)
#define X2_SUPX_DIG_RTUNE_TXUP_SET_VAL_TXUP_SET_VAL_WIDTH (10U)
#define X2_SUPX_DIG_RTUNE_TXUP_SET_VAL_TXUP_SET_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_TXUP_SET_VAL_TXUP_SET_VAL_SHIFT)) & X2_SUPX_DIG_RTUNE_TXUP_SET_VAL_TXUP_SET_VAL_MASK)

#define X2_SUPX_DIG_RTUNE_TXUP_SET_VAL_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUPX_DIG_RTUNE_TXUP_SET_VAL_RESERVED_15_10_SHIFT (10U)
#define X2_SUPX_DIG_RTUNE_TXUP_SET_VAL_RESERVED_15_10_WIDTH (6U)
#define X2_SUPX_DIG_RTUNE_TXUP_SET_VAL_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_TXUP_SET_VAL_RESERVED_15_10_SHIFT)) & X2_SUPX_DIG_RTUNE_TXUP_SET_VAL_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUPX_DIG_RTUNE_RX_STAT - RX Resistor tuning register status */
/*! @{ */

#define X2_SUPX_DIG_RTUNE_RX_STAT_RX_STAT_MASK   (0x3FU)
#define X2_SUPX_DIG_RTUNE_RX_STAT_RX_STAT_SHIFT  (0U)
#define X2_SUPX_DIG_RTUNE_RX_STAT_RX_STAT_WIDTH  (6U)
#define X2_SUPX_DIG_RTUNE_RX_STAT_RX_STAT(x)     (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_RX_STAT_RX_STAT_SHIFT)) & X2_SUPX_DIG_RTUNE_RX_STAT_RX_STAT_MASK)

#define X2_SUPX_DIG_RTUNE_RX_STAT_RESERVED_15_6_MASK (0xFFC0U)
#define X2_SUPX_DIG_RTUNE_RX_STAT_RESERVED_15_6_SHIFT (6U)
#define X2_SUPX_DIG_RTUNE_RX_STAT_RESERVED_15_6_WIDTH (10U)
#define X2_SUPX_DIG_RTUNE_RX_STAT_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_RX_STAT_RESERVED_15_6_SHIFT)) & X2_SUPX_DIG_RTUNE_RX_STAT_RESERVED_15_6_MASK)
/*! @} */

/*! @name SUPX_DIG_RTUNE_TXDN_STAT - TX-DN Resistor tuning register status */
/*! @{ */

#define X2_SUPX_DIG_RTUNE_TXDN_STAT_TXDN_STAT_MASK (0x3FFU)
#define X2_SUPX_DIG_RTUNE_TXDN_STAT_TXDN_STAT_SHIFT (0U)
#define X2_SUPX_DIG_RTUNE_TXDN_STAT_TXDN_STAT_WIDTH (10U)
#define X2_SUPX_DIG_RTUNE_TXDN_STAT_TXDN_STAT(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_TXDN_STAT_TXDN_STAT_SHIFT)) & X2_SUPX_DIG_RTUNE_TXDN_STAT_TXDN_STAT_MASK)

#define X2_SUPX_DIG_RTUNE_TXDN_STAT_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUPX_DIG_RTUNE_TXDN_STAT_RESERVED_15_10_SHIFT (10U)
#define X2_SUPX_DIG_RTUNE_TXDN_STAT_RESERVED_15_10_WIDTH (6U)
#define X2_SUPX_DIG_RTUNE_TXDN_STAT_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_TXDN_STAT_RESERVED_15_10_SHIFT)) & X2_SUPX_DIG_RTUNE_TXDN_STAT_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUPX_DIG_RTUNE_TXUP_STAT - TX-UP Resistor tuning register status */
/*! @{ */

#define X2_SUPX_DIG_RTUNE_TXUP_STAT_TXUP_STAT_MASK (0x3FFU)
#define X2_SUPX_DIG_RTUNE_TXUP_STAT_TXUP_STAT_SHIFT (0U)
#define X2_SUPX_DIG_RTUNE_TXUP_STAT_TXUP_STAT_WIDTH (10U)
#define X2_SUPX_DIG_RTUNE_TXUP_STAT_TXUP_STAT(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_TXUP_STAT_TXUP_STAT_SHIFT)) & X2_SUPX_DIG_RTUNE_TXUP_STAT_TXUP_STAT_MASK)

