zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_RTUNE_TXUP_STAT_RESERVED_15_10_MASK (0xFC00U)
#define X2_SUPX_DIG_RTUNE_TXUP_STAT_RESERVED_15_10_SHIFT (10U)
#define X2_SUPX_DIG_RTUNE_TXUP_STAT_RESERVED_15_10_WIDTH (6U)
#define X2_SUPX_DIG_RTUNE_TXUP_STAT_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_RTUNE_TXUP_STAT_RESERVED_15_10_SHIFT)) & X2_SUPX_DIG_RTUNE_TXUP_STAT_RESERVED_15_10_MASK)
/*! @} */

/*! @name SUPX_DIG_ANA_MPLLA_OVRD_OUT - Override value for mplla signals going to ANA */
/*! @{ */

#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_ANA_EN_MASK (0x1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_ANA_EN_SHIFT (0U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_ANA_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_ANA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_ANA_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_ANA_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_RST_MASK (0x2U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_RST_SHIFT (1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_RST_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_RST_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_RST_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_CAL_MASK (0x4U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_CAL_SHIFT (2U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_CAL_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_CAL_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_CAL_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_EN_MASK (0x8U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_EN_SHIFT (3U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_L_EN_MASK (0x10U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_L_EN_SHIFT (4U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_L_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_L_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_L_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_L_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_R_EN_MASK (0x20U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_R_EN_SHIFT (5U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_R_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_R_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_R_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_OUTPUT_R_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV8_CLK_EN_MASK (0x40U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV8_CLK_EN_SHIFT (6U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV8_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV8_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV8_CLK_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV8_CLK_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV10_CLK_EN_MASK (0x80U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV10_CLK_EN_SHIFT (7U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV10_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV10_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV10_CLK_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV10_CLK_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_FBCLK_EN_MASK (0x100U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_FBCLK_EN_SHIFT (8U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_FBCLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_FBCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_FBCLK_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_FBCLK_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_MASK (0x1E00U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_SHIFT (9U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_WIDTH (4U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV_CLK_EN_MASK (0x2000U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV_CLK_EN_SHIFT (13U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV_CLK_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_MPLLA_DIV_CLK_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_OVRD_SEL_MASK (0x4000U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_OVRD_SEL_SHIFT (14U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_OVRD_SEL_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_OVRD_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_OVRD_SEL_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_OVRD_SEL_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_15_15_MASK (0x8000U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_15_15_SHIFT (15U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_15_15_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_15_15_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_OVRD_OUT_RESERVED_15_15_MASK)
/*! @} */

/*! @name SUPX_DIG_ANA_MPLLB_OVRD_OUT - Override value for mpllb signals going to ANA */
/*! @{ */

#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_ANA_EN_MASK (0x1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_ANA_EN_SHIFT (0U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_ANA_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_ANA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_ANA_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_ANA_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_RST_MASK (0x2U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_RST_SHIFT (1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_RST_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_RST_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_RST_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_CAL_MASK (0x4U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_CAL_SHIFT (2U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_CAL_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_CAL_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_CAL_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_EN_MASK (0x8U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_EN_SHIFT (3U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_L_EN_MASK (0x10U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_L_EN_SHIFT (4U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_L_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_L_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_L_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_L_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_R_EN_MASK (0x20U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_R_EN_SHIFT (5U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_R_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_R_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_R_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_OUTPUT_R_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV8_CLK_EN_MASK (0x40U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV8_CLK_EN_SHIFT (6U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV8_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV8_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV8_CLK_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV8_CLK_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV10_CLK_EN_MASK (0x80U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV10_CLK_EN_SHIFT (7U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV10_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV10_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV10_CLK_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV10_CLK_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_FBCLK_EN_MASK (0x100U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_FBCLK_EN_SHIFT (8U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_FBCLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_FBCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_FBCLK_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_FBCLK_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_RESERVED_MASK (0x1E00U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_RESERVED_SHIFT (9U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_RESERVED_WIDTH (4U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_RESERVED_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_RESERVED_MASK)

