zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV_CLK_EN_MASK (0x2000U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV_CLK_EN_SHIFT (13U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV_CLK_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV_CLK_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_MPLLB_DIV_CLK_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_OVRD_SEL_MASK (0x4000U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_OVRD_SEL_SHIFT (14U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_OVRD_SEL_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_OVRD_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_OVRD_SEL_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_OVRD_SEL_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_RESERVED_15_15_MASK (0x8000U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_RESERVED_15_15_SHIFT (15U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_RESERVED_15_15_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_RESERVED_15_15_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_OVRD_OUT_RESERVED_15_15_MASK)
/*! @} */

/*! @name SUPX_DIG_ANA_RTUNE_OVRD_OUT - Override value for RTUNE signals going to ANA */
/*! @{ */

#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_COMP_RST_MASK (0x1U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_COMP_RST_SHIFT (0U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_COMP_RST_WIDTH (1U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_COMP_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_COMP_RST_SHIFT)) & X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_COMP_RST_MASK)

#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_MODE_MASK (0x6U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_MODE_SHIFT (1U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_MODE_WIDTH (2U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_MODE_SHIFT)) & X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_MODE_MASK)

#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_EN_MASK (0x8U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_EN_SHIFT (3U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_EN_SHIFT)) & X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_EN_MASK)

#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_VALUE_MASK (0x3FF0U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_VALUE_SHIFT (4U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_VALUE_WIDTH (10U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_VALUE(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_VALUE_SHIFT)) & X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_VALUE_MASK)

#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_OVRD_EN_MASK (0x4000U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_OVRD_EN_SHIFT (14U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_OVRD_EN_SHIFT)) & X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RTUNE_OVRD_EN_MASK)

#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RESERVED_15_15_MASK (0x8000U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RESERVED_15_15_SHIFT (15U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RESERVED_15_15_WIDTH (1U)
#define X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RESERVED_15_15_SHIFT)) & X2_SUPX_DIG_ANA_RTUNE_OVRD_OUT_RESERVED_15_15_MASK)
/*! @} */

/*! @name SUPX_DIG_ANA_STAT - SUP input status register for SUP ANA outputs */
/*! @{ */

#define X2_SUPX_DIG_ANA_STAT_RT_ANA_COMP_RESULT_MASK (0x1U)
#define X2_SUPX_DIG_ANA_STAT_RT_ANA_COMP_RESULT_SHIFT (0U)
#define X2_SUPX_DIG_ANA_STAT_RT_ANA_COMP_RESULT_WIDTH (1U)
#define X2_SUPX_DIG_ANA_STAT_RT_ANA_COMP_RESULT(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_STAT_RT_ANA_COMP_RESULT_SHIFT)) & X2_SUPX_DIG_ANA_STAT_RT_ANA_COMP_RESULT_MASK)

#define X2_SUPX_DIG_ANA_STAT_RESERVED_15_1_MASK  (0xFFFEU)
#define X2_SUPX_DIG_ANA_STAT_RESERVED_15_1_SHIFT (1U)
#define X2_SUPX_DIG_ANA_STAT_RESERVED_15_1_WIDTH (15U)
#define X2_SUPX_DIG_ANA_STAT_RESERVED_15_1(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_STAT_RESERVED_15_1_SHIFT)) & X2_SUPX_DIG_ANA_STAT_RESERVED_15_1_MASK)
/*! @} */

/*! @name SUPX_DIG_ANA_ANA_OVRD_OUT - Override values for ana_async_rst and bandgap signals going to ANA */
/*! @{ */

#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_FAST_START_MASK (0x1U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_FAST_START_SHIFT (0U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_FAST_START_WIDTH (1U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_FAST_START(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_FAST_START_SHIFT)) & X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_FAST_START_MASK)

#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_EN_MASK  (0x2U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_EN_SHIFT (1U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_EN(x)    (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_EN_SHIFT)) & X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_EN_MASK)

#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_OVRD_EN_MASK (0x4U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_OVRD_EN_SHIFT (2U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_OVRD_EN_SHIFT)) & X2_SUPX_DIG_ANA_ANA_OVRD_OUT_BG_OVRD_EN_MASK)

#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_ANA_ASYNC_RST_MASK (0x8U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_ANA_ASYNC_RST_SHIFT (3U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_ANA_ASYNC_RST_WIDTH (1U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_ANA_ASYNC_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_ANA_OVRD_OUT_ANA_ASYNC_RST_SHIFT)) & X2_SUPX_DIG_ANA_ANA_OVRD_OUT_ANA_ASYNC_RST_MASK)

#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_ANA_ASYNC_RST_OVRD_EN_MASK (0x10U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_ANA_ASYNC_RST_OVRD_EN_SHIFT (4U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_ANA_ASYNC_RST_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_ANA_ASYNC_RST_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_ANA_OVRD_OUT_ANA_ASYNC_RST_OVRD_EN_SHIFT)) & X2_SUPX_DIG_ANA_ANA_OVRD_OUT_ANA_ASYNC_RST_OVRD_EN_MASK)

#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_RESERVED_15_5_MASK (0xFFE0U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_RESERVED_15_5_SHIFT (5U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_RESERVED_15_5_WIDTH (11U)
#define X2_SUPX_DIG_ANA_ANA_OVRD_OUT_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_ANA_OVRD_OUT_RESERVED_15_5_SHIFT)) & X2_SUPX_DIG_ANA_ANA_OVRD_OUT_RESERVED_15_5_MASK)
/*! @} */

/*! @name SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT - Override value for mplla pmix signals going to ANA */
/*! @{ */

