zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_MASK (0xFFU)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_SHIFT (0U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_WIDTH (8U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_MASK (0x100U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_SHIFT (8U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_OVRD_EN_MASK (0x200U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_OVRD_EN_SHIFT (9U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_OVRD_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_SEL_OVRD_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_OVRD_EN_MASK (0x400U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_OVRD_EN_SHIFT (10U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_OVRD_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_MPLLA_PMIX_EN_OVRD_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_RESERVED_15_11_MASK (0xF800U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_RESERVED_15_11_SHIFT (11U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_RESERVED_15_11_WIDTH (5U)
#define X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_RESERVED_15_11_SHIFT)) & X2_SUPX_DIG_ANA_MPLLA_PMIX_OVRD_OUT_RESERVED_15_11_MASK)
/*! @} */

/*! @name SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT - Override value for mpllb pmix signals going to ANA */
/*! @{ */

#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_MASK (0xFFU)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_SHIFT (0U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_WIDTH (8U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_MASK (0x100U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_SHIFT (8U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_OVRD_EN_MASK (0x200U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_OVRD_EN_SHIFT (9U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_OVRD_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_SEL_OVRD_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_OVRD_EN_MASK (0x400U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_OVRD_EN_SHIFT (10U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_OVRD_EN_WIDTH (1U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_OVRD_EN_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_MPLLB_PMIX_EN_OVRD_EN_MASK)

#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_RESERVED_15_11_MASK (0xF800U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_RESERVED_15_11_SHIFT (11U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_RESERVED_15_11_WIDTH (5U)
#define X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_RESERVED_15_11_SHIFT)) & X2_SUPX_DIG_ANA_MPLLB_PMIX_OVRD_OUT_RESERVED_15_11_MASK)
/*! @} */

/*! @name LANEX_DIG_ASIC_LANE_OVRD_IN - Override values for incoming LANE controls from ASIC */
/*! @{ */

#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_LANE_TX2RX_SER_LB_MASK (0x1U)
#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_LANE_TX2RX_SER_LB_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_LANE_TX2RX_SER_LB_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_LANE_TX2RX_SER_LB(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_LANE_OVRD_IN_LANE_TX2RX_SER_LB_SHIFT)) & X2_LANEX_DIG_ASIC_LANE_OVRD_IN_LANE_TX2RX_SER_LB_MASK)

#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_LANE_RX2TX_PAR_LB_MASK (0x2U)
#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_LANE_RX2TX_PAR_LB_SHIFT (1U)
#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_LANE_RX2TX_PAR_LB_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_LANE_RX2TX_PAR_LB(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_LANE_OVRD_IN_LANE_RX2TX_PAR_LB_SHIFT)) & X2_LANEX_DIG_ASIC_LANE_OVRD_IN_LANE_RX2TX_PAR_LB_MASK)

#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_EN_MASK   (0x4U)
#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_EN_SHIFT  (2U)
#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_EN_WIDTH  (1U)
#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_EN(x)     (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_LANE_OVRD_IN_EN_SHIFT)) & X2_LANEX_DIG_ASIC_LANE_OVRD_IN_EN_MASK)

#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_RESERVED_15_3_MASK (0xFFF8U)
#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_RESERVED_15_3_SHIFT (3U)
#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_RESERVED_15_3_WIDTH (13U)
#define X2_LANEX_DIG_ASIC_LANE_OVRD_IN_RESERVED_15_3(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_LANE_OVRD_IN_RESERVED_15_3_SHIFT)) & X2_LANEX_DIG_ASIC_LANE_OVRD_IN_RESERVED_15_3_MASK)
/*! @} */

/*! @name LANEX_DIG_ASIC_TX_OVRD_IN_0 - Override values for incoming TX controls from ASIC, register #0 */
/*! @{ */

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_REQ_MASK  (0x1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_REQ_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_REQ_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_REQ(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_REQ_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_REQ_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_REQ_OVRD_EN_MASK (0x2U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_REQ_OVRD_EN_SHIFT (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_REQ_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_REQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_REQ_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_REQ_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_PSTATE_MASK (0xCU)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_PSTATE_SHIFT (2U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_PSTATE_WIDTH (2U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_PSTATE_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_PSTATE_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_PSTATE_OVRD_EN_MASK (0x10U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_PSTATE_OVRD_EN_SHIFT (4U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_PSTATE_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_PSTATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_PSTATE_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_PSTATE_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_RATE_MASK (0xE0U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_RATE_SHIFT (5U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_RATE_WIDTH (3U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_RATE(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_RATE_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_RATE_MASK)

