zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_RATE_OVRD_EN_MASK (0x100U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_RATE_OVRD_EN_SHIFT (8U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_RATE_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_RATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_RATE_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_RATE_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_WIDTH_MASK (0x600U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_WIDTH_SHIFT (9U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_WIDTH_WIDTH (2U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_WIDTH(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_WIDTH_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_WIDTH_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_WIDTH_OVRD_EN_MASK (0x800U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_WIDTH_OVRD_EN_SHIFT (11U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_WIDTH_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_WIDTH_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_WIDTH_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_WIDTH_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_MASK (0x1000U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_SHIFT (12U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_OVRD_EN_MASK (0x2000U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_OVRD_EN_SHIFT (13U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_MPLLB_SEL_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_MASK (0x4000U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_SHIFT (14U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_DATA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_OVRD_EN_MASK (0x8000U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_OVRD_EN_SHIFT (15U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_0_DATA_EN_OVRD_EN_MASK)
/*! @} */

/*! @name LANEX_DIG_ASIC_TX_OVRD_IN_1 - Override values for incoming TX drive controls from ASIC, register #1 */
/*! @{ */

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_NYQUIST_DATA_MASK (0x1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_NYQUIST_DATA_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_NYQUIST_DATA_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_NYQUIST_DATA(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_NYQUIST_DATA_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_NYQUIST_DATA_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_DISABLE_MASK (0x2U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_DISABLE_SHIFT (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_DISABLE_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_DISABLE_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_DISABLE_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_BEACON_EN_MASK (0x4U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_BEACON_EN_SHIFT (2U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_BEACON_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_BEACON_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_BEACON_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_BEACON_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_IBOOST_LVL_MASK (0x78U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_IBOOST_LVL_SHIFT (3U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_IBOOST_LVL_WIDTH (4U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_IBOOST_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_IBOOST_LVL_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_IBOOST_LVL_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_VBOOST_EN_MASK (0x80U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_VBOOST_EN_SHIFT (7U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_VBOOST_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_VBOOST_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_VBOOST_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_VBOOST_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_EN_MASK   (0x100U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_EN_SHIFT  (8U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_EN_WIDTH  (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_EN(x)     (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_TX_MAIN_CURSOR_MASK (0x7E00U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_TX_MAIN_CURSOR_SHIFT (9U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_TX_MAIN_CURSOR_WIDTH (6U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_TX_MAIN_CURSOR(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_TX_MAIN_CURSOR_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_TX_MAIN_CURSOR_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_MAIN_OVRD_EN_MASK (0x8000U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_MAIN_OVRD_EN_SHIFT (15U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_MAIN_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_MAIN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_MAIN_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_1_MAIN_OVRD_EN_MASK)
/*! @} */

/*! @name LANEX_DIG_ASIC_TX_OVRD_IN_2 - Override values for incoming TX drive controls from ASIC, register #2 */
/*! @{ */

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_TX_PRE_CURSOR_MASK (0x3FU)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_TX_PRE_CURSOR_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_TX_PRE_CURSOR_WIDTH (6U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_TX_PRE_CURSOR(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_TX_PRE_CURSOR_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_TX_PRE_CURSOR_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_PRE_OVRD_EN_MASK (0x40U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_PRE_OVRD_EN_SHIFT (6U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_PRE_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_PRE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_PRE_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_PRE_OVRD_EN_MASK)

