zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_TX_POST_CURSOR_MASK (0x1F80U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_TX_POST_CURSOR_SHIFT (7U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_TX_POST_CURSOR_WIDTH (6U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_TX_POST_CURSOR(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_TX_POST_CURSOR_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_TX_POST_CURSOR_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_POST_OVRD_EN_MASK (0x2000U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_POST_OVRD_EN_SHIFT (13U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_POST_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_POST_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_POST_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_POST_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_RESERVED_15_14_MASK (0xC000U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_RESERVED_15_14_SHIFT (14U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_RESERVED_15_14_WIDTH (2U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_RESERVED_15_14_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_2_RESERVED_15_14_MASK)
/*! @} */

/*! @name LANEX_DIG_ASIC_TX_OVRD_IN_3 - Override values for incoming TX drive controls from ASIC, register #3 */
/*! @{ */

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_MASK (0x1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_OVRD_EN_MASK (0x2U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_OVRD_EN_SHIFT (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_CLK_RDY_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_MASK (0x4U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_SHIFT (2U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_OVRD_EN_MASK (0x8U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_OVRD_EN_SHIFT (3U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_DETECT_RX_REQ_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_INVERT_MASK (0x10U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_INVERT_SHIFT (4U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_INVERT_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_INVERT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_INVERT_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_INVERT_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_INVERT_OVRD_EN_MASK (0x20U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_INVERT_OVRD_EN_SHIFT (5U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_INVERT_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_INVERT_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_INVERT_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_INVERT_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_LPD_MASK  (0x40U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_LPD_SHIFT (6U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_LPD_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_LPD(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_LPD_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_LPD_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_LPD_OVRD_EN_MASK (0x80U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_LPD_OVRD_EN_SHIFT (7U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_LPD_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_LPD_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_LPD_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_LPD_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_RESERVED_15_8_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_3_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_DIG_ASIC_TX_OVRD_IN_4 - Override values for incoming TX drive controls from ASIC, register #4 */
/*! @{ */

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESET_MASK (0x1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESET_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESET_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESET(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESET_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESET_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESET_OVRD_EN_MASK (0x2U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESET_OVRD_EN_SHIFT (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESET_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESET_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESET_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESET_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESERVED_15_2_MASK (0xFFFCU)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESERVED_15_2_SHIFT (2U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESERVED_15_2_WIDTH (14U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESERVED_15_2_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_IN_4_RESERVED_15_2_MASK)
/*! @} */

/*! @name LANEX_DIG_ASIC_TX_OVRD_OUT - Override values for outgoing TX controls to ASIC */
/*! @{ */

#define X2_LANEX_DIG_ASIC_TX_OVRD_OUT_TX_ACK_MASK (0x1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_OUT_TX_ACK_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_OUT_TX_ACK_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_OUT_TX_ACK(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_OUT_TX_ACK_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_OUT_TX_ACK_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_OUT_EN_TX_ACK_MASK (0x2U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_OUT_EN_TX_ACK_SHIFT (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_OUT_EN_TX_ACK_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_OUT_EN_TX_ACK(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_OUT_EN_TX_ACK_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_OUT_EN_TX_ACK_MASK)

#define X2_LANEX_DIG_ASIC_TX_OVRD_OUT_DETRX_RESULT_MASK (0x4U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_OUT_DETRX_RESULT_SHIFT (2U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_OUT_DETRX_RESULT_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_OVRD_OUT_DETRX_RESULT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_OVRD_OUT_DETRX_RESULT_SHIFT)) & X2_LANEX_DIG_ASIC_TX_OVRD_OUT_DETRX_RESULT_MASK)

