zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_1_RX_REF_LD_VAL_6_MASK (0x100U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_1_RX_REF_LD_VAL_6_SHIFT (8U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_1_RX_REF_LD_VAL_6_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_1_RX_REF_LD_VAL_6(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_1_RX_REF_LD_VAL_6_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_1_RX_REF_LD_VAL_6_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_1_RESERVED_15_9_MASK (0xFE00U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_1_RESERVED_15_9_SHIFT (9U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_1_RESERVED_15_9_WIDTH (7U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_1_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_1_RESERVED_15_9_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_1_RESERVED_15_9_MASK)
/*! @} */

/*! @name LANEX_DIG_ASIC_RX_OVRD_IN_2 - Override values for incoming RX controls from ASIC, register #2 */
/*! @{ */

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_RX_VCO_LD_VAL_MASK (0x1FFFU)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_RX_VCO_LD_VAL_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_RX_VCO_LD_VAL_WIDTH (13U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_RX_VCO_LD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_RX_VCO_LD_VAL_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_RX_VCO_LD_VAL_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_EN_MASK   (0x2000U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_EN_SHIFT  (13U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_EN_WIDTH  (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_EN(x)     (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_RESERVED_15_14_MASK (0xC000U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_RESERVED_15_14_SHIFT (14U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_RESERVED_15_14_WIDTH (2U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_RESERVED_15_14_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_2_RESERVED_15_14_MASK)
/*! @} */

/*! @name LANEX_DIG_ASIC_RX_OVRD_IN_3 - Override values for incoming RX controls from ASIC, register #3 */
/*! @{ */

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_TRACK_EN_MASK (0x1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_TRACK_EN_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_TRACK_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_TRACK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_TRACK_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_TRACK_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_TRACK_EN_OVRD_EN_MASK (0x2U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_TRACK_EN_OVRD_EN_SHIFT (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_TRACK_EN_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_TRACK_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_TRACK_EN_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_TRACK_EN_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_SSC_EN_MASK (0x4U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_SSC_EN_SHIFT (2U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_SSC_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_SSC_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_SSC_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_SSC_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_SSC_EN_OVRD_EN_MASK (0x8U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_SSC_EN_OVRD_EN_SHIFT (3U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_SSC_EN_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_SSC_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_SSC_EN_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CDR_SSC_EN_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_ALIGN_EN_MASK (0x10U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_ALIGN_EN_SHIFT (4U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_ALIGN_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_ALIGN_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_ALIGN_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_ALIGN_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_ALIGN_EN_OVRD_EN_MASK (0x20U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_ALIGN_EN_OVRD_EN_SHIFT (5U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_ALIGN_EN_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_ALIGN_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_ALIGN_EN_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_ALIGN_EN_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CLK_SHIFT_MASK (0x40U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CLK_SHIFT_SHIFT (6U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CLK_SHIFT_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CLK_SHIFT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CLK_SHIFT_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CLK_SHIFT_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CLK_SHIFT_OVRD_EN_MASK (0x80U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CLK_SHIFT_OVRD_EN_SHIFT (7U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CLK_SHIFT_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CLK_SHIFT_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CLK_SHIFT_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_CLK_SHIFT_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_DISABLE_MASK (0x100U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_DISABLE_SHIFT (8U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_DISABLE_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_DISABLE_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_DISABLE_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_DISABLE_OVRD_EN_MASK (0x200U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_DISABLE_OVRD_EN_SHIFT (9U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_DISABLE_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_DISABLE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_DISABLE_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_DISABLE_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_THRSHLD_MASK (0x1C00U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_THRSHLD_SHIFT (10U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_THRSHLD_WIDTH (3U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_THRSHLD(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_THRSHLD_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_THRSHLD_MASK)

