zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_LPFS_EN_MASK (0x2000U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_LPFS_EN_SHIFT (13U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_LPFS_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_LPFS_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_LPFS_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_LPFS_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_OVRD_EN_MASK (0x4000U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_OVRD_EN_SHIFT (14U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_LOS_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_RESERVED_15_15_MASK (0x8000U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_RESERVED_15_15_SHIFT (15U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_RESERVED_15_15_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_RESERVED_15_15_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_3_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANEX_DIG_ASIC_RX_OVRD_IN_4 - Override values for incoming RX controls from ASIC, register #4 */
/*! @{ */

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_LPD_MASK  (0x1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_LPD_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_LPD_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_LPD(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_LPD_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_LPD_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_LPD_OVRD_EN_MASK (0x2U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_LPD_OVRD_EN_SHIFT (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_LPD_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_LPD_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_LPD_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_LPD_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_INVERT_MASK (0x4U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_INVERT_SHIFT (2U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_INVERT_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_INVERT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_INVERT_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_INVERT_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_INVERT_OVRD_EN_MASK (0x8U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_INVERT_OVRD_EN_SHIFT (3U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_INVERT_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_INVERT_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_INVERT_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_INVERT_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADAPT_AFE_EN_MASK (0x10U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADAPT_AFE_EN_SHIFT (4U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADAPT_AFE_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADAPT_AFE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADAPT_AFE_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADAPT_AFE_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADAPT_DFE_EN_MASK (0x20U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADAPT_DFE_EN_SHIFT (5U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADAPT_DFE_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADAPT_DFE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADAPT_DFE_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADAPT_DFE_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADPT_OVRD_EN_MASK (0x40U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADPT_OVRD_EN_SHIFT (6U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADPT_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADPT_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADPT_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_ADPT_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_EN_MASK (0x80U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_EN_SHIFT (7U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_ACDC_MASK (0x100U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_ACDC_SHIFT (8U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_ACDC_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_ACDC(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_ACDC_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_ACDC_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_OVRD_EN_MASK (0x200U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_OVRD_EN_SHIFT (9U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_TERM_OVRD_EN_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_RESERVED_15_10_MASK (0xFC00U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_RESERVED_15_10_SHIFT (10U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_RESERVED_15_10_WIDTH (6U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_RESERVED_15_10_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_4_RESERVED_15_10_MASK)
/*! @} */

/*! @name LANEX_DIG_ASIC_RX_OVRD_IN_5 - Override values for incoming RX controls from ASIC, register #5 */
/*! @{ */

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_5_RESET_MASK (0x1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_5_RESET_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_5_RESET_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_5_RESET(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_5_RESET_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_5_RESET_MASK)

#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_5_RESET_OVRD_EN_MASK (0x2U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_5_RESET_OVRD_EN_SHIFT (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_5_RESET_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_OVRD_IN_5_RESET_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_OVRD_IN_5_RESET_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ASIC_RX_OVRD_IN_5_RESET_OVRD_EN_MASK)

