zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_RESET_MASK (0x2U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_RESET_SHIFT (1U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_RESET_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_RESET(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_RESET_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_RESET_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_INVERT_MASK (0x4U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_INVERT_SHIFT (2U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_INVERT_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_INVERT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_INVERT_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_INVERT_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DATA_EN_MASK (0x8U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DATA_EN_SHIFT (3U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DATA_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DATA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DATA_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DATA_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_REQ_MASK  (0x10U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_REQ_SHIFT (4U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_REQ_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_REQ(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_REQ_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_REQ_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_LPD_MASK  (0x20U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_LPD_SHIFT (5U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_LPD_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_LPD(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_LPD_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_LPD_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_PSTATE_MASK (0xC0U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_PSTATE_SHIFT (6U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_PSTATE_WIDTH (2U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_PSTATE_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_PSTATE_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_RATE_MASK (0x700U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_RATE_SHIFT (8U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_RATE_WIDTH (3U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_RATE(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_RATE_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_RATE_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_WIDTH_MASK (0x1800U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_WIDTH_SHIFT (11U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_WIDTH_WIDTH (2U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_WIDTH(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_WIDTH_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_WIDTH_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_MPLLB_SEL_MASK (0x2000U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_MPLLB_SEL_SHIFT (13U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_MPLLB_SEL_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_MPLLB_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_MPLLB_SEL_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_MPLLB_SEL_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DETECT_RX_REQ_MASK (0x4000U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DETECT_RX_REQ_SHIFT (14U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DETECT_RX_REQ_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DETECT_RX_REQ(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DETECT_RX_REQ_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DETECT_RX_REQ_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DISABLE_MASK (0x8000U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DISABLE_SHIFT (15U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DISABLE_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DISABLE_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_0_DISABLE_MASK)
/*! @} */

/*! @name LANEX_DIG_ASIC_TX_ASIC_IN_1 - Current values for incoming TX controls from ASIC, register #1 */
/*! @{ */

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_BEACON_EN_MASK (0x1U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_BEACON_EN_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_BEACON_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_BEACON_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_BEACON_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_BEACON_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_IBOOST_LVL_MASK (0x1EU)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_IBOOST_LVL_SHIFT (1U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_IBOOST_LVL_WIDTH (4U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_IBOOST_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_IBOOST_LVL_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_IBOOST_LVL_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_VBOOST_EN_MASK (0x20U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_VBOOST_EN_SHIFT (5U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_VBOOST_EN_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_VBOOST_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_VBOOST_EN_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_VBOOST_EN_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_TX_MAIN_CURSOR_MASK (0xFC0U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_TX_MAIN_CURSOR_SHIFT (6U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_TX_MAIN_CURSOR_WIDTH (6U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_TX_MAIN_CURSOR(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_TX_MAIN_CURSOR_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_TX_MAIN_CURSOR_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_RESERVED_15_12_MASK (0xF000U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_RESERVED_15_12_SHIFT (12U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_RESERVED_15_12_WIDTH (4U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_RESERVED_15_12_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_1_RESERVED_15_12_MASK)
/*! @} */

/*! @name LANEX_DIG_ASIC_TX_ASIC_IN_2 - Current values for incoming TX controls from ASIC, register #2 */
/*! @{ */

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_TX_PRE_CURSOR_MASK (0x3FU)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_TX_PRE_CURSOR_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_TX_PRE_CURSOR_WIDTH (6U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_TX_PRE_CURSOR(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_TX_PRE_CURSOR_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_TX_PRE_CURSOR_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_TX_POST_CURSOR_MASK (0xFC0U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_TX_POST_CURSOR_SHIFT (6U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_TX_POST_CURSOR_WIDTH (6U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_TX_POST_CURSOR(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_TX_POST_CURSOR_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_TX_POST_CURSOR_MASK)

#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_RESERVED_15_12_MASK (0xF000U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_RESERVED_15_12_SHIFT (12U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_RESERVED_15_12_WIDTH (4U)
#define X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_RESERVED_15_12_SHIFT)) & X2_LANEX_DIG_ASIC_TX_ASIC_IN_2_RESERVED_15_12_MASK)
/*! @} */

