zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name LANEX_DIG_ASIC_RX_ASIC_OUT_0 - Current values for outgoing RX status controls from PHY, register #0 */
/*! @{ */

#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_ACK_MASK (0x1U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_ACK_SHIFT (0U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_ACK_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_ACK(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_ACK_SHIFT)) & X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_ACK_MASK)

#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_LOS_MASK (0x2U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_LOS_SHIFT (1U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_LOS_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_LOS(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_LOS_SHIFT)) & X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_LOS_MASK)

#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_VALID_MASK (0x4U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_VALID_SHIFT (2U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_VALID_WIDTH (1U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_VALID(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_VALID_SHIFT)) & X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_VALID_MASK)

#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_ADAPT_STS_MASK (0x18U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_ADAPT_STS_SHIFT (3U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_ADAPT_STS_WIDTH (2U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_ADAPT_STS(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_ADAPT_STS_SHIFT)) & X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_ADAPT_STS_MASK)

#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_RESERVED_15_5_MASK (0xFFE0U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_RESERVED_15_5_SHIFT (5U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_RESERVED_15_5_WIDTH (11U)
#define X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_RESERVED_15_5_SHIFT)) & X2_LANEX_DIG_ASIC_RX_ASIC_OUT_0_RESERVED_15_5_MASK)
/*! @} */

/*! @name LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0 - TX Power State Control Register for P0 */
/*! @{ */

#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_REFGEN_EN_MASK (0x1U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_REFGEN_EN_SHIFT (0U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_REFGEN_EN_WIDTH (1U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_REFGEN_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_REFGEN_EN_SHIFT)) & X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_REFGEN_EN_MASK)

#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_VCM_HOLD_MASK (0x2U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_VCM_HOLD_SHIFT (1U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_VCM_HOLD_WIDTH (1U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_VCM_HOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_VCM_HOLD_SHIFT)) & X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_VCM_HOLD_MASK)

#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_CLK_EN_MASK (0x4U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_CLK_EN_SHIFT (2U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_CLK_EN_WIDTH (1U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_CLK_EN_SHIFT)) & X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_CLK_EN_MASK)

#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_WORD_CLK_EN_MASK (0x8U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_WORD_CLK_EN_SHIFT (3U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_WORD_CLK_EN_WIDTH (1U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_WORD_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_WORD_CLK_EN_SHIFT)) & X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_WORD_CLK_EN_MASK)

#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_RESET_MASK (0x10U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_RESET_SHIFT (4U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_RESET_WIDTH (1U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_RESET(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_RESET_SHIFT)) & X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_RESET_MASK)

#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_SERIAL_EN_MASK (0x20U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_SERIAL_EN_SHIFT (5U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_SERIAL_EN_WIDTH (1U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_SERIAL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_SERIAL_EN_SHIFT)) & X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ANA_SERIAL_EN_MASK)

#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_DIG_CLK_EN_MASK (0x40U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_DIG_CLK_EN_SHIFT (6U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_DIG_CLK_EN_WIDTH (1U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_DIG_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_DIG_CLK_EN_SHIFT)) & X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_DIG_CLK_EN_MASK)

#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_DATA_EN_MASK (0x80U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_DATA_EN_SHIFT (7U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_DATA_EN_WIDTH (1U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_DATA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_DATA_EN_SHIFT)) & X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_DATA_EN_MASK)

#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ALLOW_RXDET_MASK (0x100U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ALLOW_RXDET_SHIFT (8U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ALLOW_RXDET_WIDTH (1U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ALLOW_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ALLOW_RXDET_SHIFT)) & X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_TX_P0_ALLOW_RXDET_MASK)

#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_RESERVED_15_9_MASK (0xFE00U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_RESERVED_15_9_SHIFT (9U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_RESERVED_15_9_WIDTH (7U)
#define X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_RESERVED_15_9_SHIFT)) & X2_LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0_RESERVED_15_9_MASK)
/*! @} */

/*! @name LANEX_DIG_TX_PWRCTL_TX_PSTATE_P0S - TX Power State Control Register for P0S */
/*! @{ */

