zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CONTCAL_EN_MASK (0x8U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CONTCAL_EN_SHIFT (3U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CONTCAL_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CONTCAL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CONTCAL_EN_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_RX_VCO_CONTCAL_EN_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DISABLE_INT_CAL_MODE_MASK (0x10U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DISABLE_INT_CAL_MODE_SHIFT (4U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DISABLE_INT_CAL_MODE_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DISABLE_INT_CAL_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DISABLE_INT_CAL_MODE_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DISABLE_INT_CAL_MODE_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DPLL_CAL_UG_MASK (0x1E0U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DPLL_CAL_UG_SHIFT (5U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DPLL_CAL_UG_WIDTH (4U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DPLL_CAL_UG(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DPLL_CAL_UG_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DPLL_CAL_UG_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DTB_SEL_MASK (0xFE00U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DTB_SEL_SHIFT (9U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DTB_SEL_WIDTH (7U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DTB_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DTB_SEL_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_1_DTB_SEL_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2 - RX VCO calibration controls register #2 */
/*! @{ */

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_START_VAL_MASK (0x3FFU)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_START_VAL_SHIFT (0U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_START_VAL_WIDTH (10U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_START_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_START_VAL_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_START_VAL_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_CAL_STEPS_MASK (0x3C00U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_CAL_STEPS_SHIFT (10U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_CAL_STEPS_WIDTH (4U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_CAL_STEPS(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_CAL_STEPS_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_FREQ_TUNE_CAL_STEPS_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_FREQ_TUNE_CAL_MASK (0x4000U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_FREQ_TUNE_CAL_SHIFT (14U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_FREQ_TUNE_CAL_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_FREQ_TUNE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_FREQ_TUNE_CAL_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_FREQ_TUNE_CAL_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_CAL_MASK (0x8000U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_CAL_SHIFT (15U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_CAL_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_CAL_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_CTRL_2_SKIP_RX_VCO_CAL_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0 - RX Power UP Time Register #0 */
/*! @{ */

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_STARTUP_TIME_MASK (0x7FU)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_STARTUP_TIME_SHIFT (0U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_STARTUP_TIME_WIDTH (7U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_STARTUP_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_STARTUP_TIME_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_STARTUP_TIME_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_UPDATE_TIME_MASK (0x780U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_UPDATE_TIME_SHIFT (7U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_UPDATE_TIME_WIDTH (4U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_UPDATE_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_UPDATE_TIME_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_UPDATE_TIME_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_CNTR_PWRUP_TIME_MASK (0x7800U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_CNTR_PWRUP_TIME_SHIFT (11U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_CNTR_PWRUP_TIME_WIDTH (4U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_CNTR_PWRUP_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_CNTR_PWRUP_TIME_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_RX_VCO_CNTR_PWRUP_TIME_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_FAST_RX_VCO_WAIT_MASK (0x8000U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_FAST_RX_VCO_WAIT_SHIFT (15U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_FAST_RX_VCO_WAIT_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_FAST_RX_VCO_WAIT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_FAST_RX_VCO_WAIT_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_0_FAST_RX_VCO_WAIT_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1 - RX Power UP Time Register #1 */
/*! @{ */

