zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RX_VCO_CNTR_SETTLE_TIME_MASK (0x7U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RX_VCO_CNTR_SETTLE_TIME_SHIFT (0U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RX_VCO_CNTR_SETTLE_TIME_WIDTH (3U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RX_VCO_CNTR_SETTLE_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RX_VCO_CNTR_SETTLE_TIME_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RX_VCO_CNTR_SETTLE_TIME_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RESERVED_15_3_MASK (0xFFF8U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RESERVED_15_3_SHIFT (3U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RESERVED_15_3_WIDTH (13U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RESERVED_15_3(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RESERVED_15_3_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_CAL_TIME_1_RESERVED_15_3_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0 - RX VCO status register #0 */
/*! @{ */

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_FREQ_TUNE_MASK (0x3FFU)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_FREQ_TUNE_SHIFT (0U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_FREQ_TUNE_WIDTH (10U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_FREQ_TUNE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_FREQ_TUNE_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_FREQ_TUNE_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_PD_MASK (0x400U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_PD_SHIFT (10U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_PD_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_PD(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_PD_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_PD_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_EN_MASK (0x800U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_EN_SHIFT (11U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_EN_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_VCO_CNTR_EN_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_STARTUP_MASK (0x1000U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_STARTUP_SHIFT (12U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_STARTUP_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_STARTUP(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_STARTUP_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_STARTUP_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_VCO_EN_MASK (0x2000U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_VCO_EN_SHIFT (13U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_VCO_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_VCO_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_VCO_EN_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RX_ANA_CDR_VCO_EN_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RESERVED_15_14_MASK (0xC000U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RESERVED_15_14_SHIFT (14U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RESERVED_15_14_WIDTH (2U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RESERVED_15_14_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_0_RESERVED_15_14_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1 - RX VCO status register #1 */
/*! @{ */

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FSM_STATE_MASK (0xFU)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FSM_STATE_SHIFT (0U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FSM_STATE_WIDTH (4U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FSM_STATE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FSM_STATE_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FSM_STATE_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FREQ_RST_MASK (0x10U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FREQ_RST_SHIFT (4U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FREQ_RST_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FREQ_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FREQ_RST_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_FREQ_RST_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_RST_MASK (0x20U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_RST_SHIFT (5U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_RST_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_RST_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_RST_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CONTCAL_EN_MASK (0x40U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CONTCAL_EN_SHIFT (6U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CONTCAL_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CONTCAL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CONTCAL_EN_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CONTCAL_EN_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_DONE_MASK (0x80U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_DONE_SHIFT (7U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_DONE_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_DONE_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RX_VCO_CAL_DONE_MASK)

