zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_DPLL_FREQ_RST_MASK (0x100U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_DPLL_FREQ_RST_SHIFT (8U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_DPLL_FREQ_RST_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_DPLL_FREQ_RST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_DPLL_FREQ_RST_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_DPLL_FREQ_RST_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RESERVED_15_9_MASK (0xFE00U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RESERVED_15_9_SHIFT (9U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RESERVED_15_9_WIDTH (7U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RESERVED_15_9_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_1_RESERVED_15_9_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2 - RX VCO status register #2 */
/*! @{ */

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCO_CNTR_FINAL_MASK (0x1FFFU)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCO_CNTR_FINAL_SHIFT (0U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCO_CNTR_FINAL_WIDTH (13U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCO_CNTR_FINAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCO_CNTR_FINAL_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCO_CNTR_FINAL_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCOCLK_TOO_FAST_MASK (0x2000U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCOCLK_TOO_FAST_SHIFT (13U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCOCLK_TOO_FAST_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCOCLK_TOO_FAST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCOCLK_TOO_FAST_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_VCOCLK_TOO_FAST_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_CORRECT_MASK (0x4000U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_CORRECT_SHIFT (14U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_CORRECT_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_CORRECT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_CORRECT_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_CORRECT_MASK)

#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_UP_MASK (0x8000U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_UP_SHIFT (15U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_UP_WIDTH (1U)
#define X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_UP(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_UP_SHIFT)) & X2_LANEX_DIG_RX_VCOCAL_RX_VCO_STAT_2_RX_VCO_UP_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK - XAUI_COMMA Mask */
/*! @{ */

#define X2_LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK_XAUI_COMM_MASK_MASK (0x3FFU)
#define X2_LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK_XAUI_COMM_MASK_SHIFT (0U)
#define X2_LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK_XAUI_COMM_MASK_WIDTH (10U)
#define X2_LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK_XAUI_COMM_MASK(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK_XAUI_COMM_MASK_SHIFT)) & X2_LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK_XAUI_COMM_MASK_MASK)

#define X2_LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK_RESERVED_15_10_MASK (0xFC00U)
#define X2_LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK_RESERVED_15_10_SHIFT (10U)
#define X2_LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK_RESERVED_15_10_WIDTH (6U)
#define X2_LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK_RESERVED_15_10_SHIFT)) & X2_LANEX_DIG_RX_RX_ALIGN_XAUI_COMM_MASK_RESERVED_15_10_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_LBERT_CTL - Pattern Matcher controls */
/*! @{ */

#define X2_LANEX_DIG_RX_LBERT_CTL_MODE_MASK      (0xFU)
#define X2_LANEX_DIG_RX_LBERT_CTL_MODE_SHIFT     (0U)
#define X2_LANEX_DIG_RX_LBERT_CTL_MODE_WIDTH     (4U)
#define X2_LANEX_DIG_RX_LBERT_CTL_MODE(x)        (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_LBERT_CTL_MODE_SHIFT)) & X2_LANEX_DIG_RX_LBERT_CTL_MODE_MASK)

#define X2_LANEX_DIG_RX_LBERT_CTL_SYNC_MASK      (0x10U)
#define X2_LANEX_DIG_RX_LBERT_CTL_SYNC_SHIFT     (4U)
#define X2_LANEX_DIG_RX_LBERT_CTL_SYNC_WIDTH     (1U)
#define X2_LANEX_DIG_RX_LBERT_CTL_SYNC(x)        (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_LBERT_CTL_SYNC_SHIFT)) & X2_LANEX_DIG_RX_LBERT_CTL_SYNC_MASK)

#define X2_LANEX_DIG_RX_LBERT_CTL_RESERVED_15_5_MASK (0xFFE0U)
#define X2_LANEX_DIG_RX_LBERT_CTL_RESERVED_15_5_SHIFT (5U)
#define X2_LANEX_DIG_RX_LBERT_CTL_RESERVED_15_5_WIDTH (11U)
#define X2_LANEX_DIG_RX_LBERT_CTL_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_LBERT_CTL_RESERVED_15_5_SHIFT)) & X2_LANEX_DIG_RX_LBERT_CTL_RESERVED_15_5_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_LBERT_ERR - Pattern match error counter */
/*! @{ */

#define X2_LANEX_DIG_RX_LBERT_ERR_COUNT_MASK     (0x7FFFU)
#define X2_LANEX_DIG_RX_LBERT_ERR_COUNT_SHIFT    (0U)
#define X2_LANEX_DIG_RX_LBERT_ERR_COUNT_WIDTH    (15U)
#define X2_LANEX_DIG_RX_LBERT_ERR_COUNT(x)       (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_LBERT_ERR_COUNT_SHIFT)) & X2_LANEX_DIG_RX_LBERT_ERR_COUNT_MASK)

#define X2_LANEX_DIG_RX_LBERT_ERR_OV14_MASK      (0x8000U)
#define X2_LANEX_DIG_RX_LBERT_ERR_OV14_SHIFT     (15U)
#define X2_LANEX_DIG_RX_LBERT_ERR_OV14_WIDTH     (1U)
#define X2_LANEX_DIG_RX_LBERT_ERR_OV14(x)        (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_LBERT_ERR_OV14_SHIFT)) & X2_LANEX_DIG_RX_LBERT_ERR_OV14_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_CDR_CDR_CTL_0 - Control bits for receiver in recovered domain */
/*! @{ */

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EN_MASK (0x3U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EN_SHIFT (0U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EN_WIDTH (2U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EN_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EN_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EDGE_MASK (0xCU)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EDGE_SHIFT (2U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EDGE_WIDTH (2U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EDGE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EDGE_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EDGE_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_POL_MASK (0x10U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_POL_SHIFT (4U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_POL_WIDTH (1U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_POL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_POL_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_POL_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EN_PR_MODE_MASK (0x20U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EN_PR_MODE_SHIFT (5U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EN_PR_MODE_WIDTH (1U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EN_PR_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EN_PR_MODE_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_0_PHDET_EN_PR_MODE_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_ALWAYS_REALIGN_MASK (0x40U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_ALWAYS_REALIGN_SHIFT (6U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_ALWAYS_REALIGN_WIDTH (1U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_ALWAYS_REALIGN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_0_ALWAYS_REALIGN_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_0_ALWAYS_REALIGN_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_DTB_SEL_MASK (0x780U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_DTB_SEL_SHIFT (7U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_DTB_SEL_WIDTH (4U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_DTB_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_0_DTB_SEL_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_0_DTB_SEL_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_RESERVED_15_11_MASK (0xF800U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_RESERVED_15_11_SHIFT (11U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_RESERVED_15_11_WIDTH (5U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_0_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_0_RESERVED_15_11_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_0_RESERVED_15_11_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_CDR_CDR_CTL_1 - CDR Control Register #1 */
/*! @{ */

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_1_SSC_OFF_CNT0_MASK (0x3FFU)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_1_SSC_OFF_CNT0_SHIFT (0U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_1_SSC_OFF_CNT0_WIDTH (10U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_1_SSC_OFF_CNT0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_1_SSC_OFF_CNT0_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_1_SSC_OFF_CNT0_MASK)

