zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_1_SSC_OFF_CNT1_MASK (0xFC00U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_1_SSC_OFF_CNT1_SHIFT (10U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_1_SSC_OFF_CNT1_WIDTH (6U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_1_SSC_OFF_CNT1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_1_SSC_OFF_CNT1_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_1_SSC_OFF_CNT1_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_CDR_CDR_CTL_2 - CDR Control Register #2 */
/*! @{ */

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_2_SSC_ON_CNT0_MASK (0x1FFU)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_2_SSC_ON_CNT0_SHIFT (0U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_2_SSC_ON_CNT0_WIDTH (9U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_2_SSC_ON_CNT0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_2_SSC_ON_CNT0_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_2_SSC_ON_CNT0_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_2_SSC_ON_CNT1_MASK (0xFE00U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_2_SSC_ON_CNT1_SHIFT (9U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_2_SSC_ON_CNT1_WIDTH (7U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_2_SSC_ON_CNT1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_2_SSC_ON_CNT1_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_2_SSC_ON_CNT1_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_CDR_CDR_CTL_3 - CDR Control Register #3 */
/*! @{ */

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_PHUG0_MASK (0x7U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_PHUG0_SHIFT (0U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_PHUG0_WIDTH (3U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_PHUG0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_PHUG0_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_PHUG0_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_PHUG1_MASK (0x38U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_PHUG1_SHIFT (3U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_PHUG1_WIDTH (3U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_PHUG1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_PHUG1_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_PHUG1_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_FRUG0_MASK (0x1C0U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_FRUG0_SHIFT (6U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_FRUG0_WIDTH (3U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_FRUG0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_FRUG0_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_3_SSC_OFF_FRUG0_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_OVRD_DPLL_GAIN_MASK (0x200U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_OVRD_DPLL_GAIN_SHIFT (9U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_OVRD_DPLL_GAIN_WIDTH (1U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_OVRD_DPLL_GAIN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_3_OVRD_DPLL_GAIN_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_3_OVRD_DPLL_GAIN_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_PHUG_OVRD_VALUE_MASK (0x1C00U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_PHUG_OVRD_VALUE_SHIFT (10U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_PHUG_OVRD_VALUE_WIDTH (3U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_PHUG_OVRD_VALUE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_3_PHUG_OVRD_VALUE_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_3_PHUG_OVRD_VALUE_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_FRUG_OVRD_VALUE_MASK (0xE000U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_FRUG_OVRD_VALUE_SHIFT (13U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_FRUG_OVRD_VALUE_WIDTH (3U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_3_FRUG_OVRD_VALUE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_3_FRUG_OVRD_VALUE_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_3_FRUG_OVRD_VALUE_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_CDR_CDR_CTL_4 - CDR Control Register #4 */
/*! @{ */

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_OFF_FRUG1_MASK (0x7U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_OFF_FRUG1_SHIFT (0U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_OFF_FRUG1_WIDTH (3U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_OFF_FRUG1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_OFF_FRUG1_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_OFF_FRUG1_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_FRUG0_MASK (0x38U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_FRUG0_SHIFT (3U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_FRUG0_WIDTH (3U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_FRUG0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_FRUG0_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_FRUG0_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_FRUG1_MASK (0x1C0U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_FRUG1_SHIFT (6U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_FRUG1_WIDTH (3U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_FRUG1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_FRUG1_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_FRUG1_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_PHUG0_MASK (0xE00U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_PHUG0_SHIFT (9U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_PHUG0_WIDTH (3U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_PHUG0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_PHUG0_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_PHUG0_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_PHUG1_MASK (0x7000U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_PHUG1_SHIFT (12U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_PHUG1_WIDTH (3U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_PHUG1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_PHUG1_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_4_SSC_ON_PHUG1_MASK)

#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_RESERVED_15_15_MASK (0x8000U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_RESERVED_15_15_SHIFT (15U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_RESERVED_15_15_WIDTH (1U)
#define X2_LANEX_DIG_RX_CDR_CDR_CTL_4_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_CDR_CTL_4_RESERVED_15_15_SHIFT)) & X2_LANEX_DIG_RX_CDR_CDR_CTL_4_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_CDR_STAT - Current output values to dpll (phug, frug) */
/*! @{ */

#define X2_LANEX_DIG_RX_CDR_STAT_PHUG_VALUE_MASK (0x7U)
#define X2_LANEX_DIG_RX_CDR_STAT_PHUG_VALUE_SHIFT (0U)
#define X2_LANEX_DIG_RX_CDR_STAT_PHUG_VALUE_WIDTH (3U)
#define X2_LANEX_DIG_RX_CDR_STAT_PHUG_VALUE(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_STAT_PHUG_VALUE_SHIFT)) & X2_LANEX_DIG_RX_CDR_STAT_PHUG_VALUE_MASK)

#define X2_LANEX_DIG_RX_CDR_STAT_FRUG_VALUE_MASK (0x38U)
#define X2_LANEX_DIG_RX_CDR_STAT_FRUG_VALUE_SHIFT (3U)
#define X2_LANEX_DIG_RX_CDR_STAT_FRUG_VALUE_WIDTH (3U)
#define X2_LANEX_DIG_RX_CDR_STAT_FRUG_VALUE(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_STAT_FRUG_VALUE_SHIFT)) & X2_LANEX_DIG_RX_CDR_STAT_FRUG_VALUE_MASK)

#define X2_LANEX_DIG_RX_CDR_STAT_RESERVED_15_6_MASK (0xFFC0U)
#define X2_LANEX_DIG_RX_CDR_STAT_RESERVED_15_6_SHIFT (6U)
#define X2_LANEX_DIG_RX_CDR_STAT_RESERVED_15_6_WIDTH (10U)
#define X2_LANEX_DIG_RX_CDR_STAT_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_CDR_STAT_RESERVED_15_6_SHIFT)) & X2_LANEX_DIG_RX_CDR_STAT_RESERVED_15_6_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_DPLL_FREQ - Current frequency integrator value. */
/*! @{ */

#define X2_LANEX_DIG_RX_DPLL_FREQ_VAL_MASK       (0x3FFFU)
#define X2_LANEX_DIG_RX_DPLL_FREQ_VAL_SHIFT      (0U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_VAL_WIDTH      (14U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_VAL(x)         (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_DPLL_FREQ_VAL_SHIFT)) & X2_LANEX_DIG_RX_DPLL_FREQ_VAL_MASK)

#define X2_LANEX_DIG_RX_DPLL_FREQ_RESERVED_15_14_MASK (0xC000U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_RESERVED_15_14_SHIFT (14U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_RESERVED_15_14_WIDTH (2U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_DPLL_FREQ_RESERVED_15_14_SHIFT)) & X2_LANEX_DIG_RX_DPLL_FREQ_RESERVED_15_14_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_DPLL_FREQ_BOUND_0 - Frequency Bounds for incoming data stream #0 */
/*! @{ */

#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_FREQ_BOUND_EN_MASK (0x1U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_FREQ_BOUND_EN_SHIFT (0U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_FREQ_BOUND_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_FREQ_BOUND_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_FREQ_BOUND_EN_SHIFT)) & X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_FREQ_BOUND_EN_MASK)

#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_UPPER_FREQ_BOUND_MASK (0x7FEU)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_UPPER_FREQ_BOUND_SHIFT (1U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_UPPER_FREQ_BOUND_WIDTH (10U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_UPPER_FREQ_BOUND(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_UPPER_FREQ_BOUND_SHIFT)) & X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_UPPER_FREQ_BOUND_MASK)

