zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_RESERVED_15_11_MASK (0xF800U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_RESERVED_15_11_SHIFT (11U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_RESERVED_15_11_WIDTH (5U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_RESERVED_15_11_SHIFT)) & X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_0_RESERVED_15_11_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_DPLL_FREQ_BOUND_1 - Frequency Bounds for incoming data stream #1 */
/*! @{ */

#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_1_LOWER_FREQ_BOUND_MASK (0x3FFU)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_1_LOWER_FREQ_BOUND_SHIFT (0U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_1_LOWER_FREQ_BOUND_WIDTH (10U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_1_LOWER_FREQ_BOUND(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_1_LOWER_FREQ_BOUND_SHIFT)) & X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_1_LOWER_FREQ_BOUND_MASK)

#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_1_RESERVED_15_10_MASK (0xFC00U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_1_RESERVED_15_10_SHIFT (10U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_1_RESERVED_15_10_WIDTH (6U)
#define X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_1_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_1_RESERVED_15_10_SHIFT)) & X2_LANEX_DIG_RX_DPLL_FREQ_BOUND_1_RESERVED_15_10_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0 - Adaptation Configuration Register #0 */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TOP_ASM1_MASK (0x3FFU)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TOP_ASM1_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TOP_ASM1_WIDTH (10U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TOP_ASM1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TOP_ASM1_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TOP_ASM1_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TGG_ASM1_MASK (0x3C00U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TGG_ASM1_SHIFT (10U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TGG_ASM1_WIDTH (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TGG_ASM1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TGG_ASM1_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_N_TGG_ASM1_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_START_ASM1_MASK (0x4000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_START_ASM1_SHIFT (14U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_START_ASM1_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_START_ASM1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_START_ASM1_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_START_ASM1_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_ADPT_CLK_DIV4_EN_MASK (0x8000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_ADPT_CLK_DIV4_EN_SHIFT (15U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_ADPT_CLK_DIV4_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_ADPT_CLK_DIV4_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_ADPT_CLK_DIV4_EN_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_0_ADPT_CLK_DIV4_EN_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1 - Adaptation Configuration Register #1 */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_N_WAIT_ASM1_MASK (0x7FU)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_N_WAIT_ASM1_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_N_WAIT_ASM1_WIDTH (7U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_N_WAIT_ASM1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_N_WAIT_ASM1_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_N_WAIT_ASM1_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_FAST_AFE_DFE_SETTLE_MASK (0x80U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_FAST_AFE_DFE_SETTLE_SHIFT (7U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_FAST_AFE_DFE_SETTLE_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_FAST_AFE_DFE_SETTLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_FAST_AFE_DFE_SETTLE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_FAST_AFE_DFE_SETTLE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_VAL_MASK (0x700U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_VAL_SHIFT (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_VAL_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_VAL_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_VAL_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_EN_MASK (0x800U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_EN_SHIFT (11U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_EN_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_CTLE_POLE_OVRD_EN_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_RESERVED_15_12_MASK (0xF000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_RESERVED_15_12_SHIFT (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_RESERVED_15_12_WIDTH (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_RESERVED_15_12_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_1_RESERVED_15_12_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2 - Adaptation Configuration Register #2 */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_0_MASK (0x1FU)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_0_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_0_WIDTH (5U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_0_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_0_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_1_MASK (0x3E0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_1_SHIFT (5U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_1_WIDTH (5U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_1_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_TGG_PTTRN_1_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_RESERVED_15_10_MASK (0xFC00U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_RESERVED_15_10_SHIFT (10U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_RESERVED_15_10_WIDTH (6U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_RESERVED_15_10_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_2_RESERVED_15_10_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3 - Adaptation Configuration Register #3 */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_CTLE_EN_MASK (0x1FU)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_CTLE_EN_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_CTLE_EN_WIDTH (5U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_CTLE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_CTLE_EN_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_CTLE_EN_MASK)

