zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_VGA_EN_MASK (0x20U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_VGA_EN_SHIFT (5U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_VGA_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_VGA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_VGA_EN_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_VGA_EN_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_ATT_EN_MASK (0x40U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_ATT_EN_SHIFT (6U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_ATT_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_ATT_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_ATT_EN_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_ATT_EN_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_DFE_EN_MASK (0xF80U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_DFE_EN_SHIFT (7U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_DFE_EN_WIDTH (5U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_DFE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_DFE_EN_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_DFE_EN_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_EYEHE_EN_MASK (0x1000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_EYEHE_EN_SHIFT (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_EYEHE_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_EYEHE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_EYEHE_EN_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_EYEHE_EN_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_EYEHO_EN_MASK (0x2000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_EYEHO_EN_SHIFT (13U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_EYEHO_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_EYEHO_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_EYEHO_EN_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_EYEHO_EN_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_TGG_EN_MASK (0x4000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_TGG_EN_SHIFT (14U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_TGG_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_TGG_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_TGG_EN_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_TGG_EN_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_ESL_TWICE_DSL_MASK (0x8000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_ESL_TWICE_DSL_SHIFT (15U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_ESL_TWICE_DSL_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_ESL_TWICE_DSL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_ESL_TWICE_DSL_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_3_ESL_TWICE_DSL_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4 - Adaptation Configuration Register #4 */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_CTLE_TH_MASK (0xFU)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_CTLE_TH_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_CTLE_TH_WIDTH (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_CTLE_TH(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_CTLE_TH_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_CTLE_TH_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_VGA_TH_MASK (0xF0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_VGA_TH_SHIFT (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_VGA_TH_WIDTH (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_VGA_TH(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_VGA_TH_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_VGA_TH_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_DFE1_TH_MASK (0xF00U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_DFE1_TH_SHIFT (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_DFE1_TH_WIDTH (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_DFE1_TH(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_DFE1_TH_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_DFE1_TH_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_DFE2_TH_MASK (0xF000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_DFE2_TH_SHIFT (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_DFE2_TH_WIDTH (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_DFE2_TH(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_DFE2_TH_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_4_DFE2_TH_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5 - Adaptation Configuration Register #5 */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE3_TH_MASK (0xFU)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE3_TH_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE3_TH_WIDTH (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE3_TH(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE3_TH_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE3_TH_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE4_TH_MASK (0xF0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE4_TH_SHIFT (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE4_TH_WIDTH (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE4_TH(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE4_TH_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE4_TH_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE5_TH_MASK (0xF00U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE5_TH_SHIFT (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE5_TH_WIDTH (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE5_TH(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE5_TH_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_DFE5_TH_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_TH_OFFSET_MASK (0xF000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_TH_OFFSET_SHIFT (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_TH_OFFSET_WIDTH (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_TH_OFFSET(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_TH_OFFSET_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_5_TH_OFFSET_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6 - Adaptation Configuration Register #6 */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_CTLE_MU_MASK (0x7U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_CTLE_MU_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_CTLE_MU_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_CTLE_MU(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_CTLE_MU_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_CTLE_MU_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_MU_MASK (0x38U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_MU_SHIFT (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_MU_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_MU(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_MU_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_MU_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_ATT_MU_MASK (0x1C0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_ATT_MU_SHIFT (6U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_ATT_MU_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_ATT_MU(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_ATT_MU_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_ATT_MU_MASK)

