zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_SAT_CNT_MASK (0xE00U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_SAT_CNT_SHIFT (9U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_SAT_CNT_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_SAT_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_SAT_CNT_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_SAT_CNT_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_SAT_CNT_STICKY_MASK (0x1000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_SAT_CNT_STICKY_SHIFT (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_SAT_CNT_STICKY_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_SAT_CNT_STICKY(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_SAT_CNT_STICKY_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_VGA_SAT_CNT_STICKY_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_ATT_LOW_TH_MASK (0xE000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_ATT_LOW_TH_SHIFT (13U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_ATT_LOW_TH_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_ATT_LOW_TH(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_ATT_LOW_TH_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_6_ATT_LOW_TH_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7 - Adaptation Configuration Register #7 */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_MIN_SAT_MASK (0x1FU)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_MIN_SAT_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_MIN_SAT_WIDTH (5U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_MIN_SAT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_MIN_SAT_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_MIN_SAT_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_LEV_HIGH_MASK (0x3E0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_LEV_HIGH_SHIFT (5U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_LEV_HIGH_WIDTH (5U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_LEV_HIGH(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_LEV_HIGH_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_LEV_HIGH_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_LEV_LOW_MASK (0x7C00U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_LEV_LOW_SHIFT (10U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_LEV_LOW_WIDTH (5U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_LEV_LOW(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_LEV_LOW_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_VGA_LEV_LOW_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_RESERVED_15_15_MASK (0x8000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_RESERVED_15_15_SHIFT (15U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_RESERVED_15_15_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_RESERVED_15_15_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_7_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8 - Adaptation Configuration Register #8 */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE1_MU_MASK (0x7U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE1_MU_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE1_MU_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE1_MU(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE1_MU_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE1_MU_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE2_MU_MASK (0x38U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE2_MU_SHIFT (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE2_MU_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE2_MU(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE2_MU_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE2_MU_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE3_MU_MASK (0x1C0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE3_MU_SHIFT (6U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE3_MU_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE3_MU(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE3_MU_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE3_MU_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE4_MU_MASK (0xE00U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE4_MU_SHIFT (9U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE4_MU_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE4_MU(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE4_MU_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE4_MU_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE5_MU_MASK (0x7000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE5_MU_SHIFT (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE5_MU_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE5_MU(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE5_MU_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_DFE5_MU_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_RESERVED_15_15_MASK (0x8000U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_RESERVED_15_15_SHIFT (15U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_RESERVED_15_15_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_RESERVED_15_15_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_8_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9 - Adaptation Configuration Register #9 */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9_ERR_SLE_ADPT_INIT_MASK (0xFFU)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9_ERR_SLE_ADPT_INIT_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9_ERR_SLE_ADPT_INIT_WIDTH (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9_ERR_SLE_ADPT_INIT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9_ERR_SLE_ADPT_INIT_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9_ERR_SLE_ADPT_INIT_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9_ERR_SLO_ADPT_INIT_MASK (0xFF00U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9_ERR_SLO_ADPT_INIT_SHIFT (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9_ERR_SLO_ADPT_INIT_WIDTH (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9_ERR_SLO_ADPT_INIT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9_ERR_SLO_ADPT_INIT_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_CFG_9_ERR_SLO_ADPT_INIT_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG - Reset Adaptation Configuration Register */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_ATT_MASK (0x1U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_ATT_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_ATT_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_ATT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_ATT_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_ATT_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_VGA_MASK (0x2U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_VGA_SHIFT (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_VGA_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_VGA(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_VGA_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_VGA_MASK)

