zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_CTLE_BOOST_MASK (0x4U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_CTLE_BOOST_SHIFT (2U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_CTLE_BOOST_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_CTLE_BOOST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_CTLE_BOOST_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_CTLE_BOOST_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_CTLE_POLE_MASK (0x8U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_CTLE_POLE_SHIFT (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_CTLE_POLE_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_CTLE_POLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_CTLE_POLE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_CTLE_POLE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_TAP1_MASK (0x10U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_TAP1_SHIFT (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_TAP1_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_TAP1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_TAP1_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RST_ADPT_TAP1_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RESERVED_15_5_MASK (0xFFE0U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RESERVED_15_5_SHIFT (5U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RESERVED_15_5_WIDTH (11U)
#define X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RESERVED_15_5_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_RST_ADPT_CFG_RESERVED_15_5_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_ATT_STATUS - Value of ATT Adaptation code */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_ATT_ADPT_CODE_MASK (0xFFU)
#define X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_ATT_ADPT_CODE_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_ATT_ADPT_CODE_WIDTH (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_ATT_ADPT_CODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_ATT_ADPT_CODE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_ATT_ADPT_CODE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_ASM1_DON_MASK (0x100U)
#define X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_ASM1_DON_SHIFT (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_ASM1_DON_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_ASM1_DON(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_ASM1_DON_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_ASM1_DON_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_RESERVED_15_9_MASK (0xFE00U)
#define X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_RESERVED_15_9_SHIFT (9U)
#define X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_RESERVED_15_9_WIDTH (7U)
#define X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_RESERVED_15_9_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ATT_STATUS_RESERVED_15_9_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_VGA_STATUS - Value of VGA Adaptation code */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_VGA_ADPT_CODE_MASK (0x3FFU)
#define X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_VGA_ADPT_CODE_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_VGA_ADPT_CODE_WIDTH (10U)
#define X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_VGA_ADPT_CODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_VGA_ADPT_CODE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_VGA_ADPT_CODE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_ASM1_DONE_MASK (0x400U)
#define X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_ASM1_DONE_SHIFT (10U)
#define X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_ASM1_DONE_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_ASM1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_ASM1_DONE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_ASM1_DONE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_RESERVED_15_11_MASK (0xF800U)
#define X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_RESERVED_15_11_SHIFT (11U)
#define X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_RESERVED_15_11_WIDTH (5U)
#define X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_RESERVED_15_11(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_RESERVED_15_11_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_VGA_STATUS_RESERVED_15_11_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_CTLE_STATUS - Value of CTLE Adaptation code */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_CTLE_BOOST_ADPT_CODE_MASK (0x3FFU)
#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_CTLE_BOOST_ADPT_CODE_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_CTLE_BOOST_ADPT_CODE_WIDTH (10U)
#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_CTLE_BOOST_ADPT_CODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_CTLE_BOOST_ADPT_CODE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_CTLE_BOOST_ADPT_CODE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_CTLE_POLE_ADPT_CODE_MASK (0x1C00U)
#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_CTLE_POLE_ADPT_CODE_SHIFT (10U)
#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_CTLE_POLE_ADPT_CODE_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_CTLE_POLE_ADPT_CODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_CTLE_POLE_ADPT_CODE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_CTLE_POLE_ADPT_CODE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_ASM1_DONE_MASK (0x2000U)
#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_ASM1_DONE_SHIFT (13U)
#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_ASM1_DONE_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_ASM1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_ASM1_DONE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_ASM1_DONE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_RESERVED_15_14_MASK (0xC000U)
#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_RESERVED_15_14_SHIFT (14U)
#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_RESERVED_15_14_WIDTH (2U)
#define X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_RESERVED_15_14_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_CTLE_STATUS_RESERVED_15_14_MASK)
/*! @} */

