zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS - Value of DFE Tap1 Adaptation code */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_DFE_TAP1_ADPT_CODE_MASK (0x1FFFU)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_DFE_TAP1_ADPT_CODE_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_DFE_TAP1_ADPT_CODE_WIDTH (13U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_DFE_TAP1_ADPT_CODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_DFE_TAP1_ADPT_CODE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_DFE_TAP1_ADPT_CODE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_ASM1_DONE_MASK (0x2000U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_ASM1_DONE_SHIFT (13U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_ASM1_DONE_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_ASM1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_ASM1_DONE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_ASM1_DONE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_RESERVED_15_14_MASK (0xC000U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_RESERVED_15_14_SHIFT (14U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_RESERVED_15_14_WIDTH (2U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_RESERVED_15_14(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_RESERVED_15_14_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP1_STATUS_RESERVED_15_14_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS - Value of DFE Tap2 Adaptation code */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_DFE_TAP2_ADPT_CODE_MASK (0xFFFU)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_DFE_TAP2_ADPT_CODE_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_DFE_TAP2_ADPT_CODE_WIDTH (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_DFE_TAP2_ADPT_CODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_DFE_TAP2_ADPT_CODE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_DFE_TAP2_ADPT_CODE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_ASM1_DONE_MASK (0x1000U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_ASM1_DONE_SHIFT (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_ASM1_DONE_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_ASM1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_ASM1_DONE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_ASM1_DONE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_RESERVED_15_13_MASK (0xE000U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_RESERVED_15_13_SHIFT (13U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_RESERVED_15_13_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_RESERVED_15_13_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP2_STATUS_RESERVED_15_13_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS - Value of DFE Tap3 Adaptation code */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_DFE_TAP3_ADPT_CODE_MASK (0xFFFU)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_DFE_TAP3_ADPT_CODE_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_DFE_TAP3_ADPT_CODE_WIDTH (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_DFE_TAP3_ADPT_CODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_DFE_TAP3_ADPT_CODE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_DFE_TAP3_ADPT_CODE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_ASM1_DONE_MASK (0x1000U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_ASM1_DONE_SHIFT (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_ASM1_DONE_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_ASM1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_ASM1_DONE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_ASM1_DONE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_RESERVED_15_13_MASK (0xE000U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_RESERVED_15_13_SHIFT (13U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_RESERVED_15_13_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_RESERVED_15_13_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP3_STATUS_RESERVED_15_13_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS - Value of DFE Tap4 Adaptation code */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_DFE_TAP4_ADPT_CODE_MASK (0xFFFU)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_DFE_TAP4_ADPT_CODE_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_DFE_TAP4_ADPT_CODE_WIDTH (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_DFE_TAP4_ADPT_CODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_DFE_TAP4_ADPT_CODE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_DFE_TAP4_ADPT_CODE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_ASM1_DONE_MASK (0x1000U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_ASM1_DONE_SHIFT (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_ASM1_DONE_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_ASM1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_ASM1_DONE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_ASM1_DONE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_RESERVED_15_13_MASK (0xE000U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_RESERVED_15_13_SHIFT (13U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_RESERVED_15_13_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_RESERVED_15_13_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP4_STATUS_RESERVED_15_13_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS - Value of DFE Tap5 Adaptation code */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_DFE_TAP5_ADPT_CODE_MASK (0xFFFU)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_DFE_TAP5_ADPT_CODE_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_DFE_TAP5_ADPT_CODE_WIDTH (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_DFE_TAP5_ADPT_CODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_DFE_TAP5_ADPT_CODE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_DFE_TAP5_ADPT_CODE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_ASM1_DONE_MASK (0x1000U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_ASM1_DONE_SHIFT (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_ASM1_DONE_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_ASM1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_ASM1_DONE_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_ASM1_DONE_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_RESERVED_15_13_MASK (0xE000U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_RESERVED_15_13_SHIFT (13U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_RESERVED_15_13_WIDTH (3U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_RESERVED_15_13_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_TAP5_STATUS_RESERVED_15_13_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST - Offset values for RX DFE Data Even vDAC */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST_DFE_DATA_EVEN_VDAC_OFST_MASK (0xFFU)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST_DFE_DATA_EVEN_VDAC_OFST_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST_DFE_DATA_EVEN_VDAC_OFST_WIDTH (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST_DFE_DATA_EVEN_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST_DFE_DATA_EVEN_VDAC_OFST_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST_DFE_DATA_EVEN_VDAC_OFST_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_EVEN_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST - Offset values for RX DFE Data Odd vDAC */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST_DFE_DATA_ODD_VDAC_OFST_MASK (0xFFU)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST_DFE_DATA_ODD_VDAC_OFST_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST_DFE_DATA_ODD_VDAC_OFST_WIDTH (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST_DFE_DATA_ODD_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST_DFE_DATA_ODD_VDAC_OFST_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST_DFE_DATA_ODD_VDAC_OFST_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_DATA_ODD_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN - Sets values for RX SLICER CTRL EVEN signals going to ANA */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_MASK (0xFU)
#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_WIDTH (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN_RESERVED_15_4_MASK (0xFFF0U)
#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN_RESERVED_15_4_SHIFT (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN_RESERVED_15_4_WIDTH (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN_RESERVED_15_4_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_EVEN_RESERVED_15_4_MASK)
/*! @} */

