zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD - Sets values for RX SLICER CTRL ODD signals going to ANA */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_MASK (0xFU)
#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_WIDTH (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD_RESERVED_15_4_MASK (0xFFF0U)
#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD_RESERVED_15_4_SHIFT (4U)
#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD_RESERVED_15_4_WIDTH (12U)
#define X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD_RESERVED_15_4_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_RX_SLICER_CTRL_ODD_RESERVED_15_4_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST - Offset values for RX DFE Error Even vDAC */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_MASK (0xFFU)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_WIDTH (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST - Offset values for RX DFE Error Odd vDAC */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_MASK (0xFFU)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_WIDTH (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL - Value of Error Slicer Level */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL_E_SLO_LVL_MASK (0xFFU)
#define X2_LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL_E_SLO_LVL_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL_E_SLO_LVL_WIDTH (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL_E_SLO_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL_E_SLO_LVL_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL_E_SLO_LVL_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL_E_SLE_LVL_MASK (0xFF00U)
#define X2_LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL_E_SLE_LVL_SHIFT (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL_E_SLE_LVL_WIDTH (8U)
#define X2_LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL_E_SLE_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL_E_SLE_LVL_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ERROR_SLICER_LEVEL_E_SLE_LVL_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_ADPTCTL_ADPT_RESET - Adaptation reset register */
/*! @{ */

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_RESET_RESET_ASM1_MASK (0x1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_RESET_RESET_ASM1_SHIFT (0U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_RESET_RESET_ASM1_WIDTH (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_RESET_RESET_ASM1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_RESET_RESET_ASM1_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_RESET_RESET_ASM1_MASK)

#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_RESET_RESERVED_15_1_MASK (0xFFFEU)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_RESET_RESERVED_15_1_SHIFT (1U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_RESET_RESERVED_15_1_WIDTH (15U)
#define X2_LANEX_DIG_RX_ADPTCTL_ADPT_RESET_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_ADPTCTL_ADPT_RESET_RESERVED_15_1_SHIFT)) & X2_LANEX_DIG_RX_ADPTCTL_ADPT_RESET_RESERVED_15_1_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_LD_VAL_1 - Stat load value for the sample counter #1 */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_LD_VAL_1_SC1_LD_VAL_MASK (0x7FFFU)
#define X2_LANEX_DIG_RX_STAT_LD_VAL_1_SC1_LD_VAL_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_LD_VAL_1_SC1_LD_VAL_WIDTH (15U)
#define X2_LANEX_DIG_RX_STAT_LD_VAL_1_SC1_LD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_LD_VAL_1_SC1_LD_VAL_SHIFT)) & X2_LANEX_DIG_RX_STAT_LD_VAL_1_SC1_LD_VAL_MASK)

#define X2_LANEX_DIG_RX_STAT_LD_VAL_1_SC1_START_MASK (0x8000U)
#define X2_LANEX_DIG_RX_STAT_LD_VAL_1_SC1_START_SHIFT (15U)
#define X2_LANEX_DIG_RX_STAT_LD_VAL_1_SC1_START_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_LD_VAL_1_SC1_START(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_LD_VAL_1_SC1_START_SHIFT)) & X2_LANEX_DIG_RX_STAT_LD_VAL_1_SC1_START_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_DATA_MSK - Stat data mask bits [15:0] */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_DATA_MSK_DATA_MSK_15_0_MASK (0xFFFFU)
#define X2_LANEX_DIG_RX_STAT_DATA_MSK_DATA_MSK_15_0_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_DATA_MSK_DATA_MSK_15_0_WIDTH (16U)
#define X2_LANEX_DIG_RX_STAT_DATA_MSK_DATA_MSK_15_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_DATA_MSK_DATA_MSK_15_0_SHIFT)) & X2_LANEX_DIG_RX_STAT_DATA_MSK_DATA_MSK_15_0_MASK)
/*! @} */

