zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name LANEX_DIG_RX_STAT_MATCH_CTL0 - Stat match controls register #0 */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_PTTRN_MSK_CR1A_4_0_MASK (0x1FU)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_PTTRN_MSK_CR1A_4_0_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_PTTRN_MSK_CR1A_4_0_WIDTH (5U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_PTTRN_MSK_CR1A_4_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL0_PTTRN_MSK_CR1A_4_0_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL0_PTTRN_MSK_CR1A_4_0_MASK)

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_PTTRN_CR1A_4_0_MASK (0x3E0U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_PTTRN_CR1A_4_0_SHIFT (5U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_PTTRN_CR1A_4_0_WIDTH (5U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_PTTRN_CR1A_4_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL0_PTTRN_CR1A_4_0_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL0_PTTRN_CR1A_4_0_MASK)

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_DATA_MSK_19_16_MASK (0x3C00U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_DATA_MSK_19_16_SHIFT (10U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_DATA_MSK_19_16_WIDTH (4U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_DATA_MSK_19_16(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL0_DATA_MSK_19_16_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL0_DATA_MSK_19_16_MASK)

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_SCOPE_DLY_MASK (0xC000U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_SCOPE_DLY_SHIFT (14U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_SCOPE_DLY_WIDTH (2U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL0_SCOPE_DLY(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL0_SCOPE_DLY_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL0_SCOPE_DLY_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_MATCH_CTL1 - Stat match controls register #1 */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1B_EN_MASK (0x1U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1B_EN_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1B_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1B_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1B_EN_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1B_EN_MASK)

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_MSK_CR1B_4_0_MASK (0x3EU)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_MSK_CR1B_4_0_SHIFT (1U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_MSK_CR1B_4_0_WIDTH (5U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_MSK_CR1B_4_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_MSK_CR1B_4_0_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_MSK_CR1B_4_0_MASK)

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1B_4_0_MASK (0x7C0U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1B_4_0_SHIFT (6U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1B_4_0_WIDTH (5U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1B_4_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1B_4_0_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1B_4_0_MASK)

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1A_ADPT_EN_MASK (0x800U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1A_ADPT_EN_SHIFT (11U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1A_ADPT_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1A_ADPT_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1A_ADPT_EN_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL1_PTTRN_CR1A_ADPT_EN_MASK)

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_RESERVED_15_12_MASK (0xF000U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_RESERVED_15_12_SHIFT (12U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_RESERVED_15_12_WIDTH (4U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL1_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL1_RESERVED_15_12_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL1_RESERVED_15_12_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_STAT_CTL0 - Stat controls register #0 */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_RESERVED_0_MASK (0x1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_RESERVED_0_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_RESERVED_0_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_RESERVED_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CTL0_RESERVED_0_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CTL0_RESERVED_0_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SHFT_SEL_VGA_MASK (0x2U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SHFT_SEL_VGA_SHIFT (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SHFT_SEL_VGA_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SHFT_SEL_VGA(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SHFT_SEL_VGA_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SHFT_SEL_VGA_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SHFT_SEL_MASK (0x4U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SHFT_SEL_SHIFT (2U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SHFT_SEL_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SHFT_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SHFT_SEL_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SHFT_SEL_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SRC_SEL_MASK (0x18U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SRC_SEL_SHIFT (3U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SRC_SEL_WIDTH (2U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SRC_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SRC_SEL_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_SRC_SEL_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_MODE_EN_MASK (0x20U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_MODE_EN_SHIFT (5U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_MODE_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_MODE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_MODE_EN_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CTL0_CORR_MODE_EN_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_SHFT_SEL_MASK (0x3C0U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_SHFT_SEL_SHIFT (6U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_SHFT_SEL_WIDTH (4U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_SHFT_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_SHFT_SEL_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_SHFT_SEL_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_SRC_SEL_MASK (0x1C00U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_SRC_SEL_SHIFT (10U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_SRC_SEL_WIDTH (3U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_SRC_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_SRC_SEL_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_SRC_SEL_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_RXCLK_SEL_MASK (0x2000U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_RXCLK_SEL_SHIFT (13U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_RXCLK_SEL_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_RXCLK_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_RXCLK_SEL_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CTL0_STAT_RXCLK_SEL_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_SC_TIMER_MODE_MASK (0x4000U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_SC_TIMER_MODE_SHIFT (14U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_SC_TIMER_MODE_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_SC_TIMER_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CTL0_SC_TIMER_MODE_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CTL0_SC_TIMER_MODE_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_SKIP_EN_MASK (0x8000U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_SKIP_EN_SHIFT (15U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_SKIP_EN_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL0_SKIP_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CTL0_SKIP_EN_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CTL0_SKIP_EN_MASK)
/*! @} */

