zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_2_SMPL_CNT1_DONE_MASK (0x8000U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_2_SMPL_CNT1_DONE_SHIFT (15U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_2_SMPL_CNT1_DONE_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_2_SMPL_CNT1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CNT_2_SMPL_CNT1_DONE_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CNT_2_SMPL_CNT1_DONE_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_STAT_CNT_3 - Stat Counter 3 Status */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_STAT_CNT_3_STAT_CNT_3_MASK (0x7FFFU)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_3_STAT_CNT_3_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_3_STAT_CNT_3_WIDTH (15U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_3_STAT_CNT_3(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CNT_3_STAT_CNT_3_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CNT_3_STAT_CNT_3_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CNT_3_SMPL_CNT1_DONE_MASK (0x8000U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_3_SMPL_CNT1_DONE_SHIFT (15U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_3_SMPL_CNT1_DONE_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_3_SMPL_CNT1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CNT_3_SMPL_CNT1_DONE_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CNT_3_SMPL_CNT1_DONE_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_STAT_CNT_4 - Stat Counter 4 Status */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_STAT_CNT_4_STAT_CNT_4_MASK (0x7FFFU)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_4_STAT_CNT_4_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_4_STAT_CNT_4_WIDTH (15U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_4_STAT_CNT_4(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CNT_4_STAT_CNT_4_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CNT_4_STAT_CNT_4_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CNT_4_SMPL_CNT1_DONE_MASK (0x8000U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_4_SMPL_CNT1_DONE_SHIFT (15U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_4_SMPL_CNT1_DONE_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_4_SMPL_CNT1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CNT_4_SMPL_CNT1_DONE_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CNT_4_SMPL_CNT1_DONE_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_STAT_CNT_5 - Stat Counter 5 Status */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_STAT_CNT_5_STAT_CNT_5_MASK (0x7FFFU)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_5_STAT_CNT_5_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_5_STAT_CNT_5_WIDTH (15U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_5_STAT_CNT_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CNT_5_STAT_CNT_5_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CNT_5_STAT_CNT_5_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CNT_5_SMPL_CNT1_DONE_MASK (0x8000U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_5_SMPL_CNT1_DONE_SHIFT (15U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_5_SMPL_CNT1_DONE_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_5_SMPL_CNT1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CNT_5_SMPL_CNT1_DONE_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CNT_5_SMPL_CNT1_DONE_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_STAT_CNT_6 - Stat Counter 6 Status */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_STAT_CNT_6_STAT_CNT_6_MASK (0x7FFFU)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_6_STAT_CNT_6_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_6_STAT_CNT_6_WIDTH (15U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_6_STAT_CNT_6(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CNT_6_STAT_CNT_6_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CNT_6_STAT_CNT_6_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CNT_6_SMPL_CNT1_DONE_MASK (0x8000U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_6_SMPL_CNT1_DONE_SHIFT (15U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_6_SMPL_CNT1_DONE_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CNT_6_SMPL_CNT1_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CNT_6_SMPL_CNT1_DONE_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CNT_6_SMPL_CNT1_DONE_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL - Calibration Comparator Control */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_PRECHRGE_CNT_MASK (0x7U)
#define X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_PRECHRGE_CNT_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_PRECHRGE_CNT_WIDTH (3U)
#define X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_PRECHRGE_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_PRECHRGE_CNT_SHIFT)) & X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_PRECHRGE_CNT_MASK)

#define X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_REF_DIV_CNT_MASK (0x38U)
#define X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_REF_DIV_CNT_SHIFT (3U)
#define X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_REF_DIV_CNT_WIDTH (3U)
#define X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_REF_DIV_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_REF_DIV_CNT_SHIFT)) & X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_REF_DIV_CNT_MASK)

#define X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_RESERVED_15_6_MASK (0xFFC0U)
#define X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_RESERVED_15_6_SHIFT (6U)
#define X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_RESERVED_15_6_WIDTH (10U)
#define X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_RESERVED_15_6_SHIFT)) & X2_LANEX_DIG_RX_STAT_CAL_COMP_CLK_CTL_RESERVED_15_6_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_MATCH_CTL2 - Stat match controls register #2 */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL2_PTTRN_CR1A_19_5_MASK (0x7FFFU)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL2_PTTRN_CR1A_19_5_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL2_PTTRN_CR1A_19_5_WIDTH (15U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL2_PTTRN_CR1A_19_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL2_PTTRN_CR1A_19_5_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL2_PTTRN_CR1A_19_5_MASK)

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL2_RESERVED_15_15_MASK (0x8000U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL2_RESERVED_15_15_SHIFT (15U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL2_RESERVED_15_15_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL2_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL2_RESERVED_15_15_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL2_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_MATCH_CTL3 - Stat match controls register #3 */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL3_PTTRN_MSK_CR1A_19_5_MASK (0x7FFFU)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL3_PTTRN_MSK_CR1A_19_5_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL3_PTTRN_MSK_CR1A_19_5_WIDTH (15U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL3_PTTRN_MSK_CR1A_19_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL3_PTTRN_MSK_CR1A_19_5_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL3_PTTRN_MSK_CR1A_19_5_MASK)

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL3_RESERVED_15_15_MASK (0x8000U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL3_RESERVED_15_15_SHIFT (15U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL3_RESERVED_15_15_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL3_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL3_RESERVED_15_15_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL3_RESERVED_15_15_MASK)
/*! @} */

