zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name LANEX_DIG_RX_STAT_MATCH_CTL4 - Stat match controls register #4 */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL4_PTTRN_CR1B_19_5_MASK (0x7FFFU)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL4_PTTRN_CR1B_19_5_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL4_PTTRN_CR1B_19_5_WIDTH (15U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL4_PTTRN_CR1B_19_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL4_PTTRN_CR1B_19_5_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL4_PTTRN_CR1B_19_5_MASK)

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL4_RESERVED_15_15_MASK (0x8000U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL4_RESERVED_15_15_SHIFT (15U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL4_RESERVED_15_15_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL4_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL4_RESERVED_15_15_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL4_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_MATCH_CTL5 - Stat match controls register #5 */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL5_PTTRN_MSK_CR1B_19_5_MASK (0x7FFFU)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL5_PTTRN_MSK_CR1B_19_5_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL5_PTTRN_MSK_CR1B_19_5_WIDTH (15U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL5_PTTRN_MSK_CR1B_19_5(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL5_PTTRN_MSK_CR1B_19_5_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL5_PTTRN_MSK_CR1B_19_5_MASK)

#define X2_LANEX_DIG_RX_STAT_MATCH_CTL5_RESERVED_15_15_MASK (0x8000U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL5_RESERVED_15_15_SHIFT (15U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL5_RESERVED_15_15_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_MATCH_CTL5_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_MATCH_CTL5_RESERVED_15_15_SHIFT)) & X2_LANEX_DIG_RX_STAT_MATCH_CTL5_RESERVED_15_15_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_STAT_CTL2 - Stat controls register #2 */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_STAT_CTL2_DATA_DLY_SEL_2_MASK (0x1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL2_DATA_DLY_SEL_2_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL2_DATA_DLY_SEL_2_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL2_DATA_DLY_SEL_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CTL2_DATA_DLY_SEL_2_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CTL2_DATA_DLY_SEL_2_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CTL2_SCOPE_DLY_2_MASK (0x2U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL2_SCOPE_DLY_2_SHIFT (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL2_SCOPE_DLY_2_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL2_SCOPE_DLY_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CTL2_SCOPE_DLY_2_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CTL2_SCOPE_DLY_2_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_CTL2_RESERVED_15_2_MASK (0xFFFCU)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL2_RESERVED_15_2_SHIFT (2U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL2_RESERVED_15_2_WIDTH (14U)
#define X2_LANEX_DIG_RX_STAT_STAT_CTL2_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_CTL2_RESERVED_15_2_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_CTL2_RESERVED_15_2_MASK)
/*! @} */

/*! @name LANEX_DIG_RX_STAT_STAT_STOP - Stat stop register */
/*! @{ */

#define X2_LANEX_DIG_RX_STAT_STAT_STOP_SC1_STOP_MASK (0x1U)
#define X2_LANEX_DIG_RX_STAT_STAT_STOP_SC1_STOP_SHIFT (0U)
#define X2_LANEX_DIG_RX_STAT_STAT_STOP_SC1_STOP_WIDTH (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_STOP_SC1_STOP(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_STOP_SC1_STOP_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_STOP_SC1_STOP_MASK)

#define X2_LANEX_DIG_RX_STAT_STAT_STOP_RESERVED_15_1_MASK (0xFFFEU)
#define X2_LANEX_DIG_RX_STAT_STAT_STOP_RESERVED_15_1_SHIFT (1U)
#define X2_LANEX_DIG_RX_STAT_STAT_STOP_RESERVED_15_1_WIDTH (15U)
#define X2_LANEX_DIG_RX_STAT_STAT_STOP_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_RX_STAT_STAT_STOP_RESERVED_15_1_SHIFT)) & X2_LANEX_DIG_RX_STAT_STAT_STOP_RESERVED_15_1_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_TX_OVRD_OUT - Override values for TX signals going to ANA */
/*! @{ */

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_CLK_SHIFT_MASK (0x1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_CLK_SHIFT_SHIFT (0U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_CLK_SHIFT_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_CLK_SHIFT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_CLK_SHIFT_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_CLK_SHIFT_MASK)

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_DATA_EN_MASK (0x2U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_DATA_EN_SHIFT (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_DATA_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_DATA_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_DATA_EN_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_DATA_EN_MASK)

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_REFGEN_EN_MASK (0x4U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_REFGEN_EN_SHIFT (2U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_REFGEN_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_REFGEN_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_REFGEN_EN_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_REFGEN_EN_MASK)

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_VCM_HOLD_MASK (0x8U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_VCM_HOLD_SHIFT (3U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_VCM_HOLD_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_VCM_HOLD(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_VCM_HOLD_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_VCM_HOLD_MASK)

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_CLK_EN_MASK (0x10U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_CLK_EN_SHIFT (4U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_CLK_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_CLK_EN_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_CLK_EN_MASK)

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_WORD_CLK_EN_MASK (0x20U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_WORD_CLK_EN_SHIFT (5U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_WORD_CLK_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_WORD_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_WORD_CLK_EN_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_WORD_CLK_EN_MASK)

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_MPLLA_CLK_EN_MASK (0x40U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_MPLLA_CLK_EN_SHIFT (6U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_MPLLA_CLK_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_MPLLA_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_MPLLA_CLK_EN_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_MPLLA_CLK_EN_MASK)

