zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_MPLLB_CLK_EN_MASK (0x80U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_MPLLB_CLK_EN_SHIFT (7U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_MPLLB_CLK_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_MPLLB_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_MPLLB_CLK_EN_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_MPLLB_CLK_EN_MASK)

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_RESET_MASK (0x100U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_RESET_SHIFT (8U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_RESET_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_RESET(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_RESET_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_RESET_MASK)

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_SERIAL_EN_MASK (0x200U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_SERIAL_EN_SHIFT (9U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_SERIAL_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_SERIAL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_SERIAL_EN_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_SERIAL_EN_MASK)

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_DATA_RATE_MASK (0xC00U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_DATA_RATE_SHIFT (10U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_DATA_RATE_WIDTH (2U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_DATA_RATE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_DATA_RATE_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_ANA_DATA_RATE_MASK)

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_RESERVED_MASK (0x1000U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_RESERVED_SHIFT (12U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_RESERVED_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_RESERVED_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_RESERVED_MASK)

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_DIV4_EN_MASK (0x2000U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_DIV4_EN_SHIFT (13U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_DIV4_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_DIV4_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_DIV4_EN_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_DIV4_EN_MASK)

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_RXDET_EN_MASK (0x4000U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_RXDET_EN_SHIFT (14U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_RXDET_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_RXDET_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_RXDET_EN_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_RXDET_EN_MASK)

#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_OVRD_EN_MASK (0x8000U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_OVRD_EN_SHIFT (15U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ANA_TX_OVRD_OUT_TX_OVRD_EN_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT - Override value for TX termination code going to ANA */
/*! @{ */

#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_TERM_CODE_MASK (0x3FFU)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_TERM_CODE_SHIFT (0U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_TERM_CODE_WIDTH (10U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_TERM_CODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_TERM_CODE_SHIFT)) & X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_TERM_CODE_MASK)

#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_TERM_OVRD_EN_MASK (0x400U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_TERM_OVRD_EN_SHIFT (10U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_TERM_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_TERM_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_TERM_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_TERM_OVRD_EN_MASK)

#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_CLK_LB_EN_MASK (0x800U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_CLK_LB_EN_SHIFT (11U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_CLK_LB_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_CLK_LB_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_CLK_LB_EN_SHIFT)) & X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_TX_CLK_LB_EN_MASK)

#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_RESERVED_15_12_MASK (0xF000U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_RESERVED_15_12_SHIFT (12U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_RESERVED_15_12_WIDTH (4U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_RESERVED_15_12_SHIFT)) & X2_LANEX_DIG_ANA_TX_TERM_CODE_OVRD_OUT_RESERVED_15_12_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT - Override value for TX termination code clocks going to ANA */
/*! @{ */

#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_DN_CLK_MASK (0x1U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_DN_CLK_SHIFT (0U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_DN_CLK_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_DN_CLK(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_DN_CLK_SHIFT)) & X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_DN_CLK_MASK)

#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_UP_CLK_MASK (0x2U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_UP_CLK_SHIFT (1U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_UP_CLK_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_UP_CLK(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_UP_CLK_SHIFT)) & X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_UP_CLK_MASK)

#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_CLK_SELF_CLEAR_DISABLE_MASK (0x4U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_CLK_SELF_CLEAR_DISABLE_SHIFT (2U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_CLK_SELF_CLEAR_DISABLE_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_CLK_SELF_CLEAR_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_CLK_SELF_CLEAR_DISABLE_SHIFT)) & X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_TX_TERM_CLK_SELF_CLEAR_DISABLE_MASK)

#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_RESERVED_15_3_MASK (0xFFF8U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_RESERVED_15_3_SHIFT (3U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_RESERVED_15_3_WIDTH (13U)
#define X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_RESERVED_15_3(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_RESERVED_15_3_SHIFT)) & X2_LANEX_DIG_ANA_TX_TERM_CODE_CLK_OVRD_OUT_RESERVED_15_3_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0 - Override values for TX EQ signals going to ANA register #0 */
/*! @{ */

