zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_ANA_LOAD_CLK_MASK (0x1U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_ANA_LOAD_CLK_SHIFT (0U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_ANA_LOAD_CLK_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_ANA_LOAD_CLK(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_ANA_LOAD_CLK_SHIFT)) & X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_ANA_LOAD_CLK_MASK)

#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_ANA_CTRL_ATTEN_13_0_MASK (0x7FFEU)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_ANA_CTRL_ATTEN_13_0_SHIFT (1U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_ANA_CTRL_ATTEN_13_0_WIDTH (14U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_ANA_CTRL_ATTEN_13_0(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_ANA_CTRL_ATTEN_13_0_SHIFT)) & X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_ANA_CTRL_ATTEN_13_0_MASK)

#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_EQ_OVRD_EN_MASK (0x8000U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_EQ_OVRD_EN_SHIFT (15U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_EQ_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_EQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_EQ_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_0_TX_EQ_OVRD_EN_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1 - Override values for TX EQ signals going to ANA register #1 */
/*! @{ */

#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1_TX_ANA_CTRL_ATTEN_19_14_MASK (0x3FU)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1_TX_ANA_CTRL_ATTEN_19_14_SHIFT (0U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1_TX_ANA_CTRL_ATTEN_19_14_WIDTH (6U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1_TX_ANA_CTRL_ATTEN_19_14(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1_TX_ANA_CTRL_ATTEN_19_14_SHIFT)) & X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1_TX_ANA_CTRL_ATTEN_19_14_MASK)

#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1_RESERVED_15_6_MASK (0xFFC0U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1_RESERVED_15_6_SHIFT (6U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1_RESERVED_15_6_WIDTH (10U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1_RESERVED_15_6(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1_RESERVED_15_6_SHIFT)) & X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_1_RESERVED_15_6_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2 - Override values for TX EQ signals going to ANA register #2 */
/*! @{ */

#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_RESERVED_MASK (0x7FU)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_RESERVED_SHIFT (0U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_RESERVED_WIDTH (7U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_RESERVED_SHIFT)) & X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_RESERVED_MASK)

#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_TX_ANA_CTRL_PRE_MASK (0x1F80U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_TX_ANA_CTRL_PRE_SHIFT (7U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_TX_ANA_CTRL_PRE_WIDTH (6U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_TX_ANA_CTRL_PRE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_TX_ANA_CTRL_PRE_SHIFT)) & X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_TX_ANA_CTRL_PRE_MASK)

#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_RESERVED_15_13_MASK (0xE000U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_RESERVED_15_13_SHIFT (13U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_RESERVED_15_13_WIDTH (3U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_RESERVED_15_13_SHIFT)) & X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_2_RESERVED_15_13_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3 - Override values for TX EQ signals going to ANA register #3 */
/*! @{ */

#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3_TX_ANA_CTRL_POST_MASK (0xFFU)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3_TX_ANA_CTRL_POST_SHIFT (0U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3_TX_ANA_CTRL_POST_WIDTH (8U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3_TX_ANA_CTRL_POST(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3_TX_ANA_CTRL_POST_SHIFT)) & X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3_TX_ANA_CTRL_POST_MASK)

#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3_RESERVED_15_8_SHIFT)) & X2_LANEX_DIG_ANA_TX_EQ_OVRD_OUT_3_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_RX_CTL_OVRD_OUT - Override values for RX control signals going to ANA */
/*! @{ */

#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RESERVED_MASK (0x1U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RESERVED_SHIFT (0U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RESERVED_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RESERVED_SHIFT)) & X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RESERVED_MASK)

#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DATA_RATE_MASK (0x6U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DATA_RATE_SHIFT (1U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DATA_RATE_WIDTH (2U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DATA_RATE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DATA_RATE_SHIFT)) & X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DATA_RATE_MASK)

#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_WORD_CLK_EN_MASK (0x8U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_WORD_CLK_EN_SHIFT (3U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_WORD_CLK_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_WORD_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_WORD_CLK_EN_SHIFT)) & X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_WORD_CLK_EN_MASK)

#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DIV4_EN_MASK (0x10U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DIV4_EN_SHIFT (4U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DIV4_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DIV4_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DIV4_EN_SHIFT)) & X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DIV4_EN_MASK)

#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DFE_TAPS_EN_MASK (0x20U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DFE_TAPS_EN_SHIFT (5U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DFE_TAPS_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DFE_TAPS_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DFE_TAPS_EN_SHIFT)) & X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_DFE_TAPS_EN_MASK)

#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_ADAPTATION_EN_MASK (0x40U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_ADAPTATION_EN_SHIFT (6U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_ADAPTATION_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_ADAPTATION_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_ADAPTATION_EN_SHIFT)) & X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_ANA_ADAPTATION_EN_MASK)

#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_LBK_CLK_EN_MASK (0x80U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_LBK_CLK_EN_SHIFT (7U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_LBK_CLK_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_LBK_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_LBK_CLK_EN_SHIFT)) & X2_LANEX_DIG_ANA_RX_CTL_OVRD_OUT_RX_LBK_CLK_EN_MASK)

