zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_VCO_CNTR_EN_MASK (0x2000U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_VCO_CNTR_EN_SHIFT (13U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_VCO_CNTR_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_VCO_CNTR_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_VCO_CNTR_EN_SHIFT)) & X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_VCO_CNTR_EN_MASK)

#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_VCO_CNTR_CLK_MASK (0x4000U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_VCO_CNTR_CLK_SHIFT (14U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_VCO_CNTR_CLK_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_VCO_CNTR_CLK(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_VCO_CNTR_CLK_SHIFT)) & X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_ANA_VCO_CNTR_CLK_MASK)

#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_CDR_FREQ_TUNE_OVRD_EN_MASK (0x8000U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_CDR_FREQ_TUNE_OVRD_EN_SHIFT (15U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_CDR_FREQ_TUNE_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_CDR_FREQ_TUNE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_CDR_FREQ_TUNE_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_0_RX_CDR_FREQ_TUNE_OVRD_EN_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1 - Override values for RX VCO signals going to ANA #1 */
/*! @{ */

#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RX_ANA_CDR_VCO_LOWFREQ_MASK (0x1U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RX_ANA_CDR_VCO_LOWFREQ_SHIFT (0U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RX_ANA_CDR_VCO_LOWFREQ_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RX_ANA_CDR_VCO_LOWFREQ(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RX_ANA_CDR_VCO_LOWFREQ_SHIFT)) & X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RX_ANA_CDR_VCO_LOWFREQ_MASK)

#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RX_ANA_VCO_CNTR_PD_MASK (0x2U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RX_ANA_VCO_CNTR_PD_SHIFT (1U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RX_ANA_VCO_CNTR_PD_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RX_ANA_VCO_CNTR_PD(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RX_ANA_VCO_CNTR_PD_SHIFT)) & X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RX_ANA_VCO_CNTR_PD_MASK)

#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RESERVED_15_2_MASK (0xFFFCU)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RESERVED_15_2_SHIFT (2U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RESERVED_15_2_WIDTH (14U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RESERVED_15_2_SHIFT)) & X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_1_RESERVED_15_2_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2 - Override values for RX VCO signals going to ANA #2 */
/*! @{ */

#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_RX_ANA_CDR_FREQ_TUNE_CLK_MASK (0x1U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_RX_ANA_CDR_FREQ_TUNE_CLK_SHIFT (0U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_RX_ANA_CDR_FREQ_TUNE_CLK_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_RX_ANA_CDR_FREQ_TUNE_CLK(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_RX_ANA_CDR_FREQ_TUNE_CLK_SHIFT)) & X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_RX_ANA_CDR_FREQ_TUNE_CLK_MASK)

#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_CDR_FREQ_TUNE_CLK_SELF_CLEAR_DISABLE_MASK (0x2U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_CDR_FREQ_TUNE_CLK_SELF_CLEAR_DISABLE_SHIFT (1U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_CDR_FREQ_TUNE_CLK_SELF_CLEAR_DISABLE_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_CDR_FREQ_TUNE_CLK_SELF_CLEAR_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_CDR_FREQ_TUNE_CLK_SELF_CLEAR_DISABLE_SHIFT)) & X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_CDR_FREQ_TUNE_CLK_SELF_CLEAR_DISABLE_MASK)

#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_RESERVED_15_2_MASK (0xFFFCU)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_RESERVED_15_2_SHIFT (2U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_RESERVED_15_2_WIDTH (14U)
#define X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_RESERVED_15_2_SHIFT)) & X2_LANEX_DIG_ANA_RX_VCO_OVRD_OUT_2_RESERVED_15_2_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_RX_CAL - Sets values for RX CAL signals going to ANA register */
/*! @{ */

#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MUXA_SEL_MASK (0x1FU)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MUXA_SEL_SHIFT (0U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MUXA_SEL_WIDTH (5U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MUXA_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MUXA_SEL_SHIFT)) & X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MUXA_SEL_MASK)

#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MUXB_SEL_MASK (0x3E0U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MUXB_SEL_SHIFT (5U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MUXB_SEL_WIDTH (5U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MUXB_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MUXB_SEL_SHIFT)) & X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MUXB_SEL_MASK)

#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_LPFBYP_EN_MASK (0x400U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_LPFBYP_EN_SHIFT (10U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_LPFBYP_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_LPFBYP_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_LPFBYP_EN_SHIFT)) & X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_LPFBYP_EN_MASK)

#define X2_LANEX_DIG_ANA_RX_CAL_RESERVED_MASK    (0x800U)
#define X2_LANEX_DIG_ANA_RX_CAL_RESERVED_SHIFT   (11U)
#define X2_LANEX_DIG_ANA_RX_CAL_RESERVED_WIDTH   (1U)
#define X2_LANEX_DIG_ANA_RX_CAL_RESERVED(x)      (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CAL_RESERVED_SHIFT)) & X2_LANEX_DIG_ANA_RX_CAL_RESERVED_MASK)

#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_SLICER_CAL_EN_MASK (0x1000U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_SLICER_CAL_EN_SHIFT (12U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_SLICER_CAL_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_SLICER_CAL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_SLICER_CAL_EN_SHIFT)) & X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_SLICER_CAL_EN_MASK)

#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MODE_MASK (0x6000U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MODE_SHIFT (13U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MODE_WIDTH (2U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MODE_SHIFT)) & X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_MODE_MASK)

#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_COMP_EN_MASK (0x8000U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_COMP_EN_SHIFT (15U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_COMP_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_COMP_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_COMP_EN_SHIFT)) & X2_LANEX_DIG_ANA_RX_CAL_RX_ANA_CAL_COMP_EN_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_RX_DAC_CTRL - Sets values for RX DAC CTRL value going to ANA */
/*! @{ */

