zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_AFE_UPDATE_SELF_CLEAR_DISABLE_MASK (0x2U)
#define X2_LANEX_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_AFE_UPDATE_SELF_CLEAR_DISABLE_SHIFT (1U)
#define X2_LANEX_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_AFE_UPDATE_SELF_CLEAR_DISABLE_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_AFE_UPDATE_SELF_CLEAR_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_AFE_UPDATE_SELF_CLEAR_DISABLE_SHIFT)) & X2_LANEX_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_AFE_UPDATE_SELF_CLEAR_DISABLE_MASK)

#define X2_LANEX_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_RESERVED_15_2_MASK (0xFFFCU)
#define X2_LANEX_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_RESERVED_15_2_SHIFT (2U)
#define X2_LANEX_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_RESERVED_15_2_WIDTH (14U)
#define X2_LANEX_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_RESERVED_15_2_SHIFT)) & X2_LANEX_DIG_ANA_RX_ANA_SIGNALS_CHANGES_ENABLE_RESERVED_15_2_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK - Phase adjust clock signal */
/*! @{ */

#define X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_RX_ANA_IQ_PHASE_ADJUST_CLK_MASK (0x1U)
#define X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_RX_ANA_IQ_PHASE_ADJUST_CLK_SHIFT (0U)
#define X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_RX_ANA_IQ_PHASE_ADJUST_CLK_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_RX_ANA_IQ_PHASE_ADJUST_CLK(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_RX_ANA_IQ_PHASE_ADJUST_CLK_SHIFT)) & X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_RX_ANA_IQ_PHASE_ADJUST_CLK_MASK)

#define X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_PHASE_ADJUST_SELF_CLEAR_DISABLE_MASK (0x2U)
#define X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_PHASE_ADJUST_SELF_CLEAR_DISABLE_SHIFT (1U)
#define X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_PHASE_ADJUST_SELF_CLEAR_DISABLE_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_PHASE_ADJUST_SELF_CLEAR_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_PHASE_ADJUST_SELF_CLEAR_DISABLE_SHIFT)) & X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_PHASE_ADJUST_SELF_CLEAR_DISABLE_MASK)

#define X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_RESERVED_15_2_MASK (0xFFFCU)
#define X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_RESERVED_15_2_SHIFT (2U)
#define X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_RESERVED_15_2_WIDTH (14U)
#define X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_RESERVED_15_2_SHIFT)) & X2_LANEX_DIG_ANA_RX_ANA_PHASE_ADJUST_CLK_RESERVED_15_2_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_STATUS_0 - Lane input status register #0 */
/*! @{ */

#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_CLK_SHIFT_ACK_MASK (0x1U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_CLK_SHIFT_ACK_SHIFT (0U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_CLK_SHIFT_ACK_WIDTH (1U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_CLK_SHIFT_ACK(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_CLK_SHIFT_ACK_SHIFT)) & X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_CLK_SHIFT_ACK_MASK)

#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_RXDETP_RESULT_MASK (0x2U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_RXDETP_RESULT_SHIFT (1U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_RXDETP_RESULT_WIDTH (1U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_RXDETP_RESULT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_RXDETP_RESULT_SHIFT)) & X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_RXDETP_RESULT_MASK)

#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_RXDETM_RESULT_MASK (0x4U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_RXDETM_RESULT_SHIFT (2U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_RXDETM_RESULT_WIDTH (1U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_RXDETM_RESULT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_RXDETM_RESULT_SHIFT)) & X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_RXDETM_RESULT_MASK)

#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_LOOPBACK_EN_MASK (0x8U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_LOOPBACK_EN_SHIFT (3U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_LOOPBACK_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_LOOPBACK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_LOOPBACK_EN_SHIFT)) & X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_LOOPBACK_EN_MASK)

#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_CLK_LB_EN_MASK (0x10U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_CLK_LB_EN_SHIFT (4U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_CLK_LB_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_CLK_LB_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_CLK_LB_EN_SHIFT)) & X2_LANEX_DIG_ANA_STATUS_0_TX_ANA_CLK_LB_EN_MASK)

#define X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_LOS_MASK (0x20U)
#define X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_LOS_SHIFT (5U)
#define X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_LOS_WIDTH (1U)
#define X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_LOS(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_LOS_SHIFT)) & X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_LOS_MASK)

#define X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_CAL_RESULT_MASK (0x40U)
#define X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_CAL_RESULT_SHIFT (6U)
#define X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_CAL_RESULT_WIDTH (1U)
#define X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_CAL_RESULT(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_CAL_RESULT_SHIFT)) & X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_CAL_RESULT_MASK)

#define X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_SCOPE_DATA_MASK (0x80U)
#define X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_SCOPE_DATA_SHIFT (7U)
#define X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_SCOPE_DATA_WIDTH (1U)
#define X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_SCOPE_DATA(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_SCOPE_DATA_SHIFT)) & X2_LANEX_DIG_ANA_STATUS_0_RX_ANA_SCOPE_DATA_MASK)

#define X2_LANEX_DIG_ANA_STATUS_0_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_DIG_ANA_STATUS_0_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_DIG_ANA_STATUS_0_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_DIG_ANA_STATUS_0_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_STATUS_0_RESERVED_15_8_SHIFT)) & X2_LANEX_DIG_ANA_STATUS_0_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_STATUS_1 - Lane input status register #1 */
/*! @{ */

#define X2_LANEX_DIG_ANA_STATUS_1_RX_ANA_VCO_CNTR_MASK (0x1FFFU)
#define X2_LANEX_DIG_ANA_STATUS_1_RX_ANA_VCO_CNTR_SHIFT (0U)
#define X2_LANEX_DIG_ANA_STATUS_1_RX_ANA_VCO_CNTR_WIDTH (13U)
#define X2_LANEX_DIG_ANA_STATUS_1_RX_ANA_VCO_CNTR(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_STATUS_1_RX_ANA_VCO_CNTR_SHIFT)) & X2_LANEX_DIG_ANA_STATUS_1_RX_ANA_VCO_CNTR_MASK)

