zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_DIG_ANA_STATUS_1_RESERVED_15_13_MASK (0xE000U)
#define X2_LANEX_DIG_ANA_STATUS_1_RESERVED_15_13_SHIFT (13U)
#define X2_LANEX_DIG_ANA_STATUS_1_RESERVED_15_13_WIDTH (3U)
#define X2_LANEX_DIG_ANA_STATUS_1_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_STATUS_1_RESERVED_15_13_SHIFT)) & X2_LANEX_DIG_ANA_STATUS_1_RESERVED_15_13_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT - Override value for RX termination code going to ANA */
/*! @{ */

#define X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RX_TERM_CODE_MASK (0x3FU)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RX_TERM_CODE_SHIFT (0U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RX_TERM_CODE_WIDTH (6U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RX_TERM_CODE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RX_TERM_CODE_SHIFT)) & X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RX_TERM_CODE_MASK)

#define X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RX_TERM_OVRD_EN_MASK (0x40U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RX_TERM_OVRD_EN_SHIFT (6U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RX_TERM_OVRD_EN_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RX_TERM_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RX_TERM_OVRD_EN_SHIFT)) & X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RX_TERM_OVRD_EN_MASK)

#define X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RESERVED_15_7_MASK (0xFF80U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RESERVED_15_7_SHIFT (7U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RESERVED_15_7_WIDTH (9U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RESERVED_15_7(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RESERVED_15_7_SHIFT)) & X2_LANEX_DIG_ANA_RX_TERM_CODE_OVRD_OUT_RESERVED_15_7_MASK)
/*! @} */

/*! @name LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT - Override value for RX termination code clock going to ANA */
/*! @{ */

#define X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RX_TERM_CLK_MASK (0x1U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RX_TERM_CLK_SHIFT (0U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RX_TERM_CLK_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RX_TERM_CLK(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RX_TERM_CLK_SHIFT)) & X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RX_TERM_CLK_MASK)

#define X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RX_TERM_CLK_SELF_CLEAR_DISABLE_MASK (0x2U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RX_TERM_CLK_SELF_CLEAR_DISABLE_SHIFT (1U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RX_TERM_CLK_SELF_CLEAR_DISABLE_WIDTH (1U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RX_TERM_CLK_SELF_CLEAR_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RX_TERM_CLK_SELF_CLEAR_DISABLE_SHIFT)) & X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RX_TERM_CLK_SELF_CLEAR_DISABLE_MASK)

#define X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RESERVED_15_2_MASK (0xFFFCU)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RESERVED_15_2_SHIFT (2U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RESERVED_15_2_WIDTH (14U)
#define X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RESERVED_15_2_SHIFT)) & X2_LANEX_DIG_ANA_RX_TERM_CODE_CLK_OVRD_OUT_RESERVED_15_2_MASK)
/*! @} */

/*! @name LANEX_ANA_TX_OVRD_MEAS - TX_OVRD_MEAS */
/*! @{ */

#define X2_LANEX_ANA_TX_OVRD_MEAS_ovrd_clk_shift_MASK (0x1U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_ovrd_clk_shift_SHIFT (0U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_ovrd_clk_shift_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_ovrd_clk_shift(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_MEAS_ovrd_clk_shift_SHIFT)) & X2_LANEX_ANA_TX_OVRD_MEAS_ovrd_clk_shift_MASK)

#define X2_LANEX_ANA_TX_OVRD_MEAS_clk_shift_reg_MASK (0x2U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_clk_shift_reg_SHIFT (1U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_clk_shift_reg_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_clk_shift_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_MEAS_clk_shift_reg_SHIFT)) & X2_LANEX_ANA_TX_OVRD_MEAS_clk_shift_reg_MASK)

#define X2_LANEX_ANA_TX_OVRD_MEAS_meas_samp_m_MASK (0x4U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_meas_samp_m_SHIFT (2U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_meas_samp_m_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_meas_samp_m(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_MEAS_meas_samp_m_SHIFT)) & X2_LANEX_ANA_TX_OVRD_MEAS_meas_samp_m_MASK)

#define X2_LANEX_ANA_TX_OVRD_MEAS_meas_samp_p_MASK (0x8U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_meas_samp_p_SHIFT (3U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_meas_samp_p_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_meas_samp_p(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_MEAS_meas_samp_p_SHIFT)) & X2_LANEX_ANA_TX_OVRD_MEAS_meas_samp_p_MASK)

#define X2_LANEX_ANA_TX_OVRD_MEAS_ovrd_vcm_hold_MASK (0x10U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_ovrd_vcm_hold_SHIFT (4U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_ovrd_vcm_hold_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_ovrd_vcm_hold(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_MEAS_ovrd_vcm_hold_SHIFT)) & X2_LANEX_ANA_TX_OVRD_MEAS_ovrd_vcm_hold_MASK)

#define X2_LANEX_ANA_TX_OVRD_MEAS_vcm_hold_reg_MASK (0x20U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_vcm_hold_reg_SHIFT (5U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_vcm_hold_reg_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_vcm_hold_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_MEAS_vcm_hold_reg_SHIFT)) & X2_LANEX_ANA_TX_OVRD_MEAS_vcm_hold_reg_MASK)

#define X2_LANEX_ANA_TX_OVRD_MEAS_pull_up_reg_MASK (0x40U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_pull_up_reg_SHIFT (6U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_pull_up_reg_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_pull_up_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_MEAS_pull_up_reg_SHIFT)) & X2_LANEX_ANA_TX_OVRD_MEAS_pull_up_reg_MASK)

#define X2_LANEX_ANA_TX_OVRD_MEAS_pull_dn_reg_MASK (0x80U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_pull_dn_reg_SHIFT (7U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_pull_dn_reg_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_pull_dn_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_MEAS_pull_dn_reg_SHIFT)) & X2_LANEX_ANA_TX_OVRD_MEAS_pull_dn_reg_MASK)

#define X2_LANEX_ANA_TX_OVRD_MEAS_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_TX_OVRD_MEAS_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_MEAS_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_TX_OVRD_MEAS_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_TX_PWR_OVRD - TX_PWR_OVRD */
/*! @{ */

#define X2_LANEX_ANA_TX_PWR_OVRD_ovrd_tx_loopback_MASK (0x1U)
#define X2_LANEX_ANA_TX_PWR_OVRD_ovrd_tx_loopback_SHIFT (0U)
#define X2_LANEX_ANA_TX_PWR_OVRD_ovrd_tx_loopback_WIDTH (1U)
#define X2_LANEX_ANA_TX_PWR_OVRD_ovrd_tx_loopback(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_PWR_OVRD_ovrd_tx_loopback_SHIFT)) & X2_LANEX_ANA_TX_PWR_OVRD_ovrd_tx_loopback_MASK)

