zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_ANA_TX_ATB1_RESERVED_15_8_MASK  (0xFF00U)
#define X2_LANEX_ANA_TX_ATB1_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_TX_ATB1_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_TX_ATB1_RESERVED_15_8(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_ATB1_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_TX_ATB1_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_TX_ATB2 - TX_ATB2 */
/*! @{ */

#define X2_LANEX_ANA_TX_ATB2_atb_vcm_MASK        (0x1U)
#define X2_LANEX_ANA_TX_ATB2_atb_vcm_SHIFT       (0U)
#define X2_LANEX_ANA_TX_ATB2_atb_vcm_WIDTH       (1U)
#define X2_LANEX_ANA_TX_ATB2_atb_vcm(x)          (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_ATB2_atb_vcm_SHIFT)) & X2_LANEX_ANA_TX_ATB2_atb_vcm_MASK)

#define X2_LANEX_ANA_TX_ATB2_atb_txsm_MASK       (0x2U)
#define X2_LANEX_ANA_TX_ATB2_atb_txsm_SHIFT      (1U)
#define X2_LANEX_ANA_TX_ATB2_atb_txsm_WIDTH      (1U)
#define X2_LANEX_ANA_TX_ATB2_atb_txsm(x)         (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_ATB2_atb_txsm_SHIFT)) & X2_LANEX_ANA_TX_ATB2_atb_txsm_MASK)

#define X2_LANEX_ANA_TX_ATB2_atb_txsp_MASK       (0x4U)
#define X2_LANEX_ANA_TX_ATB2_atb_txsp_SHIFT      (2U)
#define X2_LANEX_ANA_TX_ATB2_atb_txsp_WIDTH      (1U)
#define X2_LANEX_ANA_TX_ATB2_atb_txsp(x)         (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_ATB2_atb_txsp_SHIFT)) & X2_LANEX_ANA_TX_ATB2_atb_txsp_MASK)

#define X2_LANEX_ANA_TX_ATB2_atb_txfm_MASK       (0x8U)
#define X2_LANEX_ANA_TX_ATB2_atb_txfm_SHIFT      (3U)
#define X2_LANEX_ANA_TX_ATB2_atb_txfm_WIDTH      (1U)
#define X2_LANEX_ANA_TX_ATB2_atb_txfm(x)         (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_ATB2_atb_txfm_SHIFT)) & X2_LANEX_ANA_TX_ATB2_atb_txfm_MASK)

#define X2_LANEX_ANA_TX_ATB2_atb_txfp_MASK       (0x10U)
#define X2_LANEX_ANA_TX_ATB2_atb_txfp_SHIFT      (4U)
#define X2_LANEX_ANA_TX_ATB2_atb_txfp_WIDTH      (1U)
#define X2_LANEX_ANA_TX_ATB2_atb_txfp(x)         (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_ATB2_atb_txfp_SHIFT)) & X2_LANEX_ANA_TX_ATB2_atb_txfp_MASK)

#define X2_LANEX_ANA_TX_ATB2_atb_rxdetref_MASK   (0x20U)
#define X2_LANEX_ANA_TX_ATB2_atb_rxdetref_SHIFT  (5U)
#define X2_LANEX_ANA_TX_ATB2_atb_rxdetref_WIDTH  (1U)
#define X2_LANEX_ANA_TX_ATB2_atb_rxdetref(x)     (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_ATB2_atb_rxdetref_SHIFT)) & X2_LANEX_ANA_TX_ATB2_atb_rxdetref_MASK)

#define X2_LANEX_ANA_TX_ATB2_atb_nbias_MASK      (0x40U)
#define X2_LANEX_ANA_TX_ATB2_atb_nbias_SHIFT     (6U)
#define X2_LANEX_ANA_TX_ATB2_atb_nbias_WIDTH     (1U)
#define X2_LANEX_ANA_TX_ATB2_atb_nbias(x)        (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_ATB2_atb_nbias_SHIFT)) & X2_LANEX_ANA_TX_ATB2_atb_nbias_MASK)

#define X2_LANEX_ANA_TX_ATB2_atb_pbias_MASK      (0x80U)
#define X2_LANEX_ANA_TX_ATB2_atb_pbias_SHIFT     (7U)
#define X2_LANEX_ANA_TX_ATB2_atb_pbias_WIDTH     (1U)
#define X2_LANEX_ANA_TX_ATB2_atb_pbias(x)        (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_ATB2_atb_pbias_SHIFT)) & X2_LANEX_ANA_TX_ATB2_atb_pbias_MASK)

#define X2_LANEX_ANA_TX_ATB2_RESERVED_15_8_MASK  (0xFF00U)
#define X2_LANEX_ANA_TX_ATB2_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_TX_ATB2_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_TX_ATB2_RESERVED_15_8(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_ATB2_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_TX_ATB2_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_TX_VBOOST - TX_VBOOST */
/*! @{ */

#define X2_LANEX_ANA_TX_VBOOST_meas_atb_vph_half_MASK (0x1U)
#define X2_LANEX_ANA_TX_VBOOST_meas_atb_vph_half_SHIFT (0U)
#define X2_LANEX_ANA_TX_VBOOST_meas_atb_vph_half_WIDTH (1U)
#define X2_LANEX_ANA_TX_VBOOST_meas_atb_vph_half(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_VBOOST_meas_atb_vph_half_SHIFT)) & X2_LANEX_ANA_TX_VBOOST_meas_atb_vph_half_MASK)

#define X2_LANEX_ANA_TX_VBOOST_atb_s_enable_MASK (0x2U)
#define X2_LANEX_ANA_TX_VBOOST_atb_s_enable_SHIFT (1U)
#define X2_LANEX_ANA_TX_VBOOST_atb_s_enable_WIDTH (1U)
#define X2_LANEX_ANA_TX_VBOOST_atb_s_enable(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_VBOOST_atb_s_enable_SHIFT)) & X2_LANEX_ANA_TX_VBOOST_atb_s_enable_MASK)

#define X2_LANEX_ANA_TX_VBOOST_override_vref_boost_ref_MASK (0x4U)
#define X2_LANEX_ANA_TX_VBOOST_override_vref_boost_ref_SHIFT (2U)
#define X2_LANEX_ANA_TX_VBOOST_override_vref_boost_ref_WIDTH (1U)
#define X2_LANEX_ANA_TX_VBOOST_override_vref_boost_ref(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_VBOOST_override_vref_boost_ref_SHIFT)) & X2_LANEX_ANA_TX_VBOOST_override_vref_boost_ref_MASK)

#define X2_LANEX_ANA_TX_VBOOST_atb_vboost_vref_MASK (0x8U)
#define X2_LANEX_ANA_TX_VBOOST_atb_vboost_vref_SHIFT (3U)
#define X2_LANEX_ANA_TX_VBOOST_atb_vboost_vref_WIDTH (1U)
#define X2_LANEX_ANA_TX_VBOOST_atb_vboost_vref(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_VBOOST_atb_vboost_vref_SHIFT)) & X2_LANEX_ANA_TX_VBOOST_atb_vboost_vref_MASK)

#define X2_LANEX_ANA_TX_VBOOST_atb_vboost_MASK   (0x10U)
#define X2_LANEX_ANA_TX_VBOOST_atb_vboost_SHIFT  (4U)
#define X2_LANEX_ANA_TX_VBOOST_atb_vboost_WIDTH  (1U)
#define X2_LANEX_ANA_TX_VBOOST_atb_vboost(x)     (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_VBOOST_atb_vboost_SHIFT)) & X2_LANEX_ANA_TX_VBOOST_atb_vboost_MASK)

#define X2_LANEX_ANA_TX_VBOOST_boost_vptx_mode_n_MASK (0x20U)
#define X2_LANEX_ANA_TX_VBOOST_boost_vptx_mode_n_SHIFT (5U)
#define X2_LANEX_ANA_TX_VBOOST_boost_vptx_mode_n_WIDTH (1U)
#define X2_LANEX_ANA_TX_VBOOST_boost_vptx_mode_n(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_VBOOST_boost_vptx_mode_n_SHIFT)) & X2_LANEX_ANA_TX_VBOOST_boost_vptx_mode_n_MASK)

#define X2_LANEX_ANA_TX_VBOOST_vboost_en_reg_MASK (0x40U)
#define X2_LANEX_ANA_TX_VBOOST_vboost_en_reg_SHIFT (6U)
#define X2_LANEX_ANA_TX_VBOOST_vboost_en_reg_WIDTH (1U)
#define X2_LANEX_ANA_TX_VBOOST_vboost_en_reg(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_VBOOST_vboost_en_reg_SHIFT)) & X2_LANEX_ANA_TX_VBOOST_vboost_en_reg_MASK)

#define X2_LANEX_ANA_TX_VBOOST_ovrd_vboost_en_MASK (0x80U)
#define X2_LANEX_ANA_TX_VBOOST_ovrd_vboost_en_SHIFT (7U)
#define X2_LANEX_ANA_TX_VBOOST_ovrd_vboost_en_WIDTH (1U)
#define X2_LANEX_ANA_TX_VBOOST_ovrd_vboost_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_VBOOST_ovrd_vboost_en_SHIFT)) & X2_LANEX_ANA_TX_VBOOST_ovrd_vboost_en_MASK)

#define X2_LANEX_ANA_TX_VBOOST_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_ANA_TX_VBOOST_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_TX_VBOOST_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_TX_VBOOST_RESERVED_15_8(x)  (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_VBOOST_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_TX_VBOOST_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_TX_TERM_CODE - TX_TERM_CODE */
/*! @{ */

#define X2_LANEX_ANA_TX_TERM_CODE_term_code_ovrd_MASK (0x1U)
#define X2_LANEX_ANA_TX_TERM_CODE_term_code_ovrd_SHIFT (0U)
#define X2_LANEX_ANA_TX_TERM_CODE_term_code_ovrd_WIDTH (1U)
#define X2_LANEX_ANA_TX_TERM_CODE_term_code_ovrd(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_TERM_CODE_term_code_ovrd_SHIFT)) & X2_LANEX_ANA_TX_TERM_CODE_term_code_ovrd_MASK)

#define X2_LANEX_ANA_TX_TERM_CODE_term_code_reg_MASK (0xFEU)
#define X2_LANEX_ANA_TX_TERM_CODE_term_code_reg_SHIFT (1U)
#define X2_LANEX_ANA_TX_TERM_CODE_term_code_reg_WIDTH (7U)
#define X2_LANEX_ANA_TX_TERM_CODE_term_code_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_TERM_CODE_term_code_reg_SHIFT)) & X2_LANEX_ANA_TX_TERM_CODE_term_code_reg_MASK)

#define X2_LANEX_ANA_TX_TERM_CODE_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_ANA_TX_TERM_CODE_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_TX_TERM_CODE_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_TX_TERM_CODE_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_TERM_CODE_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_TX_TERM_CODE_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_TX_TERM_CODE_CTRL - TX_TERM_CODE_CTRL */
/*! @{ */

#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_ovrd_MASK (0x1U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_ovrd_SHIFT (0U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_ovrd_WIDTH (1U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_ovrd(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_ovrd_SHIFT)) & X2_LANEX_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_ovrd_MASK)

#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_reg_MASK (0x2U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_reg_SHIFT (1U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_reg_WIDTH (1U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_reg_SHIFT)) & X2_LANEX_ANA_TX_TERM_CODE_CTRL_tx_pwr_en_reg_MASK)

#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_dn_ovrd_MASK (0x4U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_dn_ovrd_SHIFT (2U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_dn_ovrd_WIDTH (1U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_dn_ovrd(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_dn_ovrd_SHIFT)) & X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_dn_ovrd_MASK)

