zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_dn_reg_MASK (0x8U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_dn_reg_SHIFT (3U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_dn_reg_WIDTH (1U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_dn_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_dn_reg_SHIFT)) & X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_dn_reg_MASK)

#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_up_ovrd_MASK (0x10U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_up_ovrd_SHIFT (4U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_up_ovrd_WIDTH (1U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_up_ovrd(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_up_ovrd_SHIFT)) & X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_up_ovrd_MASK)

#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_up_reg_MASK (0x20U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_up_reg_SHIFT (5U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_up_reg_WIDTH (1U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_up_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_up_reg_SHIFT)) & X2_LANEX_ANA_TX_TERM_CODE_CTRL_update_term_up_reg_MASK)

#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_reset_term_ovrd_MASK (0x40U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_reset_term_ovrd_SHIFT (6U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_reset_term_ovrd_WIDTH (1U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_reset_term_ovrd(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_TERM_CODE_CTRL_reset_term_ovrd_SHIFT)) & X2_LANEX_ANA_TX_TERM_CODE_CTRL_reset_term_ovrd_MASK)

#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_reset_term_reg_MASK (0x80U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_reset_term_reg_SHIFT (7U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_reset_term_reg_WIDTH (1U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_reset_term_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_TERM_CODE_CTRL_reset_term_reg_SHIFT)) & X2_LANEX_ANA_TX_TERM_CODE_CTRL_reset_term_reg_MASK)

#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_TX_TERM_CODE_CTRL_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_TERM_CODE_CTRL_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_TX_TERM_CODE_CTRL_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_TX_IBOOST_CODE - TX_IBOOST_CODE */
/*! @{ */

#define X2_LANEX_ANA_TX_IBOOST_CODE_lfps_high_priority_MASK (0x1U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_lfps_high_priority_SHIFT (0U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_lfps_high_priority_WIDTH (1U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_lfps_high_priority(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_IBOOST_CODE_lfps_high_priority_SHIFT)) & X2_LANEX_ANA_TX_IBOOST_CODE_lfps_high_priority_MASK)

#define X2_LANEX_ANA_TX_IBOOST_CODE_term_code_reg_MASK (0x6U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_term_code_reg_SHIFT (1U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_term_code_reg_WIDTH (2U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_term_code_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_IBOOST_CODE_term_code_reg_SHIFT)) & X2_LANEX_ANA_TX_IBOOST_CODE_term_code_reg_MASK)

#define X2_LANEX_ANA_TX_IBOOST_CODE_iboost_code_ovrd_MASK (0x8U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_iboost_code_ovrd_SHIFT (3U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_iboost_code_ovrd_WIDTH (1U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_iboost_code_ovrd(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_IBOOST_CODE_iboost_code_ovrd_SHIFT)) & X2_LANEX_ANA_TX_IBOOST_CODE_iboost_code_ovrd_MASK)

#define X2_LANEX_ANA_TX_IBOOST_CODE_iboost_code_reg_MASK (0xF0U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_iboost_code_reg_SHIFT (4U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_iboost_code_reg_WIDTH (4U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_iboost_code_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_IBOOST_CODE_iboost_code_reg_SHIFT)) & X2_LANEX_ANA_TX_IBOOST_CODE_iboost_code_reg_MASK)

#define X2_LANEX_ANA_TX_IBOOST_CODE_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_TX_IBOOST_CODE_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_IBOOST_CODE_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_TX_IBOOST_CODE_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_TX_OVRD_CLK - TX_OVRD_CLK */
/*! @{ */

#define X2_LANEX_ANA_TX_OVRD_CLK_override_regref_1_MASK (0x1U)
#define X2_LANEX_ANA_TX_OVRD_CLK_override_regref_1_SHIFT (0U)
#define X2_LANEX_ANA_TX_OVRD_CLK_override_regref_1_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_CLK_override_regref_1(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_CLK_override_regref_1_SHIFT)) & X2_LANEX_ANA_TX_OVRD_CLK_override_regref_1_MASK)

#define X2_LANEX_ANA_TX_OVRD_CLK_clk_lb_en_reg_MASK (0x2U)
#define X2_LANEX_ANA_TX_OVRD_CLK_clk_lb_en_reg_SHIFT (1U)
#define X2_LANEX_ANA_TX_OVRD_CLK_clk_lb_en_reg_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_CLK_clk_lb_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_CLK_clk_lb_en_reg_SHIFT)) & X2_LANEX_ANA_TX_OVRD_CLK_clk_lb_en_reg_MASK)

#define X2_LANEX_ANA_TX_OVRD_CLK_ovrd_lb_en_MASK (0x4U)
#define X2_LANEX_ANA_TX_OVRD_CLK_ovrd_lb_en_SHIFT (2U)
#define X2_LANEX_ANA_TX_OVRD_CLK_ovrd_lb_en_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_CLK_ovrd_lb_en(x)   (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_CLK_ovrd_lb_en_SHIFT)) & X2_LANEX_ANA_TX_OVRD_CLK_ovrd_lb_en_MASK)

#define X2_LANEX_ANA_TX_OVRD_CLK_mpllb_clk_en_reg_MASK (0x8U)
#define X2_LANEX_ANA_TX_OVRD_CLK_mpllb_clk_en_reg_SHIFT (3U)
#define X2_LANEX_ANA_TX_OVRD_CLK_mpllb_clk_en_reg_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_CLK_mpllb_clk_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_CLK_mpllb_clk_en_reg_SHIFT)) & X2_LANEX_ANA_TX_OVRD_CLK_mpllb_clk_en_reg_MASK)

#define X2_LANEX_ANA_TX_OVRD_CLK_mplla_clk_en_reg_MASK (0x10U)
#define X2_LANEX_ANA_TX_OVRD_CLK_mplla_clk_en_reg_SHIFT (4U)
#define X2_LANEX_ANA_TX_OVRD_CLK_mplla_clk_en_reg_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_CLK_mplla_clk_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_CLK_mplla_clk_en_reg_SHIFT)) & X2_LANEX_ANA_TX_OVRD_CLK_mplla_clk_en_reg_MASK)

#define X2_LANEX_ANA_TX_OVRD_CLK_ovrd_mpllab_en_MASK (0x20U)
#define X2_LANEX_ANA_TX_OVRD_CLK_ovrd_mpllab_en_SHIFT (5U)
#define X2_LANEX_ANA_TX_OVRD_CLK_ovrd_mpllab_en_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_CLK_ovrd_mpllab_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_CLK_ovrd_mpllab_en_SHIFT)) & X2_LANEX_ANA_TX_OVRD_CLK_ovrd_mpllab_en_MASK)

#define X2_LANEX_ANA_TX_OVRD_CLK_word_clk_en_reg_MASK (0x40U)
#define X2_LANEX_ANA_TX_OVRD_CLK_word_clk_en_reg_SHIFT (6U)
#define X2_LANEX_ANA_TX_OVRD_CLK_word_clk_en_reg_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_CLK_word_clk_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_CLK_word_clk_en_reg_SHIFT)) & X2_LANEX_ANA_TX_OVRD_CLK_word_clk_en_reg_MASK)

#define X2_LANEX_ANA_TX_OVRD_CLK_ovrd_word_clk_en_MASK (0x80U)
#define X2_LANEX_ANA_TX_OVRD_CLK_ovrd_word_clk_en_SHIFT (7U)
#define X2_LANEX_ANA_TX_OVRD_CLK_ovrd_word_clk_en_WIDTH (1U)
#define X2_LANEX_ANA_TX_OVRD_CLK_ovrd_word_clk_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_CLK_ovrd_word_clk_en_SHIFT)) & X2_LANEX_ANA_TX_OVRD_CLK_ovrd_word_clk_en_MASK)

#define X2_LANEX_ANA_TX_OVRD_CLK_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_ANA_TX_OVRD_CLK_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_TX_OVRD_CLK_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_TX_OVRD_CLK_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_OVRD_CLK_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_TX_OVRD_CLK_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_TX_MISC - TX_MISC */
/*! @{ */

#define X2_LANEX_ANA_TX_MISC_NC4_0_MASK          (0x1FU)
#define X2_LANEX_ANA_TX_MISC_NC4_0_SHIFT         (0U)
#define X2_LANEX_ANA_TX_MISC_NC4_0_WIDTH         (5U)
#define X2_LANEX_ANA_TX_MISC_NC4_0(x)            (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_MISC_NC4_0_SHIFT)) & X2_LANEX_ANA_TX_MISC_NC4_0_MASK)

#define X2_LANEX_ANA_TX_MISC_osc_div4_en_MASK    (0x20U)
#define X2_LANEX_ANA_TX_MISC_osc_div4_en_SHIFT   (5U)
#define X2_LANEX_ANA_TX_MISC_osc_div4_en_WIDTH   (1U)
#define X2_LANEX_ANA_TX_MISC_osc_div4_en(x)      (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_MISC_osc_div4_en_SHIFT)) & X2_LANEX_ANA_TX_MISC_osc_div4_en_MASK)

#define X2_LANEX_ANA_TX_MISC_meas_atb_bias_vptx_MASK (0x40U)
#define X2_LANEX_ANA_TX_MISC_meas_atb_bias_vptx_SHIFT (6U)
#define X2_LANEX_ANA_TX_MISC_meas_atb_bias_vptx_WIDTH (1U)
#define X2_LANEX_ANA_TX_MISC_meas_atb_bias_vptx(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_MISC_meas_atb_bias_vptx_SHIFT)) & X2_LANEX_ANA_TX_MISC_meas_atb_bias_vptx_MASK)

#define X2_LANEX_ANA_TX_MISC_override_rxdetref_MASK (0x80U)
#define X2_LANEX_ANA_TX_MISC_override_rxdetref_SHIFT (7U)
#define X2_LANEX_ANA_TX_MISC_override_rxdetref_WIDTH (1U)
#define X2_LANEX_ANA_TX_MISC_override_rxdetref(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_MISC_override_rxdetref_SHIFT)) & X2_LANEX_ANA_TX_MISC_override_rxdetref_MASK)

#define X2_LANEX_ANA_TX_MISC_RESERVED_15_8_MASK  (0xFF00U)
#define X2_LANEX_ANA_TX_MISC_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_TX_MISC_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_TX_MISC_RESERVED_15_8(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_TX_MISC_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_TX_MISC_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_RX_ATB_IQSKEW - RX_ATB_IQSKEW */
/*! @{ */

#define X2_LANEX_ANA_RX_ATB_IQSKEW_iq_phase_adjust_reg_MASK (0x1FU)
#define X2_LANEX_ANA_RX_ATB_IQSKEW_iq_phase_adjust_reg_SHIFT (0U)
#define X2_LANEX_ANA_RX_ATB_IQSKEW_iq_phase_adjust_reg_WIDTH (5U)
#define X2_LANEX_ANA_RX_ATB_IQSKEW_iq_phase_adjust_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_IQSKEW_iq_phase_adjust_reg_SHIFT)) & X2_LANEX_ANA_RX_ATB_IQSKEW_iq_phase_adjust_reg_MASK)

#define X2_LANEX_ANA_RX_ATB_IQSKEW_meas_atb_vp_MASK (0x20U)
#define X2_LANEX_ANA_RX_ATB_IQSKEW_meas_atb_vp_SHIFT (5U)
#define X2_LANEX_ANA_RX_ATB_IQSKEW_meas_atb_vp_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_IQSKEW_meas_atb_vp(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_IQSKEW_meas_atb_vp_SHIFT)) & X2_LANEX_ANA_RX_ATB_IQSKEW_meas_atb_vp_MASK)

#define X2_LANEX_ANA_RX_ATB_IQSKEW_meas_atb_rx_scope_reg_MASK (0x40U)
#define X2_LANEX_ANA_RX_ATB_IQSKEW_meas_atb_rx_scope_reg_SHIFT (6U)
#define X2_LANEX_ANA_RX_ATB_IQSKEW_meas_atb_rx_scope_reg_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_IQSKEW_meas_atb_rx_scope_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_IQSKEW_meas_atb_rx_scope_reg_SHIFT)) & X2_LANEX_ANA_RX_ATB_IQSKEW_meas_atb_rx_scope_reg_MASK)

#define X2_LANEX_ANA_RX_ATB_IQSKEW_master_atb_en_MASK (0x80U)
#define X2_LANEX_ANA_RX_ATB_IQSKEW_master_atb_en_SHIFT (7U)
#define X2_LANEX_ANA_RX_ATB_IQSKEW_master_atb_en_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_IQSKEW_master_atb_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_IQSKEW_master_atb_en_SHIFT)) & X2_LANEX_ANA_RX_ATB_IQSKEW_master_atb_en_MASK)

