zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_ANA_RX_MISC_OVRD_word_clk_en_reg_MASK (0x2U)
#define X2_LANEX_ANA_RX_MISC_OVRD_word_clk_en_reg_SHIFT (1U)
#define X2_LANEX_ANA_RX_MISC_OVRD_word_clk_en_reg_WIDTH (1U)
#define X2_LANEX_ANA_RX_MISC_OVRD_word_clk_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_MISC_OVRD_word_clk_en_reg_SHIFT)) & X2_LANEX_ANA_RX_MISC_OVRD_word_clk_en_reg_MASK)

#define X2_LANEX_ANA_RX_MISC_OVRD_NC3_2_MASK     (0xCU)
#define X2_LANEX_ANA_RX_MISC_OVRD_NC3_2_SHIFT    (2U)
#define X2_LANEX_ANA_RX_MISC_OVRD_NC3_2_WIDTH    (2U)
#define X2_LANEX_ANA_RX_MISC_OVRD_NC3_2(x)       (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_MISC_OVRD_NC3_2_SHIFT)) & X2_LANEX_ANA_RX_MISC_OVRD_NC3_2_MASK)

#define X2_LANEX_ANA_RX_MISC_OVRD_rx_los_lfps_en_reg_MASK (0x10U)
#define X2_LANEX_ANA_RX_MISC_OVRD_rx_los_lfps_en_reg_SHIFT (4U)
#define X2_LANEX_ANA_RX_MISC_OVRD_rx_los_lfps_en_reg_WIDTH (1U)
#define X2_LANEX_ANA_RX_MISC_OVRD_rx_los_lfps_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_MISC_OVRD_rx_los_lfps_en_reg_SHIFT)) & X2_LANEX_ANA_RX_MISC_OVRD_rx_los_lfps_en_reg_MASK)

#define X2_LANEX_ANA_RX_MISC_OVRD_ovrd_rx_los_lfps_en_MASK (0x20U)
#define X2_LANEX_ANA_RX_MISC_OVRD_ovrd_rx_los_lfps_en_SHIFT (5U)
#define X2_LANEX_ANA_RX_MISC_OVRD_ovrd_rx_los_lfps_en_WIDTH (1U)
#define X2_LANEX_ANA_RX_MISC_OVRD_ovrd_rx_los_lfps_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_MISC_OVRD_ovrd_rx_los_lfps_en_SHIFT)) & X2_LANEX_ANA_RX_MISC_OVRD_ovrd_rx_los_lfps_en_MASK)

#define X2_LANEX_ANA_RX_MISC_OVRD_ctle_offset_cal_enb_MASK (0x40U)
#define X2_LANEX_ANA_RX_MISC_OVRD_ctle_offset_cal_enb_SHIFT (6U)
#define X2_LANEX_ANA_RX_MISC_OVRD_ctle_offset_cal_enb_WIDTH (1U)
#define X2_LANEX_ANA_RX_MISC_OVRD_ctle_offset_cal_enb(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_MISC_OVRD_ctle_offset_cal_enb_SHIFT)) & X2_LANEX_ANA_RX_MISC_OVRD_ctle_offset_cal_enb_MASK)

#define X2_LANEX_ANA_RX_MISC_OVRD_override_vreg_prechg_reg_MASK (0x80U)
#define X2_LANEX_ANA_RX_MISC_OVRD_override_vreg_prechg_reg_SHIFT (7U)
#define X2_LANEX_ANA_RX_MISC_OVRD_override_vreg_prechg_reg_WIDTH (1U)
#define X2_LANEX_ANA_RX_MISC_OVRD_override_vreg_prechg_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_MISC_OVRD_override_vreg_prechg_reg_SHIFT)) & X2_LANEX_ANA_RX_MISC_OVRD_override_vreg_prechg_reg_MASK)

#define X2_LANEX_ANA_RX_MISC_OVRD_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_ANA_RX_MISC_OVRD_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_RX_MISC_OVRD_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_RX_MISC_OVRD_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_MISC_OVRD_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_RX_MISC_OVRD_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_RX_CAL_MUXA - RX_CAL_MUXA */
/*! @{ */

#define X2_LANEX_ANA_RX_CAL_MUXA_meas_atb_vco_200u_MASK (0x1U)
#define X2_LANEX_ANA_RX_CAL_MUXA_meas_atb_vco_200u_SHIFT (0U)
#define X2_LANEX_ANA_RX_CAL_MUXA_meas_atb_vco_200u_WIDTH (1U)
#define X2_LANEX_ANA_RX_CAL_MUXA_meas_atb_vco_200u(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_CAL_MUXA_meas_atb_vco_200u_SHIFT)) & X2_LANEX_ANA_RX_CAL_MUXA_meas_atb_vco_200u_MASK)

#define X2_LANEX_ANA_RX_CAL_MUXA_meas_atb_vibias_vco_MASK (0x2U)
#define X2_LANEX_ANA_RX_CAL_MUXA_meas_atb_vibias_vco_SHIFT (1U)
#define X2_LANEX_ANA_RX_CAL_MUXA_meas_atb_vibias_vco_WIDTH (1U)
#define X2_LANEX_ANA_RX_CAL_MUXA_meas_atb_vibias_vco(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_CAL_MUXA_meas_atb_vibias_vco_SHIFT)) & X2_LANEX_ANA_RX_CAL_MUXA_meas_atb_vibias_vco_MASK)

#define X2_LANEX_ANA_RX_CAL_MUXA_cal_muxa_sel_reg_MASK (0x7CU)
#define X2_LANEX_ANA_RX_CAL_MUXA_cal_muxa_sel_reg_SHIFT (2U)
#define X2_LANEX_ANA_RX_CAL_MUXA_cal_muxa_sel_reg_WIDTH (5U)
#define X2_LANEX_ANA_RX_CAL_MUXA_cal_muxa_sel_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_CAL_MUXA_cal_muxa_sel_reg_SHIFT)) & X2_LANEX_ANA_RX_CAL_MUXA_cal_muxa_sel_reg_MASK)

#define X2_LANEX_ANA_RX_CAL_MUXA_ovrd_cal_muxa_sel_MASK (0x80U)
#define X2_LANEX_ANA_RX_CAL_MUXA_ovrd_cal_muxa_sel_SHIFT (7U)
#define X2_LANEX_ANA_RX_CAL_MUXA_ovrd_cal_muxa_sel_WIDTH (1U)
#define X2_LANEX_ANA_RX_CAL_MUXA_ovrd_cal_muxa_sel(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_CAL_MUXA_ovrd_cal_muxa_sel_SHIFT)) & X2_LANEX_ANA_RX_CAL_MUXA_ovrd_cal_muxa_sel_MASK)

#define X2_LANEX_ANA_RX_CAL_MUXA_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_ANA_RX_CAL_MUXA_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_RX_CAL_MUXA_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_RX_CAL_MUXA_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_CAL_MUXA_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_RX_CAL_MUXA_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_RX_ATB_MEAS1 - RX_ATB_MEAS1 */
/*! @{ */

#define X2_LANEX_ANA_RX_ATB_MEAS1_NC0_MASK       (0x1U)
#define X2_LANEX_ANA_RX_ATB_MEAS1_NC0_SHIFT      (0U)
#define X2_LANEX_ANA_RX_ATB_MEAS1_NC0_WIDTH      (1U)
#define X2_LANEX_ANA_RX_ATB_MEAS1_NC0(x)         (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_MEAS1_NC0_SHIFT)) & X2_LANEX_ANA_RX_ATB_MEAS1_NC0_MASK)

#define X2_LANEX_ANA_RX_ATB_MEAS1_meas_atb_rx_MASK (0x7EU)
#define X2_LANEX_ANA_RX_ATB_MEAS1_meas_atb_rx_SHIFT (1U)
#define X2_LANEX_ANA_RX_ATB_MEAS1_meas_atb_rx_WIDTH (6U)
#define X2_LANEX_ANA_RX_ATB_MEAS1_meas_atb_rx(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_MEAS1_meas_atb_rx_SHIFT)) & X2_LANEX_ANA_RX_ATB_MEAS1_meas_atb_rx_MASK)

#define X2_LANEX_ANA_RX_ATB_MEAS1_atb_frc_vlos_MASK (0x80U)
#define X2_LANEX_ANA_RX_ATB_MEAS1_atb_frc_vlos_SHIFT (7U)
#define X2_LANEX_ANA_RX_ATB_MEAS1_atb_frc_vlos_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_MEAS1_atb_frc_vlos(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_MEAS1_atb_frc_vlos_SHIFT)) & X2_LANEX_ANA_RX_ATB_MEAS1_atb_frc_vlos_MASK)

#define X2_LANEX_ANA_RX_ATB_MEAS1_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_ANA_RX_ATB_MEAS1_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_RX_ATB_MEAS1_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_RX_ATB_MEAS1_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_MEAS1_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_RX_ATB_MEAS1_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_RX_ATB_MEAS2 - RX_ATB_MEAS2 */
/*! @{ */

#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_vco_vosc_MASK (0x1U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_vco_vosc_SHIFT (0U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_vco_vosc_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_vco_vosc(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_vco_vosc_SHIFT)) & X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_vco_vosc_MASK)

#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_vco_gd_MASK (0x2U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_vco_gd_SHIFT (1U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_vco_gd_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_vco_gd(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_vco_gd_SHIFT)) & X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_vco_gd_MASK)

