zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_ovrd_cdr_en_MASK (0x4U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_ovrd_cdr_en_SHIFT (2U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_ovrd_cdr_en_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_ovrd_cdr_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_ovrd_cdr_en_SHIFT)) & X2_LANEX_ANA_RX_ATB_MEAS2_meas_atb_ovrd_cdr_en_MASK)

#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_vreg_scope_MASK (0x8U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_vreg_scope_SHIFT (3U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_vreg_scope_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_vreg_scope(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_MEAS2_meas_vreg_scope_SHIFT)) & X2_LANEX_ANA_RX_ATB_MEAS2_meas_vreg_scope_MASK)

#define X2_LANEX_ANA_RX_ATB_MEAS2_NC4_MASK       (0x10U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_NC4_SHIFT      (4U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_NC4_WIDTH      (1U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_NC4(x)         (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_MEAS2_NC4_SHIFT)) & X2_LANEX_ANA_RX_ATB_MEAS2_NC4_MASK)

#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_vreg_clk_MASK (0x20U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_vreg_clk_SHIFT (5U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_vreg_clk_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_vreg_clk(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_MEAS2_meas_vreg_clk_SHIFT)) & X2_LANEX_ANA_RX_ATB_MEAS2_meas_vreg_clk_MASK)

#define X2_LANEX_ANA_RX_ATB_MEAS2_NC6_MASK       (0x40U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_NC6_SHIFT      (6U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_NC6_WIDTH      (1U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_NC6(x)         (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_MEAS2_NC6_SHIFT)) & X2_LANEX_ANA_RX_ATB_MEAS2_NC6_MASK)

#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_gd_MASK   (0x80U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_gd_SHIFT  (7U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_gd_WIDTH  (1U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_meas_gd(x)     (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_MEAS2_meas_gd_SHIFT)) & X2_LANEX_ANA_RX_ATB_MEAS2_meas_gd_MASK)

#define X2_LANEX_ANA_RX_ATB_MEAS2_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_RX_ATB_MEAS2_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_MEAS2_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_RX_ATB_MEAS2_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_RX_CAL_MUXB - RX_CAL_MUXB */
/*! @{ */

#define X2_LANEX_ANA_RX_CAL_MUXB_dfe_taps_en_reg_MASK (0x1U)
#define X2_LANEX_ANA_RX_CAL_MUXB_dfe_taps_en_reg_SHIFT (0U)
#define X2_LANEX_ANA_RX_CAL_MUXB_dfe_taps_en_reg_WIDTH (1U)
#define X2_LANEX_ANA_RX_CAL_MUXB_dfe_taps_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_CAL_MUXB_dfe_taps_en_reg_SHIFT)) & X2_LANEX_ANA_RX_CAL_MUXB_dfe_taps_en_reg_MASK)

#define X2_LANEX_ANA_RX_CAL_MUXB_ovrd_dfe_taps_en_MASK (0x2U)
#define X2_LANEX_ANA_RX_CAL_MUXB_ovrd_dfe_taps_en_SHIFT (1U)
#define X2_LANEX_ANA_RX_CAL_MUXB_ovrd_dfe_taps_en_WIDTH (1U)
#define X2_LANEX_ANA_RX_CAL_MUXB_ovrd_dfe_taps_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_CAL_MUXB_ovrd_dfe_taps_en_SHIFT)) & X2_LANEX_ANA_RX_CAL_MUXB_ovrd_dfe_taps_en_MASK)

#define X2_LANEX_ANA_RX_CAL_MUXB_cal_muxb_sel_reg_MASK (0x7CU)
#define X2_LANEX_ANA_RX_CAL_MUXB_cal_muxb_sel_reg_SHIFT (2U)
#define X2_LANEX_ANA_RX_CAL_MUXB_cal_muxb_sel_reg_WIDTH (5U)
#define X2_LANEX_ANA_RX_CAL_MUXB_cal_muxb_sel_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_CAL_MUXB_cal_muxb_sel_reg_SHIFT)) & X2_LANEX_ANA_RX_CAL_MUXB_cal_muxb_sel_reg_MASK)

#define X2_LANEX_ANA_RX_CAL_MUXB_ovrd_cal_muxb_sel_MASK (0x80U)
#define X2_LANEX_ANA_RX_CAL_MUXB_ovrd_cal_muxb_sel_SHIFT (7U)
#define X2_LANEX_ANA_RX_CAL_MUXB_ovrd_cal_muxb_sel_WIDTH (1U)
#define X2_LANEX_ANA_RX_CAL_MUXB_ovrd_cal_muxb_sel(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_CAL_MUXB_ovrd_cal_muxb_sel_SHIFT)) & X2_LANEX_ANA_RX_CAL_MUXB_ovrd_cal_muxb_sel_MASK)

#define X2_LANEX_ANA_RX_CAL_MUXB_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_ANA_RX_CAL_MUXB_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_RX_CAL_MUXB_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_RX_CAL_MUXB_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_CAL_MUXB_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_RX_CAL_MUXB_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_RX_TERM - RX_TERM */
/*! @{ */

#define X2_LANEX_ANA_RX_TERM_cdr_vco_startup_code_reg_MASK (0x3U)
#define X2_LANEX_ANA_RX_TERM_cdr_vco_startup_code_reg_SHIFT (0U)
#define X2_LANEX_ANA_RX_TERM_cdr_vco_startup_code_reg_WIDTH (2U)
#define X2_LANEX_ANA_RX_TERM_cdr_vco_startup_code_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_TERM_cdr_vco_startup_code_reg_SHIFT)) & X2_LANEX_ANA_RX_TERM_cdr_vco_startup_code_reg_MASK)

#define X2_LANEX_ANA_RX_TERM_vco_temp_comp_en_MASK (0x4U)
#define X2_LANEX_ANA_RX_TERM_vco_temp_comp_en_SHIFT (2U)
#define X2_LANEX_ANA_RX_TERM_vco_temp_comp_en_WIDTH (1U)
#define X2_LANEX_ANA_RX_TERM_vco_temp_comp_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_TERM_vco_temp_comp_en_SHIFT)) & X2_LANEX_ANA_RX_TERM_vco_temp_comp_en_MASK)

#define X2_LANEX_ANA_RX_TERM_ovrd_iq_phase_adjust_MASK (0x8U)
#define X2_LANEX_ANA_RX_TERM_ovrd_iq_phase_adjust_SHIFT (3U)
#define X2_LANEX_ANA_RX_TERM_ovrd_iq_phase_adjust_WIDTH (1U)
#define X2_LANEX_ANA_RX_TERM_ovrd_iq_phase_adjust(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_TERM_ovrd_iq_phase_adjust_SHIFT)) & X2_LANEX_ANA_RX_TERM_ovrd_iq_phase_adjust_MASK)

#define X2_LANEX_ANA_RX_TERM_rx_term_gd_en_reg_MASK (0x10U)
#define X2_LANEX_ANA_RX_TERM_rx_term_gd_en_reg_SHIFT (4U)
#define X2_LANEX_ANA_RX_TERM_rx_term_gd_en_reg_WIDTH (1U)
#define X2_LANEX_ANA_RX_TERM_rx_term_gd_en_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_TERM_rx_term_gd_en_reg_SHIFT)) & X2_LANEX_ANA_RX_TERM_rx_term_gd_en_reg_MASK)

#define X2_LANEX_ANA_RX_TERM_ovrd_rx_term_gd_en_MASK (0x20U)
#define X2_LANEX_ANA_RX_TERM_ovrd_rx_term_gd_en_SHIFT (5U)
#define X2_LANEX_ANA_RX_TERM_ovrd_rx_term_gd_en_WIDTH (1U)
#define X2_LANEX_ANA_RX_TERM_ovrd_rx_term_gd_en(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_TERM_ovrd_rx_term_gd_en_SHIFT)) & X2_LANEX_ANA_RX_TERM_ovrd_rx_term_gd_en_MASK)

#define X2_LANEX_ANA_RX_TERM_afe_cm_sel_MASK     (0xC0U)
#define X2_LANEX_ANA_RX_TERM_afe_cm_sel_SHIFT    (6U)
#define X2_LANEX_ANA_RX_TERM_afe_cm_sel_WIDTH    (2U)
#define X2_LANEX_ANA_RX_TERM_afe_cm_sel(x)       (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_TERM_afe_cm_sel_SHIFT)) & X2_LANEX_ANA_RX_TERM_afe_cm_sel_MASK)

#define X2_LANEX_ANA_RX_TERM_RESERVED_15_8_MASK  (0xFF00U)
#define X2_LANEX_ANA_RX_TERM_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_RX_TERM_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_RX_TERM_RESERVED_15_8(x)    (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_TERM_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_RX_TERM_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_RX_SLC_CTRL - RX_SLC_CTRL */
/*! @{ */

#define X2_LANEX_ANA_RX_SLC_CTRL_rx_slicer_ctrl_o_reg_MASK (0xFU)
#define X2_LANEX_ANA_RX_SLC_CTRL_rx_slicer_ctrl_o_reg_SHIFT (0U)
#define X2_LANEX_ANA_RX_SLC_CTRL_rx_slicer_ctrl_o_reg_WIDTH (4U)
#define X2_LANEX_ANA_RX_SLC_CTRL_rx_slicer_ctrl_o_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_SLC_CTRL_rx_slicer_ctrl_o_reg_SHIFT)) & X2_LANEX_ANA_RX_SLC_CTRL_rx_slicer_ctrl_o_reg_MASK)

#define X2_LANEX_ANA_RX_SLC_CTRL_rx_slicer_ctrl_e_reg_MASK (0xF0U)
#define X2_LANEX_ANA_RX_SLC_CTRL_rx_slicer_ctrl_e_reg_SHIFT (4U)
#define X2_LANEX_ANA_RX_SLC_CTRL_rx_slicer_ctrl_e_reg_WIDTH (4U)
#define X2_LANEX_ANA_RX_SLC_CTRL_rx_slicer_ctrl_e_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_SLC_CTRL_rx_slicer_ctrl_e_reg_SHIFT)) & X2_LANEX_ANA_RX_SLC_CTRL_rx_slicer_ctrl_e_reg_MASK)

