zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_LANEX_ANA_RX_SLC_CTRL_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_ANA_RX_SLC_CTRL_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_RX_SLC_CTRL_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_RX_SLC_CTRL_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_SLC_CTRL_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_RX_SLC_CTRL_RESERVED_15_8_MASK)
/*! @} */

/*! @name LANEX_ANA_RX_ATB_VREG - RX_ATB_VREG */
/*! @{ */

#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_rx_slicer_ctrl_reg_MASK (0x1U)
#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_rx_slicer_ctrl_reg_SHIFT (0U)
#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_rx_slicer_ctrl_reg_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_rx_slicer_ctrl_reg(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_VREG_ovrd_rx_slicer_ctrl_reg_SHIFT)) & X2_LANEX_ANA_RX_ATB_VREG_ovrd_rx_slicer_ctrl_reg_MASK)

#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_iqc_vref_sel_MASK (0x2U)
#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_iqc_vref_sel_SHIFT (1U)
#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_iqc_vref_sel_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_iqc_vref_sel(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_VREG_ovrd_iqc_vref_sel_SHIFT)) & X2_LANEX_ANA_RX_ATB_VREG_ovrd_iqc_vref_sel_MASK)

#define X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_iqc_scope_MASK (0x4U)
#define X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_iqc_scope_SHIFT (2U)
#define X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_iqc_scope_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_iqc_scope(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_iqc_scope_SHIFT)) & X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_iqc_scope_MASK)

#define X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_iqc_MASK (0x8U)
#define X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_iqc_SHIFT (3U)
#define X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_iqc_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_iqc(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_iqc_SHIFT)) & X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_iqc_MASK)

#define X2_LANEX_ANA_RX_ATB_VREG_NC4_MASK        (0x10U)
#define X2_LANEX_ANA_RX_ATB_VREG_NC4_SHIFT       (4U)
#define X2_LANEX_ANA_RX_ATB_VREG_NC4_WIDTH       (1U)
#define X2_LANEX_ANA_RX_ATB_VREG_NC4(x)          (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_VREG_NC4_SHIFT)) & X2_LANEX_ANA_RX_ATB_VREG_NC4_MASK)

#define X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_dfe_MASK (0x20U)
#define X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_dfe_SHIFT (5U)
#define X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_dfe_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_dfe(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_dfe_SHIFT)) & X2_LANEX_ANA_RX_ATB_VREG_meas_atb_vreg_dfe_MASK)

#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_regref_iqc_scope_MASK (0x40U)
#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_regref_iqc_scope_SHIFT (6U)
#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_regref_iqc_scope_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_regref_iqc_scope(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_VREG_ovrd_regref_iqc_scope_SHIFT)) & X2_LANEX_ANA_RX_ATB_VREG_ovrd_regref_iqc_scope_MASK)

#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_regref_iqc_MASK (0x80U)
#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_regref_iqc_SHIFT (7U)
#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_regref_iqc_WIDTH (1U)
#define X2_LANEX_ANA_RX_ATB_VREG_ovrd_regref_iqc(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_VREG_ovrd_regref_iqc_SHIFT)) & X2_LANEX_ANA_RX_ATB_VREG_ovrd_regref_iqc_MASK)

#define X2_LANEX_ANA_RX_ATB_VREG_RESERVED_15_8_MASK (0xFF00U)
#define X2_LANEX_ANA_RX_ATB_VREG_RESERVED_15_8_SHIFT (8U)
#define X2_LANEX_ANA_RX_ATB_VREG_RESERVED_15_8_WIDTH (8U)
#define X2_LANEX_ANA_RX_ATB_VREG_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_LANEX_ANA_RX_ATB_VREG_RESERVED_15_8_SHIFT)) & X2_LANEX_ANA_RX_ATB_VREG_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PCS_XF_TX_OVRD_IN - Override values for incoming TX controls from PCS */
/*! @{ */

#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_PSTATE_MASK (0x3U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_PSTATE_SHIFT (0U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_PSTATE_WIDTH (2U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_PSTATE_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_PSTATE_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_LPD_MASK (0x4U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_LPD_SHIFT (2U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_LPD_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_LPD(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_LPD_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_LPD_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_WIDTH_MASK (0x18U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_WIDTH_SHIFT (3U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_WIDTH_WIDTH (2U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_WIDTH(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_WIDTH_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_WIDTH_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_RATE_MASK (0xE0U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_RATE_SHIFT (5U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_RATE_WIDTH (3U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_RATE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_RATE_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_RATE_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MPLLB_SEL_MASK (0x100U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MPLLB_SEL_SHIFT (8U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MPLLB_SEL_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MPLLB_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MPLLB_SEL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MPLLB_SEL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MPLL_EN_MASK (0x200U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MPLL_EN_SHIFT (9U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MPLL_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MPLL_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MPLL_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MPLL_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MSTR_MPLLA_STATE_MASK (0x400U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MSTR_MPLLA_STATE_SHIFT (10U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MSTR_MPLLA_STATE_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MSTR_MPLLA_STATE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MSTR_MPLLA_STATE_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MSTR_MPLLA_STATE_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MSTR_MPLLB_STATE_MASK (0x800U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MSTR_MPLLB_STATE_SHIFT (11U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MSTR_MPLLB_STATE_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MSTR_MPLLB_STATE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MSTR_MPLLB_STATE_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_MSTR_MPLLB_STATE_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_OVRD_EN_MASK (0x1000U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_OVRD_EN_SHIFT (12U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_RESERVED_15_13_MASK (0xE000U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_RESERVED_15_13_SHIFT (13U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_RESERVED_15_13_WIDTH (3U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_RESERVED_15_13_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_RESERVED_15_13_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PCS_XF_TX_OVRD_IN_1 - Override values for incoming TX controls from PCS, register #1 */
/*! @{ */

