zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_DETRX_RESULT_MASK (0x2U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_DETRX_RESULT_SHIFT (1U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_DETRX_RESULT_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_DETRX_RESULT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_DETRX_RESULT_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_DETRX_RESULT_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_EN_CTL_MASK (0x4U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_EN_CTL_SHIFT (2U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_EN_CTL_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_EN_CTL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_EN_CTL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_EN_CTL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_RESERVED_15_3_MASK (0xFFF8U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_RESERVED_15_3_SHIFT (3U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_RESERVED_15_3_WIDTH (13U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_RESERVED_15_3(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_RESERVED_15_3_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_OVRD_OUT_RESERVED_15_3_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PCS_XF_TX_PCS_OUT - Current values for outgoing TX status controls from Raw PCS */
/*! @{ */

#define X2_RAWLANEX_DIG_PCS_XF_TX_PCS_OUT_ACK_MASK (0x1U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_PCS_OUT_ACK_SHIFT (0U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_PCS_OUT_ACK_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_PCS_OUT_ACK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_PCS_OUT_ACK_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_PCS_OUT_ACK_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TX_PCS_OUT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_PCS_XF_TX_PCS_OUT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_PCS_OUT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_PCS_XF_TX_PCS_OUT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TX_PCS_OUT_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TX_PCS_OUT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PCS_XF_RX_OVRD_IN - Override values for incoming RX controls from PCS */
/*! @{ */

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_RATE_MASK (0x3U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_RATE_SHIFT (0U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_RATE_WIDTH (2U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_RATE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_RATE_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_RATE_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_WIDTH_MASK (0xCU)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_WIDTH_SHIFT (2U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_WIDTH_WIDTH (2U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_WIDTH(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_WIDTH_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_WIDTH_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_PSTATE_MASK (0x30U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_PSTATE_SHIFT (4U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_PSTATE_WIDTH (2U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_PSTATE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_PSTATE_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_PSTATE_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_LPD_MASK (0x40U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_LPD_SHIFT (6U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_LPD_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_LPD(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_LPD_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_LPD_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_OVRD_EN_MASK (0x80U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_OVRD_EN_SHIFT (7U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_ADAPT_AFE_EN_MASK (0x100U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_ADAPT_AFE_EN_SHIFT (8U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_ADAPT_AFE_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_ADAPT_AFE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_ADAPT_AFE_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_ADAPT_AFE_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_ADAPT_DFE_EN_MASK (0x200U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_ADAPT_DFE_EN_SHIFT (9U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_ADAPT_DFE_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_ADAPT_DFE_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_ADAPT_DFE_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_ADAPT_DFE_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_RESERVED_15_10_SHIFT (10U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_RESERVED_15_10_WIDTH (6U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_RESERVED_15_10_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1 - Override values for incoming RX controls from PCS, register #1 */
/*! @{ */

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_VAL_MASK (0x1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_EN_MASK (0x2U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_EN_SHIFT (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_IN_1_RESET_OVRD_EN_MASK)

