zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPRE_DIR_RX_TXPRE_DIR_MASK (0x3U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPRE_DIR_RX_TXPRE_DIR_SHIFT (0U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPRE_DIR_RX_TXPRE_DIR_WIDTH (2U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPRE_DIR_RX_TXPRE_DIR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_TXPRE_DIR_RX_TXPRE_DIR_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_TXPRE_DIR_RX_TXPRE_DIR_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPRE_DIR_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPRE_DIR_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPRE_DIR_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPRE_DIR_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_TXPRE_DIR_RESERVED_15_2_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_TXPRE_DIR_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR - RX calculated direction for TX-Main */
/*! @{ */

#define X2_RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR_RX_TXMAIN_DIR_MASK (0x3U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR_RX_TXMAIN_DIR_SHIFT (0U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR_RX_TXMAIN_DIR_WIDTH (2U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR_RX_TXMAIN_DIR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR_RX_TXMAIN_DIR_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR_RX_TXMAIN_DIR_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR_RESERVED_15_2_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_TXMAIN_DIR_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR - RX calculated direction for TX-Post */
/*! @{ */

#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR_RX_TXPOST_DIR_MASK (0x3U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR_RX_TXPOST_DIR_SHIFT (0U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR_RX_TXPOST_DIR_WIDTH (2U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR_RX_TXPOST_DIR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR_RX_TXPOST_DIR_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR_RX_TXPOST_DIR_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR_RESERVED_15_2_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_TXPOST_DIR_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PCS_XF_LANE_NUMBER - Current lane number */
/*! @{ */

#define X2_RAWLANEX_DIG_PCS_XF_LANE_NUMBER_LANE_NUMBER_MASK (0xFU)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_NUMBER_LANE_NUMBER_SHIFT (0U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_NUMBER_LANE_NUMBER_WIDTH (4U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_NUMBER_LANE_NUMBER(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_LANE_NUMBER_LANE_NUMBER_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_LANE_NUMBER_LANE_NUMBER_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_LANE_NUMBER_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_NUMBER_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_NUMBER_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_NUMBER_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_LANE_NUMBER_RESERVED_15_4_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_LANE_NUMBER_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN - Override incoming values for lane_xcvr_mode */
/*! @{ */

#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_VAL_MASK (0x3U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_VAL_WIDTH (2U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_EN_MASK (0x4U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_EN_SHIFT (2U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_LANE_XCVR_MODE_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_RESERVED_15_3_MASK (0xFFF8U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_RESERVED_15_3_SHIFT (3U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_RESERVED_15_3_WIDTH (13U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_RESERVED_15_3(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_RESERVED_15_3_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_OVRD_IN_RESERVED_15_3_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN - Lane transceiver mode status */
/*! @{ */

#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN_LANE_XCVR_MODE_MASK (0x3U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN_LANE_XCVR_MODE_SHIFT (0U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN_LANE_XCVR_MODE_WIDTH (2U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN_LANE_XCVR_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN_LANE_XCVR_MODE_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN_LANE_XCVR_MODE_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN_RESERVED_15_2_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_LANE_XCVR_MODE_IN_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN - ATE Override input to control top-level inputs */
/*! @{ */

