zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_VAL_MASK (0x1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_EN_MASK (0x2U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_EN_SHIFT (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_RESET_ATE_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_VAL_MASK (0x4U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_VAL_SHIFT (2U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_EN_MASK (0x8U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_EN_SHIFT (3U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_RESET_ATE_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_VAL_MASK (0x10U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_VAL_SHIFT (4U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_EN_MASK (0x20U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_EN_SHIFT (5U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_REQ_ATE_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_VAL_MASK (0x40U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_VAL_SHIFT (6U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_EN_MASK (0x80U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_EN_SHIFT (7U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_TX_REQ_ATE_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_VAL_MASK (0x100U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_VAL_SHIFT (8U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_EN_MASK (0x200U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_EN_SHIFT (9U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_AFE_EN_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_VAL_MASK (0x400U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_VAL_SHIFT (10U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_EN_MASK (0x800U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_EN_SHIFT (11U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_RX_ADAPT_DFE_EN_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_VALUE_MASK (0x7000U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_VALUE_SHIFT (12U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_VALUE_WIDTH (3U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_VALUE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_VALUE_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_VALUE_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_EN_MASK (0x8000U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_EN_SHIFT (15U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_ATE_OVRD_IN_REF_RANGE_ATE_OVRD_EN_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN - Override incoming values for rx_eq_delta_iq */
/*! @{ */

#define X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_VAL_MASK (0xFU)
#define X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_VAL_WIDTH (4U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_EN_MASK (0x10U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_EN_SHIFT (4U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RX_EQ_DELTA_IQ_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RESERVED_15_5_MASK (0xFFE0U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RESERVED_15_5_SHIFT (5U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RESERVED_15_5_WIDTH (11U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RESERVED_15_5_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_EQ_DELTA_IQ_OVRD_IN_RESERVED_15_5_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN - Override incoming values for tx/rx_term_ctrl */
/*! @{ */

#define X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_VAL_MASK (0x7U)
#define X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_VAL_WIDTH (3U)
#define X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_EN_MASK (0x8U)
#define X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_EN_SHIFT (3U)
#define X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_RX_TERM_CTRL_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_VAL_MASK (0x70U)
#define X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_VAL_SHIFT (4U)
#define X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_VAL_WIDTH (3U)
#define X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_TXRX_TERM_CTRL_OVRD_IN_TX_TERM_CTRL_OVRD_VAL_MASK)

