zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_RX_RATE_ATE_OVRD_EN_MASK (0x400U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_RX_RATE_ATE_OVRD_EN_SHIFT (10U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_RX_RATE_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_RX_RATE_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_RX_RATE_ATE_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_RX_RATE_ATE_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_TX2RX_SER_LB_EN_ATE_OVRD_VAL_MASK (0x800U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_TX2RX_SER_LB_EN_ATE_OVRD_VAL_SHIFT (11U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_TX2RX_SER_LB_EN_ATE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_TX2RX_SER_LB_EN_ATE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_TX2RX_SER_LB_EN_ATE_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_TX2RX_SER_LB_EN_ATE_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_TX2RX_SER_LB_EN_ATE_OVRD_EN_MASK (0x1000U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_TX2RX_SER_LB_EN_ATE_OVRD_EN_SHIFT (12U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_TX2RX_SER_LB_EN_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_TX2RX_SER_LB_EN_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_TX2RX_SER_LB_EN_ATE_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_TX2RX_SER_LB_EN_ATE_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_RX2TX_PAR_LB_EN_ATE_OVRD_VAL_MASK (0x2000U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_RX2TX_PAR_LB_EN_ATE_OVRD_VAL_SHIFT (13U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_RX2TX_PAR_LB_EN_ATE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_RX2TX_PAR_LB_EN_ATE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_RX2TX_PAR_LB_EN_ATE_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_RX2TX_PAR_LB_EN_ATE_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_RX2TX_PAR_LB_EN_ATE_OVRD_EN_MASK (0x4000U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_RX2TX_PAR_LB_EN_ATE_OVRD_EN_SHIFT (14U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_RX2TX_PAR_LB_EN_ATE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_RX2TX_PAR_LB_EN_ATE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_RX2TX_PAR_LB_EN_ATE_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_LANE_RX2TX_PAR_LB_EN_ATE_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_RESERVED_15_15_MASK (0x8000U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_RESERVED_15_15_SHIFT (15U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_RESERVED_15_15_WIDTH (1U)
#define X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_RESERVED_15_15_SHIFT)) & X2_RAWLANEX_DIG_PCS_XF_RX_OVRD_OUT_2_RESERVED_15_15_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FSM_OVRD_CTL - FSM override control register */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_JMP_ADDR_MASK (0xFFFU)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_JMP_ADDR_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_JMP_ADDR_WIDTH (12U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_JMP_ADDR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_JMP_ADDR_SHIFT)) & X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_JMP_ADDR_MASK)

#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_JMP_EN_MASK (0x1000U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_JMP_EN_SHIFT (12U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_JMP_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_JMP_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_JMP_EN_SHIFT)) & X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_JMP_EN_MASK)

#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_CMD_START_MASK (0x2000U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_CMD_START_SHIFT (13U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_CMD_START_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_CMD_START(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_CMD_START_SHIFT)) & X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_CMD_START_MASK)

#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_OVRD_EN_MASK (0x4000U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_OVRD_EN_SHIFT (14U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_FSM_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_RESERVED_15_15_MASK (0x8000U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_RESERVED_15_15_SHIFT (15U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_RESERVED_15_15_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_RESERVED_15_15_SHIFT)) & X2_RAWLANEX_DIG_FSM_FSM_OVRD_CTL_RESERVED_15_15_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_MEM_ADDR_MON - Memory Address Monitor */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_MEM_ADDR_MON_MEM_ADDR_MASK (0xFFFFU)
#define X2_RAWLANEX_DIG_FSM_MEM_ADDR_MON_MEM_ADDR_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_MEM_ADDR_MON_MEM_ADDR_WIDTH (16U)
#define X2_RAWLANEX_DIG_FSM_MEM_ADDR_MON_MEM_ADDR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_MEM_ADDR_MON_MEM_ADDR_SHIFT)) & X2_RAWLANEX_DIG_FSM_MEM_ADDR_MON_MEM_ADDR_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_STATUS_MON - FSM Status Monitor */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_STATUS_MON_STATE_MASK (0x1FU)
#define X2_RAWLANEX_DIG_FSM_STATUS_MON_STATE_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_STATUS_MON_STATE_WIDTH (5U)
#define X2_RAWLANEX_DIG_FSM_STATUS_MON_STATE(x)  (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_STATUS_MON_STATE_SHIFT)) & X2_RAWLANEX_DIG_FSM_STATUS_MON_STATE_MASK)

