zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANEX_DIG_FSM_FAST_RX_AFE_ADAPT_FAST_RX_AFE_ADAPT_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_AFE_ADAPT_FAST_RX_AFE_ADAPT_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_AFE_ADAPT_FAST_RX_AFE_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_AFE_ADAPT_FAST_RX_AFE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_AFE_ADAPT_FAST_RX_AFE_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_AFE_ADAPT_FAST_RX_AFE_ADAPT_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_RX_AFE_ADAPT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_AFE_ADAPT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_AFE_ADAPT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_AFE_ADAPT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_AFE_ADAPT_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_AFE_ADAPT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT - Status of Fast RX DFE Adaptation */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT_FAST_RX_DFE_ADAPT_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT_FAST_RX_DFE_ADAPT_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT_FAST_RX_DFE_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT_FAST_RX_DFE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT_FAST_RX_DFE_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT_FAST_RX_DFE_ADAPT_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_DFE_ADAPT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_SUP - Status of Fast Support block */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_SUP_FAST_SUP_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_SUP_FAST_SUP_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_SUP_FAST_SUP_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_SUP_FAST_SUP(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_SUP_FAST_SUP_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_SUP_FAST_SUP_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_SUP_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_SUP_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_SUP_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_SUP_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_SUP_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_SUP_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE - Status of Fast TX Common-mode Charge-up */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE_FAST_TX_CMN_MODE_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE_FAST_TX_CMN_MODE_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE_FAST_TX_CMN_MODE_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE_FAST_TX_CMN_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE_FAST_TX_CMN_MODE_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE_FAST_TX_CMN_MODE_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_TX_CMN_MODE_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_TX_RXDET - Status of Fast TX detect RX */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_TX_RXDET_FAST_TX_RXDET_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_TX_RXDET_FAST_TX_RXDET_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_TX_RXDET_FAST_TX_RXDET_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_TX_RXDET_FAST_TX_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_TX_RXDET_FAST_TX_RXDET_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_TX_RXDET_FAST_TX_RXDET_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_TX_RXDET_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_TX_RXDET_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_TX_RXDET_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_TX_RXDET_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_TX_RXDET_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_TX_RXDET_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_RX_PWRUP - Status of Fast RX Power-up */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_RX_PWRUP_FAST_RX_PWRUP_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_PWRUP_FAST_RX_PWRUP_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_PWRUP_FAST_RX_PWRUP_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_PWRUP_FAST_RX_PWRUP(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_PWRUP_FAST_RX_PWRUP_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_PWRUP_FAST_RX_PWRUP_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_RX_PWRUP_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_PWRUP_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_PWRUP_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_PWRUP_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_PWRUP_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_PWRUP_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT - Status of Fast RX VCO Wait Times */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT_FAST_RX_VCO_WAIT_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT_FAST_RX_VCO_WAIT_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT_FAST_RX_VCO_WAIT_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT_FAST_RX_VCO_WAIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT_FAST_RX_VCO_WAIT_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT_FAST_RX_VCO_WAIT_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_WAIT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL - Status of Fast RX VCO Calibration */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL_FAST_RX_VCO_CAL_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL_FAST_RX_VCO_CAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL_FAST_RX_VCO_CAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL_FAST_RX_VCO_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL_FAST_RX_VCO_CAL_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL_FAST_RX_VCO_CAL_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_VCO_CAL_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS - Status of MPLL common calibration initiation */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_INIT_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_INIT_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_INIT_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_INIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_INIT_SHIFT)) & X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_INIT_MASK)

#define X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_DONE_MASK (0x2U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_DONE_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_DONE_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_DONE_SHIFT)) & X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_CMNCAL_MPLL_DONE_MASK)

#define X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_RESERVED_15_2_SHIFT)) & X2_RAWLANEX_DIG_FSM_CMNCAL_MPLL_STATUS_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT - Status of Fast RX Continuous Calibration/Adaptation */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_FAST_RX_CONT_CAL_ADAPT_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_FAST_RX_CONT_CAL_ADAPT_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_FAST_RX_CONT_CAL_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_FAST_RX_CONT_CAL_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_FAST_RX_CONT_CAL_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_FAST_RX_CONT_CAL_ADAPT_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_CAL_ADAPT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT - Status of Fast RX Continuous Adaptation */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT_FAST_RX_CONT_ADAPT_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT_FAST_RX_CONT_ADAPT_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT_FAST_RX_CONT_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT_FAST_RX_CONT_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT_FAST_RX_CONT_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT_FAST_RX_CONT_ADAPT_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_ADAPT_RESERVED_15_1_MASK)
/*! @} */

