zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL - Status of Fast RX Continuous Data Calibration */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL_FAST_RX_CONT_DATA_CAL_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL_FAST_RX_CONT_DATA_CAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL_FAST_RX_CONT_DATA_CAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL_FAST_RX_CONT_DATA_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL_FAST_RX_CONT_DATA_CAL_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL_FAST_RX_CONT_DATA_CAL_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_DATA_CAL_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL - Status of Fast RX Continuous Phase Calibration */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL_FAST_RX_CONT_PHASE_CAL_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL_FAST_RX_CONT_PHASE_CAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL_FAST_RX_CONT_PHASE_CAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL_FAST_RX_CONT_PHASE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL_FAST_RX_CONT_PHASE_CAL_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL_FAST_RX_CONT_PHASE_CAL_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_PHASE_CAL_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL - Status of Fast RX Continuous AFE Calibration */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL_FAST_RX_CONT_AFE_CAL_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL_FAST_RX_CONT_AFE_CAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL_FAST_RX_CONT_AFE_CAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL_FAST_RX_CONT_AFE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL_FAST_RX_CONT_AFE_CAL_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL_FAST_RX_CONT_AFE_CAL_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_CONT_AFE_CAL_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT - Status of Fast RX IQ_ADAPT */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT_FAST_RX_IQ_ADAPT_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT_FAST_RX_IQ_ADAPT_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT_FAST_RX_IQ_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT_FAST_RX_IQ_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT_FAST_RX_IQ_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT_FAST_RX_IQ_ADAPT_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_IQ_ADAPT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD - Status of RX Delta addition */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD_RX_IQ_DELTA_ADD_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD_RX_IQ_DELTA_ADD_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD_RX_IQ_DELTA_ADD_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD_RX_IQ_DELTA_ADD(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD_RX_IQ_DELTA_ADD_SHIFT)) & X2_RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD_RX_IQ_DELTA_ADD_MASK)

#define X2_RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_RX_IQ_DELTA_ADD_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT - Enables fast RX ATT adaptation */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT_FAST_RX_ATT_ADAPT_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT_FAST_RX_ATT_ADAPT_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT_FAST_RX_ATT_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT_FAST_RX_ATT_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT_FAST_RX_ATT_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT_FAST_RX_ATT_ADAPT_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_ATT_ADAPT_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT - Enables fast RX CTLE adaptation */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT_FAST_RX_CTLE_ADAPT_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT_FAST_RX_CTLE_ADAPT_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT_FAST_RX_CTLE_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT_FAST_RX_CTLE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT_FAST_RX_CTLE_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT_FAST_RX_CTLE_ADAPT_MASK)

#define X2_RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_FAST_RX_CTLE_ADAPT_RESERVED_15_1_MASK)
/*! @} */

