zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN - CR interface timing extension enable */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN_CR_REG_OP_XTND_EN_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN_CR_REG_OP_XTND_EN_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN_CR_REG_OP_XTND_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN_CR_REG_OP_XTND_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN_CR_REG_OP_XTND_EN_SHIFT)) & X2_RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN_CR_REG_OP_XTND_EN_MASK)

#define X2_RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_CR_REG_OP_XTND_EN_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG - TX Eq update flag */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG_TX_EQ_UPDATE_FLAG_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG_TX_EQ_UPDATE_FLAG_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG_TX_EQ_UPDATE_FLAG_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG_TX_EQ_UPDATE_FLAG(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG_TX_EQ_UPDATE_FLAG_SHIFT)) & X2_RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG_TX_EQ_UPDATE_FLAG_MASK)

#define X2_RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_FSM_TX_EQ_UPDATE_FLAG_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS - Status of RTUNE common calibration initiation */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_INIT_MASK (0x1U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_INIT_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_INIT_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_INIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_INIT_SHIFT)) & X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_INIT_MASK)

#define X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_DONE_MASK (0x2U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_DONE_SHIFT (1U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_DONE_WIDTH (1U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_DONE_SHIFT)) & X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_CMNCAL_RCAL_DONE_MASK)

#define X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_RESERVED_15_2_SHIFT)) & X2_RAWLANEX_DIG_FSM_CMNCAL_RCAL_STATUS_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET - Offset value for IQ Phase Calculation */
/*! @{ */

#define X2_RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET_RX_IQ_PHASE_OFFSET_MASK (0xFU)
#define X2_RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET_RX_IQ_PHASE_OFFSET_SHIFT (0U)
#define X2_RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET_RX_IQ_PHASE_OFFSET_WIDTH (4U)
#define X2_RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET_RX_IQ_PHASE_OFFSET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET_RX_IQ_PHASE_OFFSET_SHIFT)) & X2_RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET_RX_IQ_PHASE_OFFSET_MASK)

#define X2_RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET_RESERVED_15_4_SHIFT)) & X2_RAWLANEX_DIG_FSM_RX_IQ_PHASE_OFFSET_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST - Offset value for RX AFE ATT iDAC */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST_AFE_ATT_IDAC_OFST_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST_AFE_ATT_IDAC_OFST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST_AFE_ATT_IDAC_OFST_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST_AFE_ATT_IDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST_AFE_ATT_IDAC_OFST_SHIFT)) & X2_RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST_AFE_ATT_IDAC_OFST_MASK)

#define X2_RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_AFE_ATT_IDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST - Offset value for RX AFE CTLE iDAC */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST_AFE_CTLE_IDAC_OFST_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST_AFE_CTLE_IDAC_OFST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST_AFE_CTLE_IDAC_OFST_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST_AFE_CTLE_IDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST_AFE_CTLE_IDAC_OFST_SHIFT)) & X2_RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST_AFE_CTLE_IDAC_OFST_MASK)

