zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_AFE_CTLE_IDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE - Reference level for RX AFE Adaptation */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE_ADAPT_REF_LVL_DAC_CODE_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE_ADAPT_REF_LVL_DAC_CODE_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE_ADAPT_REF_LVL_DAC_CODE_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE_ADAPT_REF_LVL_DAC_CODE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE_ADAPT_REF_LVL_DAC_CODE_SHIFT)) & X2_RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE_ADAPT_REF_LVL_DAC_CODE_MASK)

#define X2_RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_ADAPT_REF_LVL_DAC_CODE_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_ADAPT_FOM - Adaptation Figure of Merit (FOM) */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_ADAPT_FOM_RX_ADAPT_FOM_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_RX_ADAPT_FOM_RX_ADAPT_FOM_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_ADAPT_FOM_RX_ADAPT_FOM_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_RX_ADAPT_FOM_RX_ADAPT_FOM(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADAPT_FOM_RX_ADAPT_FOM_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADAPT_FOM_RX_ADAPT_FOM_MASK)

#define X2_RAWLANEX_DIG_AON_RX_ADAPT_FOM_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_RX_ADAPT_FOM_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_RX_ADAPT_FOM_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_RX_ADAPT_FOM_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADAPT_FOM_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADAPT_FOM_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST - Offset values for RX CTLE Loopback path iDAC */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_AFE_CTLE_LBK_IDAC_OFST_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_AFE_CTLE_LBK_IDAC_OFST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_AFE_CTLE_LBK_IDAC_OFST_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_AFE_CTLE_LBK_IDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_AFE_CTLE_LBK_IDAC_OFST_SHIFT)) & X2_RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_AFE_CTLE_LBK_IDAC_OFST_MASK)

#define X2_RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_AFE_CTLE_LBK_IDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST - Offset values for RX DFE Phase Even vDAC */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_DFE_PHASE_EVEN_VDAC_OFST_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_DFE_PHASE_EVEN_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_DFE_PHASE_EVEN_VDAC_OFST_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_DFE_PHASE_EVEN_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_DFE_PHASE_EVEN_VDAC_OFST_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_DFE_PHASE_EVEN_VDAC_OFST_MASK)

#define X2_RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_PHASE_EVEN_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST - Offset values for RX DFE Phase Odd vDAC */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_DFE_PHASE_ODD_VDAC_OFST_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_DFE_PHASE_ODD_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_DFE_PHASE_ODD_VDAC_OFST_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_DFE_PHASE_ODD_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_DFE_PHASE_ODD_VDAC_OFST_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_DFE_PHASE_ODD_VDAC_OFST_MASK)

#define X2_RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_PHASE_ODD_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL - DFE Even reference level */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL_DFE_EVEN_REF_LVL_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL_DFE_EVEN_REF_LVL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL_DFE_EVEN_REF_LVL_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL_DFE_EVEN_REF_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL_DFE_EVEN_REF_LVL_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL_DFE_EVEN_REF_LVL_MASK)

#define X2_RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_EVEN_REF_LVL_RESERVED_15_8_MASK)
/*! @} */

