zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name RAWLANEX_DIG_AON_DFE_ODD_REF_LVL - DFE Odd reference level */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_DFE_ODD_REF_LVL_DFE_ODD_REF_LVL_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_DFE_ODD_REF_LVL_DFE_ODD_REF_LVL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_DFE_ODD_REF_LVL_DFE_ODD_REF_LVL_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_ODD_REF_LVL_DFE_ODD_REF_LVL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_ODD_REF_LVL_DFE_ODD_REF_LVL_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_ODD_REF_LVL_DFE_ODD_REF_LVL_MASK)

#define X2_RAWLANEX_DIG_AON_DFE_ODD_REF_LVL_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_DFE_ODD_REF_LVL_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_DFE_ODD_REF_LVL_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_ODD_REF_LVL_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_ODD_REF_LVL_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_ODD_REF_LVL_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_PHSADJ_LIN - RX Phase Adjust Linear Value */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RX_PHSADJ_LIN_MASK (0x1FU)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RX_PHSADJ_LIN_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RX_PHSADJ_LIN_WIDTH (5U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RX_PHSADJ_LIN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RX_PHSADJ_LIN_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RX_PHSADJ_LIN_MASK)

#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RESERVED_15_5_MASK (0xFFE0U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RESERVED_15_5_SHIFT (5U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RESERVED_15_5_WIDTH (11U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RESERVED_15_5_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RESERVED_15_5_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_PHSADJ_MAP - RX Phase Adjust Mapped Value */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_MAP_RX_PHSADJ_MAP_MASK (0x1FU)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_MAP_RX_PHSADJ_MAP_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_MAP_RX_PHSADJ_MAP_WIDTH (5U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_MAP_RX_PHSADJ_MAP(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_PHSADJ_MAP_RX_PHSADJ_MAP_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_PHSADJ_MAP_RX_PHSADJ_MAP_MASK)

#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_MAP_RESERVED_15_5_MASK (0xFFE0U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_MAP_RESERVED_15_5_SHIFT (5U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_MAP_RESERVED_15_5_WIDTH (11U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_MAP_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_PHSADJ_MAP_RESERVED_15_5_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_PHSADJ_MAP_RESERVED_15_5_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST - Offset values for RX DFE Data Even High vDAC */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_DFE_DATA_EVEN_HIGH_VDAC_OFST_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_DFE_DATA_EVEN_HIGH_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_DFE_DATA_EVEN_HIGH_VDAC_OFST_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_DFE_DATA_EVEN_HIGH_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_DFE_DATA_EVEN_HIGH_VDAC_OFST_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_DFE_DATA_EVEN_HIGH_VDAC_OFST_MASK)

#define X2_RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_DATA_EVEN_HIGH_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL - Custom tx_iboost_lvl values for lfps and ss modes */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_LFPS_MASK (0xFU)
#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_LFPS_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_LFPS_WIDTH (4U)
#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_LFPS(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_LFPS_SHIFT)) & X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_LFPS_MASK)

#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_SS_MASK (0xF0U)
#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_SS_SHIFT (4U)
#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_SS_WIDTH (4U)
#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_SS(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_SS_SHIFT)) & X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_SS_MASK)

#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_OVRD_EN_MASK (0x100U)
#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_OVRD_EN_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_TX_IBOOST_LVL_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_RESERVED_15_9_MASK (0xFE00U)
#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_RESERVED_15_9_SHIFT (9U)
#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_RESERVED_15_9_WIDTH (7U)
#define X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_RESERVED_15_9_SHIFT)) & X2_RAWLANEX_DIG_AON_CUSTOM_TX_IBOOST_LVL_RESERVED_15_9_MASK)
/*! @} */

