zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST - Offset values for RX DFE Data Odd High vDAC */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST_DFE_DATA_ODD_HIGH_VDAC_OFST_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST_DFE_DATA_ODD_HIGH_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST_DFE_DATA_ODD_HIGH_VDAC_OFST_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST_DFE_DATA_ODD_HIGH_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST_DFE_DATA_ODD_HIGH_VDAC_OFST_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST_DFE_DATA_ODD_HIGH_VDAC_OFST_MASK)

#define X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_HIGH_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_DFE_DATA_ODD_LOW_VDAC_OFST - Offset values for RX DFE Data Odd Low vDAC */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_LOW_VDAC_OFST_DFE_DATA_ODD_LOW_VDAC_OFST_MASK (0xFFFFU)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_LOW_VDAC_OFST_DFE_DATA_ODD_LOW_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_LOW_VDAC_OFST_DFE_DATA_ODD_LOW_VDAC_OFST_WIDTH (16U)
#define X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_LOW_VDAC_OFST_DFE_DATA_ODD_LOW_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_LOW_VDAC_OFST_DFE_DATA_ODD_LOW_VDAC_OFST_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_DATA_ODD_LOW_VDAC_OFST_DFE_DATA_ODD_LOW_VDAC_OFST_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST - Offset values for RX DFE By-Pass Even vDAC */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST_DFE_BYPASS_EVEN_VDAC_OFST_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST_DFE_BYPASS_EVEN_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST_DFE_BYPASS_EVEN_VDAC_OFST_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST_DFE_BYPASS_EVEN_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST_DFE_BYPASS_EVEN_VDAC_OFST_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST_DFE_BYPASS_EVEN_VDAC_OFST_MASK)

#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_BYPASS_EVEN_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST - Offset values for RX DFE By-Pass Odd vDAC */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST_DFE_BYPASS_ODD_VDAC_OFST_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST_DFE_BYPASS_ODD_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST_DFE_BYPASS_ODD_VDAC_OFST_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST_DFE_BYPASS_ODD_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST_DFE_BYPASS_ODD_VDAC_OFST_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST_DFE_BYPASS_ODD_VDAC_OFST_MASK)

#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_BYPASS_ODD_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST - Offset values for RX DFE Error Even vDAC */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_DFE_ERROR_EVEN_VDAC_OFST_MASK)

#define X2_RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_ERROR_EVEN_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST - Offset values for RX DFE Error Odd vDAC */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_DFE_ERROR_ODD_VDAC_OFST_MASK)

#define X2_RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_DFE_ERROR_ODD_VDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST - Value for RX IQ PHASE Adjust */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST_RX_IQ_PHASE_ADJUST_MASK (0x7FU)
#define X2_RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST_RX_IQ_PHASE_ADJUST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST_RX_IQ_PHASE_ADJUST_WIDTH (7U)
#define X2_RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST_RX_IQ_PHASE_ADJUST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST_RX_IQ_PHASE_ADJUST_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST_RX_IQ_PHASE_ADJUST_MASK)

#define X2_RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST_RESERVED_15_7_MASK (0xFF80U)
#define X2_RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST_RESERVED_15_7_SHIFT (7U)
#define X2_RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST_RESERVED_15_7_WIDTH (9U)
#define X2_RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST_RESERVED_15_7(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST_RESERVED_15_7_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_IQ_PHASE_ADJUST_RESERVED_15_7_MASK)
/*! @} */

