zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE - MPLLA_COARSE_TUNE */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE_MPLLA_COARSE_TUNE_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE_MPLLA_COARSE_TUNE_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE_MPLLA_COARSE_TUNE_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE_MPLLA_COARSE_TUNE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE_MPLLA_COARSE_TUNE_SHIFT)) & X2_RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE_MPLLA_COARSE_TUNE_MASK)

#define X2_RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_MPLLA_COARSE_TUNE_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE - MPLLB_COARSE_TUNE */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE_MPLLB_COARSE_TUNE_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE_MPLLB_COARSE_TUNE_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE_MPLLB_COARSE_TUNE_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE_MPLLB_COARSE_TUNE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE_MPLLB_COARSE_TUNE_SHIFT)) & X2_RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE_MPLLB_COARSE_TUNE_MASK)

#define X2_RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_MPLLB_COARSE_TUNE_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_INIT_PWRUP_DONE - Initial Power-Up Done Status */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_INIT_PWRUP_DONE_INIT_PWRUP_DONE_MASK (0x1U)
#define X2_RAWLANEX_DIG_AON_INIT_PWRUP_DONE_INIT_PWRUP_DONE_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_INIT_PWRUP_DONE_INIT_PWRUP_DONE_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_INIT_PWRUP_DONE_INIT_PWRUP_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_INIT_PWRUP_DONE_INIT_PWRUP_DONE_SHIFT)) & X2_RAWLANEX_DIG_AON_INIT_PWRUP_DONE_INIT_PWRUP_DONE_MASK)

#define X2_RAWLANEX_DIG_AON_INIT_PWRUP_DONE_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_AON_INIT_PWRUP_DONE_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_AON_INIT_PWRUP_DONE_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_AON_INIT_PWRUP_DONE_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_INIT_PWRUP_DONE_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_AON_INIT_PWRUP_DONE_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_ADPT_ATT - RX Adapted value of ATT */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_ADPT_ATT_ATT_ADPT_VAL_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_ATT_ATT_ADPT_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_ATT_ATT_ADPT_VAL_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_ATT_ATT_ADPT_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADPT_ATT_ATT_ADPT_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADPT_ATT_ATT_ADPT_VAL_MASK)

#define X2_RAWLANEX_DIG_AON_RX_ADPT_ATT_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_ATT_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_ATT_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_ATT_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADPT_ATT_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADPT_ATT_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_ADPT_VGA - RX Adapted value of VGA */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_ADPT_VGA_VGA_ADPT_VAL_MASK (0x3FFU)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_VGA_VGA_ADPT_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_VGA_VGA_ADPT_VAL_WIDTH (10U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_VGA_VGA_ADPT_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADPT_VGA_VGA_ADPT_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADPT_VGA_VGA_ADPT_VAL_MASK)

#define X2_RAWLANEX_DIG_AON_RX_ADPT_VGA_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_VGA_RESERVED_15_10_SHIFT (10U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_VGA_RESERVED_15_10_WIDTH (6U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_VGA_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADPT_VGA_RESERVED_15_10_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADPT_VGA_RESERVED_15_10_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_ADPT_CTLE - RX Adapted value of CTLE */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_CTLE_BOOST_ADPT_VAL_MASK (0x3FFU)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_CTLE_BOOST_ADPT_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_CTLE_BOOST_ADPT_VAL_WIDTH (10U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_CTLE_BOOST_ADPT_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_CTLE_BOOST_ADPT_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_CTLE_BOOST_ADPT_VAL_MASK)

#define X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_CTLE_POLE_ADPT_VAL_MASK (0x1C00U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_CTLE_POLE_ADPT_VAL_SHIFT (10U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_CTLE_POLE_ADPT_VAL_WIDTH (3U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_CTLE_POLE_ADPT_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_CTLE_POLE_ADPT_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_CTLE_POLE_ADPT_VAL_MASK)

#define X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_RESERVED_15_13_MASK (0xE000U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_RESERVED_15_13_SHIFT (13U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_RESERVED_15_13_WIDTH (3U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_RESERVED_15_13_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADPT_CTLE_RESERVED_15_13_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1 - RX Adapted value of DFE TAP1 */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1_DFE_TAP1_ADPT_VAL_MASK (0x1FFFU)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1_DFE_TAP1_ADPT_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1_DFE_TAP1_ADPT_VAL_WIDTH (13U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1_DFE_TAP1_ADPT_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1_DFE_TAP1_ADPT_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1_DFE_TAP1_ADPT_VAL_MASK)

#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1_RESERVED_15_13_MASK (0xE000U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1_RESERVED_15_13_SHIFT (13U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1_RESERVED_15_13_WIDTH (3U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1_RESERVED_15_13(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1_RESERVED_15_13_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP1_RESERVED_15_13_MASK)
/*! @} */

