zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name RAWLANEX_DIG_AON_RX_ADAPT_DONE - RX Adaptation Done Status */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_ADAPT_DONE_RX_ADAPT_DONE_MASK (0x1U)
#define X2_RAWLANEX_DIG_AON_RX_ADAPT_DONE_RX_ADAPT_DONE_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_ADAPT_DONE_RX_ADAPT_DONE_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_RX_ADAPT_DONE_RX_ADAPT_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADAPT_DONE_RX_ADAPT_DONE_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADAPT_DONE_RX_ADAPT_DONE_MASK)

#define X2_RAWLANEX_DIG_AON_RX_ADAPT_DONE_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_AON_RX_ADAPT_DONE_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_AON_RX_ADAPT_DONE_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_AON_RX_ADAPT_DONE_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADAPT_DONE_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADAPT_DONE_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_FAST_FLAGS - Fast flags for simulation only */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_STARTUP_CAL_MASK (0x1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_STARTUP_CAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_STARTUP_CAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_STARTUP_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_STARTUP_CAL_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_STARTUP_CAL_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_ADAPT_MASK (0x2U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_ADAPT_SHIFT (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_ADAPT_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_AFE_CAL_MASK (0x4U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_AFE_CAL_SHIFT (2U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_AFE_CAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_AFE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_AFE_CAL_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_AFE_CAL_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_CAL_MASK (0x8U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_CAL_SHIFT (3U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_CAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_CAL_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_CAL_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_RE_ADAPT_MASK (0x10U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_RE_ADAPT_SHIFT (4U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_RE_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_RE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_RE_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_RE_ADAPT_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_REFLVL_CAL_MASK (0x20U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_REFLVL_CAL_SHIFT (5U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_REFLVL_CAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_REFLVL_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_REFLVL_CAL_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_REFLVL_CAL_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_IQ_CAL_MASK (0x40U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_IQ_CAL_SHIFT (6U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_IQ_CAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_IQ_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_IQ_CAL_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_IQ_CAL_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_AFE_ADAPT_MASK (0x80U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_AFE_ADAPT_SHIFT (7U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_AFE_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_AFE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_AFE_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_AFE_ADAPT_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_ADAPT_MASK (0x100U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_ADAPT_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_DFE_ADAPT_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_SUP_MASK (0x200U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_SUP_SHIFT (9U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_SUP_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_SUP(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_SUP_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_SUP_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_TX_CMN_MODE_MASK (0x400U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_TX_CMN_MODE_SHIFT (10U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_TX_CMN_MODE_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_TX_CMN_MODE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_TX_CMN_MODE_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_TX_CMN_MODE_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_TX_RXDET_MASK (0x800U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_TX_RXDET_SHIFT (11U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_TX_RXDET_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_TX_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_TX_RXDET_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_TX_RXDET_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_PWRUP_MASK (0x1000U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_PWRUP_SHIFT (12U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_PWRUP_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_PWRUP(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_PWRUP_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_PWRUP_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_VCO_WAIT_MASK (0x2000U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_VCO_WAIT_SHIFT (13U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_VCO_WAIT_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_VCO_WAIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_VCO_WAIT_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_VCO_WAIT_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_VCO_CAL_MASK (0x4000U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_VCO_CAL_SHIFT (14U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_VCO_CAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_VCO_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_VCO_CAL_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_FAST_RX_VCO_CAL_MASK)

