zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_RESERVED_15_15_MASK (0x8000U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_RESERVED_15_15_SHIFT (15U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_RESERVED_15_15_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_RESERVED_15_15(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_RESERVED_15_15_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_RESERVED_15_15_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2 - RX Adapted value of DFE TAP2 */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2_DFE_TAP2_ADPT_VAL_MASK (0xFFFU)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2_DFE_TAP2_ADPT_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2_DFE_TAP2_ADPT_VAL_WIDTH (12U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2_DFE_TAP2_ADPT_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2_DFE_TAP2_ADPT_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2_DFE_TAP2_ADPT_VAL_MASK)

#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2_RESERVED_15_12_MASK (0xF000U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2_RESERVED_15_12_SHIFT (12U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2_RESERVED_15_12_WIDTH (4U)
#define X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2_RESERVED_15_12(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2_RESERVED_15_12_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_ADPT_DFE_TAP2_RESERVED_15_12_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT - RX last stable iq phase of Right of the eye */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT_RX_PHSADJ_LIN_RIGHT_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT_RX_PHSADJ_LIN_RIGHT_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT_RX_PHSADJ_LIN_RIGHT_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT_RX_PHSADJ_LIN_RIGHT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT_RX_PHSADJ_LIN_RIGHT_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT_RX_PHSADJ_LIN_RIGHT_MASK)

#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT_RESERVED_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT_RESERVED_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT_RESERVED_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT_RESERVED_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_RIGHT_RESERVED_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT - RX last stable iq phase of Left of the eye */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT_RX_PHSADJ_LIN_LEFT_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT_RX_PHSADJ_LIN_LEFT_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT_RX_PHSADJ_LIN_LEFT_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT_RX_PHSADJ_LIN_LEFT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT_RX_PHSADJ_LIN_LEFT_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT_RX_PHSADJ_LIN_LEFT_MASK)

#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT_RESERVED_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT_RESERVED_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT_RESERVED_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT_RESERVED_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_LEFT_RESERVED_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT - RX Adapted value of PHASE IQ */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT_RX_PHSADJ_LIN_ADAPT_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT_RX_PHSADJ_LIN_ADAPT_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT_RX_PHSADJ_LIN_ADAPT_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT_RX_PHSADJ_LIN_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT_RX_PHSADJ_LIN_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT_RX_PHSADJ_LIN_ADAPT_MASK)

#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT_RESERVED_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT_RESERVED_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT_RESERVED_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT_RESERVED_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_PHSADJ_LIN_ADAPT_RESERVED_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN - Sets values for RX SLICER CTRL EVEN signals going to ANA */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_MASK (0xFU)
#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_WIDTH (4U)
#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN_RX_ANA_SLICER_CTRL_E_MASK)

#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN_RESERVED_15_4_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_EVEN_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD - Sets values for RX SLICER CTRL ODD signals going to ANA */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_MASK (0xFU)
#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_WIDTH (4U)
#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD_RX_ANA_SLICER_CTRL_O_MASK)

#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD_RESERVED_15_4_SHIFT)) & X2_RAWLANEX_DIG_AON_RX_SLICER_CTRL_ODD_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS - MPLL Common Calibration Status */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_INIT_MASK (0x1U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_INIT_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_INIT_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_INIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_INIT_SHIFT)) & X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_INIT_MASK)

