zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_DONE_MASK (0x2U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_DONE_SHIFT (1U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_DONE_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_DONE_SHIFT)) & X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_LANE_CMNCAL_MPLL_DONE_MASK)

#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_RESERVED_15_2_SHIFT)) & X2_RAWLANEX_DIG_AON_LANE_CMNCAL_MPLL_STATUS_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_ADPT_CTL_0 - Adaptation Control register #0 */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_ADPT_CTL_0_VAL_MASK  (0xFFFFU)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_0_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_0_VAL_WIDTH (16U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_0_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_ADPT_CTL_0_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_ADPT_CTL_0_VAL_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_ADPT_CTL_1 - Adaptation Control register #1 */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_ADPT_CTL_1_VAL_MASK  (0xFFFFU)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_1_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_1_VAL_WIDTH (16U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_1_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_ADPT_CTL_1_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_ADPT_CTL_1_VAL_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_ADPT_CTL_2 - Adaptation Control register #2 */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_ADPT_CTL_2_VAL_MASK  (0xFFFFU)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_2_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_2_VAL_WIDTH (16U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_2_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_ADPT_CTL_2_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_ADPT_CTL_2_VAL_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_ADPT_CTL_3 - Adaptation Control register #3 */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_ADPT_CTL_3_VAL_MASK  (0xFFFFU)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_3_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_3_VAL_WIDTH (16U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_3_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_ADPT_CTL_3_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_ADPT_CTL_3_VAL_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_ADPT_CTL_4 - Adaptation Control register #4 */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_ADPT_CTL_4_VAL_MASK  (0xFFFFU)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_4_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_4_VAL_WIDTH (16U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_4_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_ADPT_CTL_4_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_ADPT_CTL_4_VAL_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_ADPT_CTL_5 - Adaptation Control register #5 */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_ADPT_CTL_5_VAL_MASK  (0xFFFFU)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_5_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_5_VAL_WIDTH (16U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_5_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_ADPT_CTL_5_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_ADPT_CTL_5_VAL_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_ADPT_CTL_6 - Adaptation Control register #6 */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_ADPT_CTL_6_VAL_MASK  (0xFFFFU)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_6_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_6_VAL_WIDTH (16U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_6_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_ADPT_CTL_6_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_ADPT_CTL_6_VAL_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_ADPT_CTL_7 - Adaptation Control register #7 */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_ADPT_CTL_7_VAL_MASK  (0xFFFFU)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_7_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_7_VAL_WIDTH (16U)
#define X2_RAWLANEX_DIG_AON_ADPT_CTL_7_VAL(x)    (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_ADPT_CTL_7_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_ADPT_CTL_7_VAL_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_MPLL_DISABLE - LANE_MPLLA/B_DISABLE override */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_MPLL_DISABLE_LANE_MPLLA_DISABLE_MASK (0x1U)
#define X2_RAWLANEX_DIG_AON_MPLL_DISABLE_LANE_MPLLA_DISABLE_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_MPLL_DISABLE_LANE_MPLLA_DISABLE_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_MPLL_DISABLE_LANE_MPLLA_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_MPLL_DISABLE_LANE_MPLLA_DISABLE_SHIFT)) & X2_RAWLANEX_DIG_AON_MPLL_DISABLE_LANE_MPLLA_DISABLE_MASK)

#define X2_RAWLANEX_DIG_AON_MPLL_DISABLE_LANE_MPLLB_DISABLE_MASK (0x2U)
#define X2_RAWLANEX_DIG_AON_MPLL_DISABLE_LANE_MPLLB_DISABLE_SHIFT (1U)
#define X2_RAWLANEX_DIG_AON_MPLL_DISABLE_LANE_MPLLB_DISABLE_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_MPLL_DISABLE_LANE_MPLLB_DISABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_MPLL_DISABLE_LANE_MPLLB_DISABLE_SHIFT)) & X2_RAWLANEX_DIG_AON_MPLL_DISABLE_LANE_MPLLB_DISABLE_MASK)

#define X2_RAWLANEX_DIG_AON_MPLL_DISABLE_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANEX_DIG_AON_MPLL_DISABLE_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANEX_DIG_AON_MPLL_DISABLE_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANEX_DIG_AON_MPLL_DISABLE_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_MPLL_DISABLE_RESERVED_15_2_SHIFT)) & X2_RAWLANEX_DIG_AON_MPLL_DISABLE_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_FAST_FLAGS_2 - Fast flags for simulation only */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_CAL_ADAPT_MASK (0x1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_CAL_ADAPT_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_CAL_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_CAL_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_CAL_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_CAL_ADAPT_MASK)

