zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_ADAPT_MASK (0x2U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_ADAPT_SHIFT (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_ADAPT_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_DATA_CAL_MASK (0x4U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_DATA_CAL_SHIFT (2U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_DATA_CAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_DATA_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_DATA_CAL_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_DATA_CAL_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_PHASE_CAL_MASK (0x8U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_PHASE_CAL_SHIFT (3U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_PHASE_CAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_PHASE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_PHASE_CAL_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_PHASE_CAL_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_AFE_CAL_MASK (0x10U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_AFE_CAL_SHIFT (4U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_AFE_CAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_AFE_CAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_AFE_CAL_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CONT_AFE_CAL_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_IQ_ADAPT_MASK (0x20U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_IQ_ADAPT_SHIFT (5U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_IQ_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_IQ_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_IQ_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_IQ_ADAPT_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RX_IQ_DELTA_ADD_MASK (0x40U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RX_IQ_DELTA_ADD_SHIFT (6U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RX_IQ_DELTA_ADD_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RX_IQ_DELTA_ADD(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RX_IQ_DELTA_ADD_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RX_IQ_DELTA_ADD_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_ATT_ADAPT_MASK (0x80U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_ATT_ADAPT_SHIFT (7U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_ATT_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_ATT_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_ATT_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_ATT_ADAPT_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CTLE_ADAPT_MASK (0x100U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CTLE_ADAPT_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CTLE_ADAPT_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CTLE_ADAPT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CTLE_ADAPT_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_FAST_RX_CTLE_ADAPT_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RESERVED_MASK (0x200U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RESERVED_SHIFT (9U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RESERVED_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RESERVED(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RESERVED_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RESERVED_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_SKIP_250US_WAIT_MASK (0x400U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_SKIP_250US_WAIT_SHIFT (10U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_SKIP_250US_WAIT_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_SKIP_250US_WAIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_SKIP_250US_WAIT_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_SKIP_250US_WAIT_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_SKIP_IQ_STEP_SKIP_MASK (0x800U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_SKIP_IQ_STEP_SKIP_SHIFT (11U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_SKIP_IQ_STEP_SKIP_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_SKIP_IQ_STEP_SKIP(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_SKIP_IQ_STEP_SKIP_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_SKIP_IQ_STEP_SKIP_MASK)

#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RSVD_FAST_FLAGS_MASK (0xF000U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RSVD_FAST_FLAGS_SHIFT (12U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RSVD_FAST_FLAGS_WIDTH (4U)
#define X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RSVD_FAST_FLAGS(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RSVD_FAST_FLAGS_SHIFT)) & X2_RAWLANEX_DIG_AON_FAST_FLAGS_2_RSVD_FAST_FLAGS_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS - RTUNE Common Calibration Status */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_INIT_MASK (0x1U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_INIT_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_INIT_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_INIT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_INIT_SHIFT)) & X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_INIT_MASK)

#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_DONE_MASK (0x2U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_DONE_SHIFT (1U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_DONE_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_DONE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_DONE_SHIFT)) & X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_LANE_CMNCAL_RCAL_DONE_MASK)

