zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_RESERVED_15_2_SHIFT)) & X2_RAWLANEX_DIG_AON_LANE_CMNCAL_RCAL_STATUS_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_TXRX_OVRD_IN - Override values for incoming AON TX/RX controls from PCS */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_VAL_MASK (0x1U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_EN_MASK (0x2U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_EN_SHIFT (1U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RX_DISABLE_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_VAL_MASK (0x4U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_VAL_SHIFT (2U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_EN_MASK (0x8U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_EN_SHIFT (3U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_TX_DISABLE_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RESERVED_15_4_SHIFT)) & X2_RAWLANEX_DIG_AON_TXRX_OVRD_IN_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST - Offset value for RX AFE ATT_2 iDAC */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST_AFE_ATT_2_IDAC_OFST_MASK (0xFFU)
#define X2_RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST_AFE_ATT_2_IDAC_OFST_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST_AFE_ATT_2_IDAC_OFST_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST_AFE_ATT_2_IDAC_OFST(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST_AFE_ATT_2_IDAC_OFST_SHIFT)) & X2_RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST_AFE_ATT_2_IDAC_OFST_MASK)

#define X2_RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST_RESERVED_15_8_MASK (0xFF00U)
#define X2_RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST_RESERVED_15_8_SHIFT (8U)
#define X2_RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST_RESERVED_15_8_WIDTH (8U)
#define X2_RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST_RESERVED_15_8(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST_RESERVED_15_8_SHIFT)) & X2_RAWLANEX_DIG_AON_AFE_ATT_2_IDAC_OFST_RESERVED_15_8_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN - Override incoming values for rxtx_cc */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_VAL_MASK (0x1U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_VAL_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_VAL_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_VAL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_VAL_SHIFT)) & X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_VAL_MASK)

#define X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_EN_MASK (0x2U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_EN_SHIFT (1U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_EN_SHIFT)) & X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RXTX_CC_OVRD_EN_MASK)

#define X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RESERVED_15_2_SHIFT)) & X2_RAWLANEX_DIG_AON_RXTX_CC_OVRD_IN_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN - Incoming value of CC status from TCA */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN_rxtx_cc_in_i_MASK (0x1U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN_rxtx_cc_in_i_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN_rxtx_cc_in_i_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN_rxtx_cc_in_i(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN_rxtx_cc_in_i_SHIFT)) & X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN_rxtx_cc_in_i_MASK)

#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_IN_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT - Current values for outgoing CC status to PMA */
/*! @{ */

#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT_rxtx_cc_out_MASK (0x1U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT_rxtx_cc_out_SHIFT (0U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT_rxtx_cc_out_WIDTH (1U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT_rxtx_cc_out(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT_rxtx_cc_out_SHIFT)) & X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT_rxtx_cc_out_MASK)

#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_AON_RXTX_CC_STATUS_OUT_RESERVED_15_1_MASK)
/*! @} */

