zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ - Reset routine request */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ_RESET_RTN_REQ_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ_RESET_RTN_REQ_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ_RESET_RTN_REQ_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ_RESET_RTN_REQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ_RESET_RTN_REQ_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ_RESET_RTN_REQ_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RESET_RTN_REQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ - Rx reset interrupt */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_RX_RESET_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_RX_RESET_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_RX_RESET_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_RX_RESET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_RX_RESET_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_RX_RESET_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ - Rx request interrupt */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_RX_REQ_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_RX_REQ_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_RX_REQ_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_RX_REQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_RX_REQ_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_RX_REQ_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ - Rx rate change interrupt request */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_RX_RATE_IRQ_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_RX_RATE_IRQ_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_RX_RATE_IRQ_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_RX_RATE_IRQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_RX_RATE_IRQ_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_RX_RATE_IRQ_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ - Rx pstate change interrupt request */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_RX_PSTATE_IRQ_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_RX_PSTATE_IRQ_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_RX_PSTATE_IRQ_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_RX_PSTATE_IRQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_RX_PSTATE_IRQ_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_RX_PSTATE_IRQ_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ - Rx adaptation request interrupt */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RX_ADAPT_REQ_IRQ_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RX_ADAPT_REQ_IRQ_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RX_ADAPT_REQ_IRQ_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RX_ADAPT_REQ_IRQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RX_ADAPT_REQ_IRQ_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RX_ADAPT_REQ_IRQ_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ - Rx adaptation disable interrupt */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RX_ADAPT_DIS_IRQ_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RX_ADAPT_DIS_IRQ_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RX_ADAPT_DIS_IRQ_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RX_ADAPT_DIS_IRQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RX_ADAPT_DIS_IRQ_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RX_ADAPT_DIS_IRQ_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR - RX reset interrupt clear */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR_RX_RESET_IRQ_CLR_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR_RX_RESET_IRQ_CLR_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR_RX_RESET_IRQ_CLR_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR_RX_RESET_IRQ_CLR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR_RX_RESET_IRQ_CLR_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR_RX_RESET_IRQ_CLR_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_RESET_IRQ_CLR_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR - RX request interrupt clear */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR_RX_REQ_IRQ_CLR_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR_RX_REQ_IRQ_CLR_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR_RX_REQ_IRQ_CLR_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR_RX_REQ_IRQ_CLR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR_RX_REQ_IRQ_CLR_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR_RX_REQ_IRQ_CLR_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_REQ_IRQ_CLR_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR - RX rate change interrupt clear */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR_RX_RATE_IRQ_CLR_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR_RX_RATE_IRQ_CLR_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR_RX_RATE_IRQ_CLR_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR_RX_RATE_IRQ_CLR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR_RX_RATE_IRQ_CLR_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR_RX_RATE_IRQ_CLR_MASK)

