zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_RATE_IRQ_CLR_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR - RX pstate change interrupt clear */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR_RX_PSTATE_IRQ_CLR_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR_RX_PSTATE_IRQ_CLR_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR_RX_PSTATE_IRQ_CLR_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR_RX_PSTATE_IRQ_CLR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR_RX_PSTATE_IRQ_CLR_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR_RX_PSTATE_IRQ_CLR_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_PSTATE_IRQ_CLR_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR - RX adaptation request interrupt clear */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR_RX_ADAPT_REQ_IRQ_CLR_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR_RX_ADAPT_REQ_IRQ_CLR_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR_RX_ADAPT_REQ_IRQ_CLR_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR_RX_ADAPT_REQ_IRQ_CLR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR_RX_ADAPT_REQ_IRQ_CLR_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR_RX_ADAPT_REQ_IRQ_CLR_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_REQ_IRQ_CLR_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR - RX adaptation disable interrupt clear */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR_RX_ADAPT_DIS_IRQ_CLR_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR_RX_ADAPT_DIS_IRQ_CLR_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR_RX_ADAPT_DIS_IRQ_CLR_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR_RX_ADAPT_DIS_IRQ_CLR(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR_RX_ADAPT_DIS_IRQ_CLR_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR_RX_ADAPT_DIS_IRQ_CLR_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_RX_ADAPT_DIS_IRQ_CLR_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_IRQ_CTL_IRQ_MASK - Interrupt Mask */
/*! @{ */

#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_REQ_IRQ_MSK_MASK (0x1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_REQ_IRQ_MSK_SHIFT (0U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_REQ_IRQ_MSK_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_REQ_IRQ_MSK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_REQ_IRQ_MSK_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_REQ_IRQ_MSK_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_RATE_IRQ_MSK_MASK (0x2U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_RATE_IRQ_MSK_SHIFT (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_RATE_IRQ_MSK_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_RATE_IRQ_MSK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_RATE_IRQ_MSK_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_RATE_IRQ_MSK_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_PSTATE_IRQ_MSK_MASK (0x4U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_PSTATE_IRQ_MSK_SHIFT (2U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_PSTATE_IRQ_MSK_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_PSTATE_IRQ_MSK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_PSTATE_IRQ_MSK_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_PSTATE_IRQ_MSK_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_REQ_IRQ_MSK_MASK (0x8U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_REQ_IRQ_MSK_SHIFT (3U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_REQ_IRQ_MSK_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_REQ_IRQ_MSK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_REQ_IRQ_MSK_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_REQ_IRQ_MSK_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_DIS_IRQ_MSK_MASK (0x10U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_DIS_IRQ_MSK_SHIFT (4U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_DIS_IRQ_MSK_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_DIS_IRQ_MSK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_DIS_IRQ_MSK_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_ADAPT_DIS_IRQ_MSK_MASK)

#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_RESET_IRQ_MSK_MASK (0x20U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_RESET_IRQ_MSK_SHIFT (5U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_RESET_IRQ_MSK_WIDTH (1U)
#define X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_RESET_IRQ_MSK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_RESET_IRQ_MSK_SHIFT)) & X2_RAWLANEX_DIG_IRQ_CTL_IRQ_MASK_RX_RESET_IRQ_MSK_MASK)

