zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
#define X2_RAWLANEX_DIG_PMA_XF_RX_OVRD_OUT_RESERVED_15_4_MASK (0xFFF0U)
#define X2_RAWLANEX_DIG_PMA_XF_RX_OVRD_OUT_RESERVED_15_4_SHIFT (4U)
#define X2_RAWLANEX_DIG_PMA_XF_RX_OVRD_OUT_RESERVED_15_4_WIDTH (12U)
#define X2_RAWLANEX_DIG_PMA_XF_RX_OVRD_OUT_RESERVED_15_4(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PMA_XF_RX_OVRD_OUT_RESERVED_15_4_SHIFT)) & X2_RAWLANEX_DIG_PMA_XF_RX_OVRD_OUT_RESERVED_15_4_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PMA_XF_RX_PMA_IN - Current values for coming RX status controls from PMA */
/*! @{ */

#define X2_RAWLANEX_DIG_PMA_XF_RX_PMA_IN_ACK_MASK (0x1U)
#define X2_RAWLANEX_DIG_PMA_XF_RX_PMA_IN_ACK_SHIFT (0U)
#define X2_RAWLANEX_DIG_PMA_XF_RX_PMA_IN_ACK_WIDTH (1U)
#define X2_RAWLANEX_DIG_PMA_XF_RX_PMA_IN_ACK(x)  (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PMA_XF_RX_PMA_IN_ACK_SHIFT)) & X2_RAWLANEX_DIG_PMA_XF_RX_PMA_IN_ACK_MASK)

#define X2_RAWLANEX_DIG_PMA_XF_RX_PMA_IN_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_PMA_XF_RX_PMA_IN_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_PMA_XF_RX_PMA_IN_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_PMA_XF_RX_PMA_IN_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PMA_XF_RX_PMA_IN_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_PMA_XF_RX_PMA_IN_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL - Lane Rtune Controls */
/*! @{ */

#define X2_RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL_LANE_RTUNE_REQ_MASK (0x1U)
#define X2_RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL_LANE_RTUNE_REQ_SHIFT (0U)
#define X2_RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL_LANE_RTUNE_REQ_WIDTH (1U)
#define X2_RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL_LANE_RTUNE_REQ(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL_LANE_RTUNE_REQ_SHIFT)) & X2_RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL_LANE_RTUNE_REQ_MASK)

#define X2_RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_PMA_XF_LANE_RTUNE_CTL_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1 - Current values for incoming RTUNE status controls from PMA */
/*! @{ */

#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1_RTUNE_ACK_MASK (0x1U)
#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1_RTUNE_ACK_SHIFT (0U)
#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1_RTUNE_ACK_WIDTH (1U)
#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1_RTUNE_ACK(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1_RTUNE_ACK_SHIFT)) & X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1_RTUNE_ACK_MASK)

#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_IN_1_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID - Current value of RX valid from PMA */
/*! @{ */

#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID_RX_VALID_MASK (0x1U)
#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID_RX_VALID_SHIFT (0U)
#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID_RX_VALID_WIDTH (1U)
#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID_RX_VALID(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID_RX_VALID_SHIFT)) & X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID_RX_VALID_MASK)

#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_PMA_XF_SUP_PMA_RX_VALID_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_TX_CTL_TX_FSM_CTL - TX FSM Control */
/*! @{ */

#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_WAIT_MPLL_OFF_TIME_MASK (0x3FU)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_WAIT_MPLL_OFF_TIME_SHIFT (0U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_WAIT_MPLL_OFF_TIME_WIDTH (6U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_WAIT_MPLL_OFF_TIME(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_WAIT_MPLL_OFF_TIME_SHIFT)) & X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_WAIT_MPLL_OFF_TIME_MASK)

#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P2_ALLOW_RXDET_MASK (0x40U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P2_ALLOW_RXDET_SHIFT (6U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P2_ALLOW_RXDET_WIDTH (1U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P2_ALLOW_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P2_ALLOW_RXDET_SHIFT)) & X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P2_ALLOW_RXDET_MASK)

#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P1_ALLOW_RXDET_MASK (0x80U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P1_ALLOW_RXDET_SHIFT (7U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P1_ALLOW_RXDET_WIDTH (1U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P1_ALLOW_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P1_ALLOW_RXDET_SHIFT)) & X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P1_ALLOW_RXDET_MASK)

#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P0S_ALLOW_RXDET_MASK (0x100U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P0S_ALLOW_RXDET_SHIFT (8U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P0S_ALLOW_RXDET_WIDTH (1U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P0S_ALLOW_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P0S_ALLOW_RXDET_SHIFT)) & X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P0S_ALLOW_RXDET_MASK)

#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P0_ALLOW_RXDET_MASK (0x200U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P0_ALLOW_RXDET_SHIFT (9U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P0_ALLOW_RXDET_WIDTH (1U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P0_ALLOW_RXDET(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P0_ALLOW_RXDET_SHIFT)) & X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_TX_P0_ALLOW_RXDET_MASK)

#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_RESERVED_15_10_MASK (0xFC00U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_RESERVED_15_10_SHIFT (10U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_RESERVED_15_10_WIDTH (6U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_RESERVED_15_10(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_RESERVED_15_10_SHIFT)) & X2_RAWLANEX_DIG_TX_CTL_TX_FSM_CTL_RESERVED_15_10_MASK)
/*! @} */

