zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_X2.h
/*! @name RAWLANEX_DIG_TX_CTL_TX_CLK_CTL - Select clock to act as TX input clock */
/*! @{ */

#define X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_EN_MASK (0x1U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_EN_SHIFT (0U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_EN_WIDTH (1U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_EN_SHIFT)) & X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_EN_MASK)

#define X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_SEL_MASK (0x1EU)
#define X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_SEL_SHIFT (1U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_SEL_WIDTH (4U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_SEL(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_SEL_SHIFT)) & X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_TX_CLK_SEL_MASK)

#define X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_RESERVED_15_5_MASK (0xFFE0U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_RESERVED_15_5_SHIFT (5U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_RESERVED_15_5_WIDTH (11U)
#define X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_RESERVED_15_5(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_RESERVED_15_5_SHIFT)) & X2_RAWLANEX_DIG_TX_CTL_TX_CLK_CTL_RESERVED_15_5_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_RX_CTL_RX_FSM_CTL - RX FSM control register */
/*! @{ */

#define X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_EN_RX_CTL_FSM_MASK (0x1U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_EN_RX_CTL_FSM_SHIFT (0U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_EN_RX_CTL_FSM_WIDTH (1U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_EN_RX_CTL_FSM(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_EN_RX_CTL_FSM_SHIFT)) & X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_EN_RX_CTL_FSM_MASK)

#define X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_RATE_CHG_IN_P1_MASK (0x2U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_RATE_CHG_IN_P1_SHIFT (1U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_RATE_CHG_IN_P1_WIDTH (1U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_RATE_CHG_IN_P1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_RATE_CHG_IN_P1_SHIFT)) & X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_RATE_CHG_IN_P1_MASK)

#define X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_RESERVED_15_2_MASK (0xFFFCU)
#define X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_RESERVED_15_2_SHIFT (2U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_RESERVED_15_2_WIDTH (14U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_RESERVED_15_2(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_RESERVED_15_2_SHIFT)) & X2_RAWLANEX_DIG_RX_CTL_RX_FSM_CTL_RESERVED_15_2_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL - RX LOS Mask Control */
/*! @{ */

#define X2_RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL_RX_LOS_MASK_CNT_MASK (0x1FFU)
#define X2_RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL_RX_LOS_MASK_CNT_SHIFT (0U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL_RX_LOS_MASK_CNT_WIDTH (9U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL_RX_LOS_MASK_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL_RX_LOS_MASK_CNT_SHIFT)) & X2_RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL_RX_LOS_MASK_CNT_MASK)

#define X2_RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL_RESERVED_15_9_MASK (0xFE00U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL_RESERVED_15_9_SHIFT (9U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL_RESERVED_15_9_WIDTH (7U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL_RESERVED_15_9(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL_RESERVED_15_9_SHIFT)) & X2_RAWLANEX_DIG_RX_CTL_RX_LOS_MASK_CTL_RESERVED_15_9_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL - RX Data Enable Override Control */
/*! @{ */

#define X2_RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_RX_DATA_EN_OVRD_CNT_MASK (0x1FU)
#define X2_RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_RX_DATA_EN_OVRD_CNT_SHIFT (0U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_RX_DATA_EN_OVRD_CNT_WIDTH (5U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_RX_DATA_EN_OVRD_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_RX_DATA_EN_OVRD_CNT_SHIFT)) & X2_RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_RX_DATA_EN_OVRD_CNT_MASK)

#define X2_RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_INT_REF_TRCK_CNT_MASK (0xFFE0U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_INT_REF_TRCK_CNT_SHIFT (5U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_INT_REF_TRCK_CNT_WIDTH (11U)
#define X2_RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_INT_REF_TRCK_CNT(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_INT_REF_TRCK_CNT_SHIFT)) & X2_RAWLANEX_DIG_RX_CTL_RX_DATA_EN_OVRD_CTL_INT_REF_TRCK_CNT_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS - RX continuous offset cancellation status */
/*! @{ */

#define X2_RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS_ENABLE_MASK (0x1U)
#define X2_RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS_ENABLE_SHIFT (0U)
#define X2_RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS_ENABLE_WIDTH (1U)
#define X2_RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS_ENABLE_SHIFT)) & X2_RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS_ENABLE_MASK)

#define X2_RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_RX_CTL_OFFCAN_CONT_STATUS_RESERVED_15_1_MASK)
/*! @} */

/*! @name RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS - RX continuous adaptation status */
/*! @{ */

#define X2_RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS_ENABLE_MASK (0x1U)
#define X2_RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS_ENABLE_SHIFT (0U)
#define X2_RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS_ENABLE_WIDTH (1U)
#define X2_RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS_ENABLE_SHIFT)) & X2_RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS_ENABLE_MASK)

#define X2_RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS_RESERVED_15_1_MASK (0xFFFEU)
#define X2_RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS_RESERVED_15_1_SHIFT (1U)
#define X2_RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS_RESERVED_15_1_WIDTH (15U)
#define X2_RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS_RESERVED_15_1(x) (((uint16_t)(((uint16_t)(x)) << X2_RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS_RESERVED_15_1_SHIFT)) & X2_RAWLANEX_DIG_RX_CTL_ADAPT_CONT_STATUS_RESERVED_15_1_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group X2_Register_Masks */

/*!
 * @}
 */ /* end of group X2_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_X2_H_) */
